{
    "state": "Alaska",
    "pages": [
        {
            "source": "https://www.commerce.alaska.gov/web/cbpl/Corporations.aspx",
            "paragraphs": [
                "In Alaska, For Profit Corporations, Professional Corporations, Limited Liability Companies and Limited Liability Partnerships, and Biennial Reports are due by January 2nd, reports marked after February 1st incur late fee penalties. If you initially filed/registered in an even numbered year the Biennial Report will be due in January of every even numbered year. If you initially filed in an odd numbered year the Biennial Report will be due in January of every odd numbered year. The biennial reporting periods open three months prior to the due date for online or hardcopy filing.",
                "In Alaska, Non Profit Corporations, Cooperatives and Religious Corporations, Biennial Reports are due by July 2nd, and reports post marked after August 1st incur late fee penalties. If you initially filed/registered in an even numbered year the Biennial Report will be due in July of every even numbered year. If you initially filed in an odd numbered year the Biennial Report will be due in July of every odd numbered year. The biennial reporting periods open three months prior to the due date for online or hardcopy filing. ",
                "Before engaging in business activity in Alaska you must obtain a business license. If you have a business license the Corporations Section encourages you to check the status and expiration date to ensure your business license is current. For more information go to the Business Licensing Section at https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing.aspx",
                "In Alaska, before engaging in a business practice regulated under Alaska Statute Title 8 (AS 08) you must obtain a professional license. If you have a professional license the Corporations Section encourages you to check the status and expiration date to ensure your professional license is current. For more information go to the Professional Licensing Section",
                "For questions regarding Professional Licensing in Alaska, contact License@Alaska.Gov",
                "For questions regarding Corporations in Alaska, contact Corporations@Alaska.Gov",
                "For questions regarding Business Licensing in Alaska, contact BusinessLicense@Alaska.Gov",
                "In Alaska, complaints pertaining to business licenses, the sale of tobacco products, and licensed professionals are investigated by the Alaska Division of Corporations's Investigations Unit (https://www.commerce.alaska.gov/web/cbpl/Investigations.aspx).",
                "In Alaska, to initiate a complaint against a business or professional, and to see if your complaint falls within our jurisdiction, fill out a request for contact form (https://www.commerce.alaska.gov/web/portals/5/pub/adm4604.pdf) and submit it to the Division of Corporation's Investigations Unit (https://www.commerce.alaska.gov/web/cbpl/Investigations.aspx).",
                "If you have a complaint about Alaska Statutes, note that Alask Statutes are the law passed by the Alaska State Legislature. go to Alaska State Legislature for the current members of the Alaska State Legislature (http://w3.akleg.gov/index.php), including your local Senator and Representative's contact information.",
                "If you have a complaint about Alaska Regulations, seek the advice of a professional, such as a Certified Public Accountant (CPA) and/or Attorney if you need additional assistance.",
                "In Alaska, there are two classes of businesses: unincorporated and incorporated. In Alaska, an unincorporated business (such as a sole proprietor or partnership) has not been granted formal corporate status by the state and is simply an extension of its owners. Unincorporated business owners control the finances of the business and are generally personally liable for the business’s profits, losses, lawsuits and liabilities. In Alaska, an  incorporated entity (such as business corporation, LLC, LLP, LP, etc.) is an independent legal entity, which exists separately from its owners. Generally an incorporated business is held accountable for the corporation’s profits, losses, lawsuits and liabilities.",
                "A domestic (Alaskan) entity has to register with the Corporations Section. For more information go to Corporations Statutes (https://www.commerce.alaska.gov/web/portals/5/pub/CorporationsStatutesandRegulations.pdf) and look up your specfic entity type.",
                "There are no domestic (Alaskan) entity registration exemptions. For more information go to Corporations Statutes (https://www.commerce.alaska.gov/web/portals/5/pub/CorporationsStatutesandRegulations.pdf) and look up your specific entity type.",
                "A foreign (non-Alaskan) entity has to register with the Corporations Section. Under Corporations Statutes (law) (https://www.commerce.alaska.gov/web/portals/5/pub/CorporationsStatutesandRegulations.pdf), a foreign (non-Alaskan) entity may not transact business in this state until it has authority through the registration of the entity with the Corporations Section and obtained an Alaska Entity Number. Generally, a company is transacting business in this state if it has sales, or payroll, and real or personal property in this state. However, it is the responsibility of the foreign entity or its legal counsel to determine whether it must obtain authority; the Division does not render legal opinions in this matter.An out of state company that transacts business in Alaska without authority may be liable for the years or portions of years during which it transacts business in this state without authority. That liability may be equal to all fees and taxes that would have been imposed, plus penalties. In most cases, an out of state company that transacts business in this state without authority may not maintain an action, suit, or proceeding in a court of this state until it obtains authority.",
                "With regard to foreign (non-Alaskan) entity registration exemptions, per Corporations Statutes (law) (https://www.commerce.alaska.gov/web/portals/5/pub/CorporationsStatutesandRegulations.pdf) foreign (non-Alaskan) entities (business corporations, non-profit corporations, LLC, or LLP) may be exempt from registration with the Corporations Section of this division.Exemptions under Corporations Statutes only apply to foreign entity registration with the Corporations Section and are not exemptions from business licensing requirements with the Business License Section (https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing.aspx) under AS 43.70 or professional licensing with the Professional Licensing Section (https://www.commerce.alaska.gov/web/cbpl/ProfessionalLicensing.aspx). The few Corporation statutory foreign entity registration exemptions are based upon entity types.",
                "Per AS 43.70.020(a) (https://www.commerce.alaska.gov/web/portals/5/pub/BusinessLicenseStatutes.pdf) a business license is required for the privilege of engaging in a business in the State of Alaska.Per AS 43.70.110(1) (https://www.commerce.alaska.gov/web/portals/5/pub/BusinessLicenseStatutes.pdf) \"Business\" means a for-profit or non-profit entity engaging or offering to engage in a trade, a service, a profession, or an activity with the goal of receiving a financial benefit in exchange for the provision of services, or goods, or other property.Per AS 43.70.020(f) a business license may cover multiple lines of business, which are based upon your business activities and NAICS codes (https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing/AKLOBandNAICS.aspx). For more information go to: Multiple Lines of Business FAQs (https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing/MultipleLinesofBusinessFAQs.aspx). For more information, go to: Business Licensing FAQs (https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing/BusinessLicensingFAQs.aspx). Business Licensing Statutes and Regulations (https://www.commerce.alaska.gov/web/portals/5/pub/BusinessLicenseStatutes.pdf).",
                "In Alaska, Exemptions under Business Licensing Statutes only apply to business licensing and are not exemptions from entity registrations with the Corporations Section or professional licensing with the Professional Licensing SectionPer Business Licensing Statutes (law) AS 43.70.105 there are a few exemptions for business licensing, if your activities are limited to the below licenses:a fisheries businessFor information regarding a Fisheries Business License, Direct Market License, Salmon Enhancement Tax, and Surety Bonding contact the Alaska Dept. of Revenue.For information regarding Limited Entry Permits, Interim-Use Permits, Commercial Vessel Licenses, and Crewmember Licenses please contact the Alaska Dept. of Fish and Game.the sale of liquor under a license issued under AS 04.11.For information regarding liquor licenses and the Alaska Beverages Surety Bond contact the Marijuana Control Office.an insurance businessFor information regarding insurance producers licensing and insurance company licensing requirements contact the Alaska Dept. of Commerce, Community, and Economic Development, Division of Insurance .a mining businessFor information regarding an Alaska Mining License contact the Alaska Dept. of Revenue.supplying services as an employeeFor information regarding who is an \"employee\" contact the IRS and/or the Alaska Dept. of Labor .furnishing goods or services by a person who does not represent to be regularly engaged in furnishing goods or services.the activities of an investment club.An investment club is a group of individuals, incorporated or otherwise organized, that engages primarily in investing in securities, that does not sell investment services to another person, that does not advertise, the primary purpose of which is educational.IMPORTANT: If your business activities extend beyond the above exceptions, then you must have a business license.Example: Exemption for the sale of liquor is only for the sale of liquor. If you sell anything else (such as non-alcoholic mixes or beverages, ice, cups, etc.), then you must have a business license.NOTE: business licensing exemption may exist under Business Licensing Statutes but may not exist under other program or agency statutes. For example:procurement statutory requirements ,professional licensing requirements,grant programs,other businesses,local government, andfederal government requirements.",
                "To apply for a business license with an entity registration exemption request, note the following: IF, after reviewing the above information and links, you believe your foreign (non-Alaskan) entity MAY BE exempt from registering with the Corporations Section THEN:You must apply for a business license hardcopy (in-person, fax, or US Mail) for your application to be reviewed by a Business License Examiner to determine qualification for foreign entity registration exemption.Include a letter, on letterhead, explaining the following:You are requesting exemption from foreign entity registration under Corporation Statutes;Describe your business activities;For example: XYZ Incorporated, a filming company for Flower & Fauna Society.Reference the very specific Corporation Statute exemption, based on your entity type (see above), that you believe you may qualify for;For example: AS 10.06.718(10) an isolated (single) transaction completed within 30 days. .Explain how your business activities very specifically relate to the specific corporation exemption you are seeking (how does \"b\" apply to \"c\");For example: XYZ Incorporated, a filming company for Flower & Fauna Society, will be coming once into Alaska for 10 consecutive days, July 1-10, to film flower and fauna next to oil rigs in Prudhoe Bay.Any other information relevant to the statutes and the exemption you are seeking.For example: XYZ Incorporated is only applying for a one year business license with no intention of renewing, since this will be an isolated (single) trip to Alaska and completed in less than 30 consecutive days. In addition, at the completion of this isolated trip of less than 30 consecutive days to Alaska, XYZ Incorporated will submit Business License: Request to Cancel or Inactivate (form 08-4732) to cancel its business license.IMPORTANT - Processing time for hardcopy filings: Standard processing time from March-September is 10-15 business days. During heavy renewal and filing seasons, October-February, the processing time will be delayed. We do not offer expediting services.Once your application has been reviewed:IF the application is complete, compliant, AND qualifies for entity exemption THEN the business license will be issued. (Tip: watch online and print your business license as soon as it is issued.)IF the application is denied you will be sent a problem letter via U.S. Mail.",
                "To see what the differences between a non-profit corporation and a religious corporation are in Alaska, go to the following link at https://www.commerce.alaska.gov/web/cbpl/corporations/nonprofitandreligiousfaqs.aspx",
                "To obtain tax exempt status in Alaska, go to https://www.commerce.alaska.gov/web/cbpl/corporations/nonprofitandreligiousfaqs.aspx",
                "To see additional State of Alaska resources for charitable organizations, go to https://www.commerce.alaska.gov/web/cbpl/corporations/nonprofitandreligiousfaqs.aspx",
                "In Alaska, a non-profit community association includes information such as : what/why a nonprofit community association; duties; powers; incorporation; bylaws; and an effective nonprofit community association.",
                "In Alaska, Entities, particularly non-profits corporations, may sometimes struggle with maintaining a status of Good Standing with the Corporations Section due to potential loss of knowledge or experience with the frequent change in board members. The following information is provided for your convenience and is not to be interpreted as legal advice. This Division does not provide legal advice.Tips to help maintain a status of Good Standing with the Corporations Section:IF the entity is a domestic (Alaskan) non-profit, after filing the Articles of Incorporation then immediately file online the Initial Report . The Initial Report provides the officials of the entity. Identifying the officials will have significantly impact on the business needs of the entity, other agencies and businesses (such as banks) use this information to determine who has authority to act on behalf of the entity.Note: Failure of a domestic (Alaskan) non-profit to file the Initial Report within 6 months of the Articles of Incorporation being filed for record may result in involuntary dissolution and the entity will cease to exist in the State of Alaska.Consider, for clarification of responsibilities, in the bylaws assign the duties of the statutory required reports and filings to a specific officer of the board. For reporting and filing information, go to:The Entity’s ResponsibilityNote: Do not submit bylaws to this office. The entity is responsible for keeping the bylaws and making them available upon request. For more information on the entity’s responsibility to keep, maintain and make available books and record go to:AS 10.20 for Non-Profit entitiesAS 10.40 for Religious entitiesStatutes and Regulations for CorporationsConsider, for accountability purposes, making statutory required reports and filings actionable items which must be reported at board meetings. Put these on the board meeting agenda to report these actionable items prior to filing and after they have been filed for record.Consider, for tracking purposes, creating a board calendar for planning when to take action on statutorily required reports and filings and put the calendar on the agenda for all board meetings.Consider, to align close to reporting dates, making the date of the board annual elections (per AS 10.20.096) just prior to July:If the non-profit was created in an even-numbered year,then the biennial report is due July 2nd of every even-numbered year.If the non-profit was created in an odd-numbered year,then the biennial report is due July 2nd of every odd-numbered year.When changing officers and directors in-between biennial reports, for compliance purposes, then file a Notice of Change of Officials along with the $25 filing fee. The Notice of Change of Officials can be found online at Corporations Forms & Fees. Consider Tips #1 and #2 to help with this filing.Note: A non-profit must statutorily have at least the following officers: president, vice-president, secretary, treasurer and three directors.Failure to report a change in officials may result in involuntary dissolution or revocation and the entity will cease to exist in the State of Alaska.Consider, to ensure continual compliance, reviewing and updating registered agent information annually. If there is a change in the registered agent information, then file a Statement of Change along with the $25 filing fee. The Statement of Change can be found online at Corporations Forms & Fees. Consider Tips #1 and #2 to help with this filing.Note: failure to report a change in the registered agent information may result in involuntary dissolution or revocation and the entity will cease to exist in the State of Alaska.Consider, for understanding statutory requirements, having all new board members and new registered agents read:The Entity’s ResponsibilityNon-Profit and Religious CorporationsThe applicable statutes and regulations:AS 10.20 for Non-Profit entitiesAS 10.40 for Religious entitiesStatutes and Regulations for Corporations.",
                "In Alaska, for anyone with concerns or issues with an entity we encourage you to seek legal counsel.The Corporations Section of the Division of Corporations, Business and Professional Licensing is mainly a filing agency. This means, IF an entity provides their filings complete and compliant according to statutes ( AS 10) and regulations (3 AAC 16) THEN the Corporations Section may file it for record.IMPORTANT: AS 10 does not give the Corporations Section of this Division the jurisdictional authority to adjudicate over issues or concerns regarding an entity’s internal operations. The authority to adjudicate over these issues rests with the Alaska Court System which may, as a result of a court case, issue a court order for whatever action the court deems appropriate.Anyone seeking to resolve issues with an entity are encouraged to:review Alaska Statutes and Regulations AS 10;contact the entity directly (tip: submit your request in writing and reference the specific statute for the right you are seeking to exercise);seek legal counsel; and/orseek restitution through the Alaska Court System.For more information go to: Complaint FAQs.", 
                "If you have questions about Registered Agents in Alaska, see https://www.commerce.alaska.gov/web/cbpl/Corporations/RegisteredAgentsFAQs.aspx",
                "If you have questions about EIN, FEIN, and TIN in Alaska, see https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing/EIN-FAQs.aspx",
                "For information about Workers' Compensation in Alaska, see https://www.commerce.alaska.gov/web/cbpl/BusinessLicensing/EIN-FAQs.aspx"
            ]
        }
    ]
}
