{
    "state": "Arkansas",
    "pages": [
        {
            "source": "https://www.sos.arkansas.gov/business-commercial-services-bcs/frequently-asked-questions-faqs/",
            "paragraphs": [
                "For questions about Forms/Fees in the state of Arkansas, identify the filing type you want (e.g. domestic or foreign corporation, LLC, etc.), from the list below. Choose to file online by clicking the ONLINE link and proceed to file electronically which is payable by credit card or ACH. If the filing type is not available online or if you prefer to mail or deliver your filing, click \"PDF\" to print a copy, complete the form, attach payment and mail or deliver to the Business and Commercial Services office. Subscribers who utilize monthly billing may view their transaction history here (https://cmbs-admin-ar.cdc.nicusa.com/ar/cust-admin/login.html).",
                "For questions about Franchise Tax / Annual Reports in the state of Arkansas, note that the Arkansas Secretary of State Office is responsible for the collection of the state’s mandatory franchise taxes. Companies who conduct business in Arkansas are required to pay this annual tax, with the first $8 million placed into the state’s general fund and the remaining balance into the Education Adequacy Fund, which provides funding to public schools and higher education. The Arkansas General Assembly’s Act 94 of 2003, Arkansas Code Annotated as 26-54-104, adjusted the state’s franchise tax and changed the tax deadline date to May 1st of the payment year. NOTE: Franchise taxes are owed whether or not business is conducted or a profit is made. Franchise tax is NOT pro-rated and will be owed regardless of how long the business operated in the calendar year. For more information, please see: https://www.sos.arkansas.gov/business-commercial-services-bcs/franchise-tax/.",
                "For questions about Nonprofit / Charitable Entities in the state of Arkansas, note that Act 569 of 2007 requires nonprofit corporations to file an annual report with the Secretary of State’s office by August 1st of each year. For more detailed information, please see: https://www.sos.arkansas.gov/business-commercial-services-bcs/nonprofit-charitable-entities/",
                "For questions about the Uniform Commercial Code (UCC) in the state of Arkansas, please go to the following link: https://www.sos.arkansas.gov/business-commercial-services-bcs/uniform-commercial-code-ucc/",
                "For questions about Notary Public and eNotary in the state of Arkansas, note that Commercial (UCC) Services Division of the Secretary of State records and certifies Notaries Public for the State of Arkansas. A Notary Public verifies the identity on an individual who appears before them. The Notary acts as an official and unbiased witness to the identity of a person whether the person be taking an oath, giving oral or written testimony, or acknowledging his/her signature on a legal document. Pursuant to Act 215 of 2019, if you are a non-resident spouse of a United States military service member working in Arkansas, or operating a business in Arkansas, and wish to become an Arkansas Notary Public, please contact our office at 501-682-1010. For more information, please see: https://www.sos.arkansas.gov/business-commercial-services-bcs/notary-public-and-enotary/",
                "For questions about Apostille / Certification in the state of Arkansas, note that Business and Commercial Services (BCS) facilitates the use of State Documents in Foreign Countries. Many transactions in foreign countries involve documents prepared in the US or issued by state governmental agencies. Whether the transaction involves setting up an import business or adopting a baby, selling products overseas or studying abroad, foreign governments must rely on information provided on documents issued and recorded by states, cities and counties that are unfamiliar to them. To facilitate the acceptance of these documents they must be authenticated or certified in some way. The Arkansas Secretary of State provides this service. Apostille and authentication certificates can be added to documents to verify their authenticity and add to their validity as legal documents. For more information about apostilles or certifications for elected officials please contact our Elections Department at 501-682-5070 or BCS at 501‐682‐3409. For forms and additional information, please see the links provided at the bottom of the following page: https://www.sos.arkansas.gov/business-commercial-services-bcs/apostille-certification/",
                "For questions about Trademark/Service Mark in the state of Arkansas, note that Business and Commercial (UCC) Services records and approves any word, phrase, or symbol used by companies or individuals in the State of Arkansas to identify their goods or services and distinguish them from the goods and services of others used. To conduct a Trademark Search Online, use the following link: https://www.sos.arkansas.gov/corps/trademk/index.php",
                "For information about applying for a trademark in the state of Arkansas, please see the links at the bottom of the following page: https://www.sos.arkansas.gov/business-commercial-services-bcs/trademark-service-mark/",
                "For information about International Student Exchange in the state of Arkansas (ISEVPO: International Student Exchange Visitor Placement Organization Registration (ISEVPO), note that A.C.A. § 6-18-1706 requires organizations that place foreign exchange students in Arkansas schools to register with the Secretary of State’s office. Organizations must register by January 1 immediately preceding the next regular school year in which the organization proposes to place a foreign exchange student. The initial registration fee for these organizations will be $150.00. The renewal fee is $50.00 per year. For more information, please see the links at the bottom of the following page: https://www.sos.arkansas.gov/business-commercial-services-bcs/isevpo-international-student-exchange/",
                "For questions about Email Confirmation from the state of Arkansas, please see the following page: https://www.sos.arkansas.gov/business-commercial-services-bcs/frequently-asked-questions-faqs/email-confirmation-faq",
                "For questions about different types of Corporate Entities in the state of Arkansas, please refer to the information on the following page: https://www.sos.arkansas.gov/business-commercial-services-bcs/frequently-asked-questions-faqs/corporations-faqs"
            ]
        }
    ]
}
