{
    "state": "Arizona",
    "pages": [
        {
            "source": "https://ecorp.azcc.gov/AzFAQ/Index",
            "paragraphs": [
                "To submit documents for filing in Arizona, note the following: You can prepare your documents, or you can hire a licensed professional to prepare them for you. It is strongly recommended that you consult with an attorney and/or an accountant before forming your entity so that you can receive appropriate legal and tax advice for your particular needs. A.C.C. staff cannot tell you what type of entity to form or what language should be included in your documents. You will need to completely prepare your documents before submitting them to the A.C.C. Corporations Division staff cannot assist you in completing the documents. You should submit the completed documents with a cover sheet. When your documents are completely filled out, you can submit them to the Corporations Division in person at the address below, or you can mail the documents with a check to the address below. Do not mail cash. Please read the information on acceptable payment methods here. Faxed documents are accepted only from persons with a money-on-deposit (MOD) account. At this time, we do not accept emailed documents for new entity filings, and documents cannot be submitted electronically by any method. Arizona Corporation Commission, Corporations Division 1300 W. Washington St. Phoenix, Arizona 85007.",
                "Arizona Corporation Commission (A.C.C.) staff are not attorneys or licensed document preparers. Activities such as preparing documents for other persons to file with the A.C.C., assisting with the preparation of such documents, or giving legal opinions, are practicing law. It is illegal to practice law without a license. Our staff are not licensed to practice law and are not licensed document preparers, and we cannot give you advice or assist with the preparation of your documents. The forms we provide have detailed Instructions, and we encourage you to read those, and to seek advice from appropriately licensed professionals such as attorneys or accountants.",
                "In Arizona, The particular form you file depends upon what action is being taken and what the entity type is or will be (corporation or limited liability company). There are separate forms for corporations and for LLCs. Be sure and use corporation forms for a corporation, and LLC forms for LLCs. The document will be rejected if the form type does not match the entity type, and filing fees will not be refunded. Under the eCorp \"File\" page you will find all forms based on the task you are trying to accomplish. It is strongly recommended that you consult with an attorney and/or an accountant before forming your entity so that you can receive appropriate legal and tax advice for your particular needs. A.C.C. staff cannot tell you what type of entity to form or what language should be included in your documents.",
                "In Arizona, You must use the A.C.C. form for the corporation annual report, certificate of disclosure, and corporation statement of bankruptcy. Use of any other form created by or provided by the A.C.C. is optional.",
                "In Arizona, the cost or fee to file documents depends on the type of document being submitted, and the total cost can vary depending on whether you pay for expedited (faster) processing or not. Click here (https://azcc.gov/corporations/fee-and-payment-info) for fee schedules and payment information.",
                "In Arizona, Filing fees are NOT refundable and may not be transferred to a different document.",
                "In Arizona, Payment information and fee schedules are available here (https://azcc.gov/corporations/fee-and-payment-info).",
                "In Arizona, The A.C.C. accepts deposits of monies to be used for paying filing fees of documents submitted to the A.C.C. The monies are deposited into money-on-deposit (\"MOD\") accounts in the name of the holder of the account. Fees are deducted when documents are submitted with a cover sheet that instructs that the MOD account be charged. Each account has monthly statements issued showing the monthly transactions. Anyone can establish a MOD account, although typically it is only done by persons who frequently file documents with this agency. There is no minimum balance. If the account does not have an adequate balance when documents are filed, those documents will be rejected for nonpayment of filing fees. It is up to the MOD account holder to determine whether adequate funds exist in the account – the A.C.C. does not monitor accounts for that purpose and no notices will be sent. Use the SERVICE (https://ecorp.azcc.gov/AzAccount) feature to access a MOD Account Application form that you can submit to establish a MOD account.",
                "With regard to the time it will take to process your document in Arizona, \"Processing time\" means the time it takes our staff to examine your document and either approve it or reject it. Document processing times can vary from week to week. In general, expedited processing typically takes 5 business days or less, and regular processing typically takes 30 business days or less. The current processing times are posted each Monday – click here. The posted processing time is counted in business days only (weekends and holidays are not included). The posted processing time does not include the time it may take to notify customers of the completion of the document or to place it in the mail. Notification or mailing may take extra time after the document has been either approved or rejected.",
                "In Arizona, There are legal and tax differences between corporations and LLCs that require detailed explanation and advice that the A.C.C. cannot provide. In general, corporations are a different entity type than LLCs, and there are differences in how each type of entity is run or operated, and differences in how each is taxed by the Internal Revenue Service. Each type does, in general, provide protection from personal liability for those involved, but the extent of that protection always depends on the facts and circumstances surrounding the individual’s and the entity’s actions. It is recommended that you consult with competent legal and tax professionals in order to make an informed decision about what entity type is best for you. The Arizona Commerce Authority has information at this link: http://www.azcommerce.com/smallbiz, and there are numerous other resources on the internet.",
                "An EIN (employer identification number) is obtained from the Internal Revenue Service, www.irs.gov. The I.R.S. has information on its website on how to apply online for the EIN. A TIN (taxpayer identification number) is issued by the Arizona Department of Revenue, www.azdor.gov. The Arizona Corporation Commission does not issue EINs or TINs.",
                "In Arizona, if your business is only on the Internet - the address you use for the known place of business (KPB, required by statute) must be a street address in Arizona (not a P.O. Box or personal mail box). You can use the statutory agent’s street address as the KPB. The KPB is public record and will be viewable by the public via the internet on our website. If you are the statutory agent and do not want your residential address to be public record, then you should appoint someone else who can be the statutory agent with a street address.",
                "In Arizona, names and addresses provided on documents that are filed with the A.C.C. are public record. The names and addresses that are on filed documents are entered into our database, and that information is viewable by the public on our website via the internet. The documents themselves are also viewable by the public on our website via the internet. The Arizona Corporation Commission is required by law to provide access to this public information via the internet.",
                "In Arizona, documents filed with the A.C.C. are public record, and, if copies are requested, must be provided to the public. The documents and the information are also viewable by the public on the internet. The Arizona Corporation Commission is required by law to provide access to this public information via the internet.",
                "In Arizona, some documents must be published after they are approved for filing. You will be informed in the approval letter whether or not your document needs to be published. Do not publish until the document is approved for filing by the A.C.C.",
                "In Arizona, the A.C.C. does not endorse any particular newspaper, but, as a courtesy to our customers, provides a list of newspapers that have sworn to the A.C.C. that they meet the statutory criteria for publishing documents. Do not publish a document until it has been approved for filing by the A.C.C.",
                "In Arizona, with regard to what you do with the Affidavit of Publication from the newspaper, note the following: it is not required, but you may send the Affidavit of Publication you receive from the newspaper to the A.C.C. for placement into the entity’s public record. If you do not submit the Affidavit of Publication to the A.C.C. you should retain it as part of your entity’s permanent record.",
                "In Arizona, with regard to how you correct an error in a document, note the following: if an error is a typographical error, such as a misspelling or a mix-up of address numbers, then the correction can be made by submitting Statement of Correction. Statement of Correction cannot be used to correct substantive provisions, such as changing directors, officers, or members, or completely changing an address. Statement of Correction also cannot be used to change the name of the entity, with very rare exceptions for minor typographical errors in the name. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature to find the appropriate Statement of Correction form for your entity type (use corporation forms for corporations, and use LLC forms for LLCs). If the form type does not match the entity type, the document will be rejected. Read the Instructions to the Statement of Correction for more information.",
                "In Arizona, if the Commission mispelled your information, note the following: if the document you submitted has the correct spelling but the A.C.C. staff made a mistake when typing in the information, then you may contact our Customer Service Call Center at 602-542-3026 or, within Arizona only, 800-345-5819, to have the error corrected.",
                "If your Arizona entity is administratively dissolved, note the following: Administrative dissolution is an action taken by the Arizona Corporation Commission when an entity fails to meet certain statutory requirements. An administratively dissolved entity may not conduct any business or affairs except that which is necessary to wind up its business or affairs. The entity may, however, apply for reinstatement within 6 years of the date of administrative dissolution. The fee for reinstatement is $100.00. Contact Customer Service with any questions at 602-542-3026, or, within Arizona only, 800-345-5819.",
                "If your Arizona company is out of business, you should not let the entity be administratively dissolved. An administratively dissolved entity is subject to being reinstated. There have been situations where an entity is reinstated by persons who are not actually associated with the entity – this is business identity theft. If you are out of business, it is recommended you voluntarily dissolve or terminate the entity so that you do not subject your entity to potential business identity theft. If your corporation is out of business, you should submit Articles of Dissolution. If your LLC is out of business, you should submit Articles of Termination.",
                "To serve an Arizona entity, find the category of Service of Process under the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FServiceOfProcess%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature for detailed information on serving an entity through the A.C.C.",
                "To get a W-9 from the Arizona Corporation Commission, Click here (https://gao.az.gov/resources/tax-certificates) for the W-9 form from the Arizona General Accounting Office.",
                "In Arizona, a Statutory Agent is an individual or a business entity that the corporation or LLC appoints for the purpose of accepting service of process (lawsuit papers or legal documents) for the entity. The agent is called a \"statutory\" agent because a statute requires that the entity appoint someone for this purpose. If, for example, a lawsuit is filed against the entity, the Statutory Agent will be the one who is served (receives the papers on behalf of the entity), and then the Statutory Agent should give the papers to the entity. The law requires that corporations and LLCs maintain a statutory agent with a valid Arizona street address (not a P.O. Box or personal mail box) on the records of the Arizona Corporation Commission at all times, and the failure to do so will subject the entity to being administratively dissolved. Official notices from the Arizona Corporation Commission will be sent to the statutory agent.",
                "In Arizona, a Statutory Agent can be an individual, or an Arizona corporation or LLC, or a foreign corporation or LLC that is authorized to transact business in Arizona. A corporation or LLC cannot be its own Statutory Agent – it must appoint someone apart from itself. For example, the corporation can appoint one of its directors or officers in his or her capacity as an individual as the statutory agent, but cannot appoint the corporation itself as the statutory agent. If an individual is appointed as the statutory agent, that individual must be 18 years old or older, and must be a permanent, full-time resident of the State of Arizona, and must have a permanent, full-time physical or street address in the State of Arizona. The mailing address, if any, of that individual statutory agent must also be in Arizona.",
                "In Arizona, the statutory agent must accept the appointment in writing. The statutory agent can accept the appointment by completing and submitting the Statutory Agent Acceptance form found on our website here. If the statutory agent is an entity, an authorized agent of that entity can sign the acceptance. An authorized agent is anyone given authority to sign for that entity.",
                "The Arizona entity (corporation or LLC) can submit a Statement of Change form to appoint a different statutory agent. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FIndex%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D100) feature to find the appropriate Statement of Change form for your entity type (corporations use corporation forms, and LLCs use LLC forms). If the form type does not match the entity type, the document will be rejected. Read the Instructions to the form to ensure that you complete the form correctly.",
                "In Arizona, a statutory agent can resign by completing and submitting a Statutory Agent Resignation. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FIndex%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D100) feature to find the appropriate resignation form for your entity type (use corporation forms for corporations, and use LLC forms for LLCs). If the form type does not match the entity type, the document will be rejected.",
                "In Arizona, to change your statutory agent's address, note the following: The statutory agent or the entity (corporation or LLC) may change the statutory agent’s address by submitting a Statement of Change form. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature to find the appropriate Statement of Change for your entity type (use corporation forms for corporations, and use LLC forms for LLCs). If the form type does not match the entity type, the document will be rejected. Read the Instructions to the form to ensure that you complete the form correctly.",
                "To reserve a corporation or LLC name in Arizona, note the following: entity name reservations can be completed online, using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature, for $45 (filing fee of $10 plus $35 expedite fee). In the alternative, you may submit a paper Application to reserve either a corporation or LLC Name. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature to find the appropriate form. For information on name criteria or requirements, click here (https://azcc.gov/corporations/naming-policy) or see the Instructions to the forms.",
                "In Arizona, name reservation is not required. An approved name reservation holds the entity name for 120 days. If you want to hold the entity name while you prepare the formation paperwork or while the formation paperwork is being processed, then you may want to obtain a name reservation online using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature, or you can submit an expedited paper Application to Reserve either a corporation or LLC name. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature to find the appropriate paper form.",
                "In Arizona, there are different naming requirements for corporations and LLCs. In general, entity names must be distinguishable from other existing entity names or trade names, and must contain certain entity \"identifiers,\" such as \"Inc.\" for a corporation or \"LLC\" for a limited liability company. To view the naming criteria, click here (https://azcc.gov/corporations/naming-policy). Read the Instructions to the document you are submitting for more detailed information on the naming requirements.",
                "In Arizona, the A.C.C. does not register \"dba\" or \"doing business as\" names and does not register trade names. You can record \"dba\" names in the County Recorder’s office. You can obtain a trade name through the Secretary of State’s office, www.azsos.gov.",
                "In Arizona, a name reservation is not the same as a trade name or a \"dba\" name. A name reservation merely holds the entity name on the A.C.C. system for a period of 120 days, to give you time to form either a corporation or LLC. A trade name is active for a period of 5 years, and carries legal rights associated with it, as may a \"dba\" name. Trade names are obtained through the Secretary of State’s office, www.azsos.gov, and their website contains extensive information on trade names. \"DBA\" names are recorded at the County Recorder’s Office.",
                "To register a foreign corporation name in Arizona, complete and submit an Application to Register Foreign Corporation Name. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FIndex%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D100) feature to access the form. Please note that an approved name registration does not grant authority to transact business in Arizona, and it is not necessary to register the name in order to seek authority to transact business in Arizona. To obtain authority to transact business in Arizona, complete and submit an Application for Authority (access the form through the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FIndex%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D100) feature).",
                "A foreign corporation is not required to register its name in Arizona. If the foreign corporation is going to transact business or conduct affairs in Arizona, it must apply for authority to do so by completing and submitting an Application for Authority; however, separately registering the name is not required.",
                "In Arizona, a name reservation holds the name on the A.C.C. system for a period of 120 days and is non-renewable. Any person can obtain a name reservation. Name registration is available only to foreign corporations, is active for a one-year period, and can be renewed for successive one-year periods.",
                "If your Arizona entity's record shows a \"name conflict\", note the following: entity names must be distinguishable from other existing entity names. The A.C.C. computer system checks each entity name against all other names in the database. If it finds a name it considers indistinguishable, it will flag a potential name conflict. If your entity formation was approved, then the examiner determined there was no name conflict, and you can ignore the flag. If the name conflict was a reason for rejection of the document, the rejection letter you receive will inform you of that and will tell you how to resubmit.",
                "To form a corporation in Arizona, note that a corporation is formed or created by submitting Articles of Incorporation to the Arizona Corporation Commission (\"A.C.C.\"). The A.C.C. staff will examine the articles for statutory compliance and either approve the articles for filing or reject the articles with instructions on how to resubmit the document. Once the articles are approved for filing, the corporation is incorporated (formed or created). Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the A.C.C. form for Articles of Incorporation."
                "To form a nonprofit corporatio in Arizona, note the following: a nonprofit corporation is formed the same way a for-profit or business corporation is formed, but the statutory requirements for the articles of incorporation are a little different. A nonprofit corporation is formed or created by submitting Articles of Incorporation to the Arizona Corporation Commission (\"A.C.C.\"). The A.C.C. staff will examine the articles for statutory compliance and either approve the articles for filing or reject the articles with instructions on how to resubmit the document. Once the articles are approved for filing, the corporation is incorporated (formed or created). Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the A.C.C. form for Articles of Incorporation. \"Nonprofit\" does not mean \"tax-exempt\" in Arizona. The A.C.C. form for nonprofit articles of incorporation meets only the Arizona statutory minimum requirements to form a nonprofit corporation, and does NOT contain language that might be required by the I.R.S. to obtain tax-exempt status. You should seek legal or tax advice, or research the I.R.S. (www.irs.gov) requirements before submitting any documents to the A.C.C.",
                "In Arizona, S corp, C corp, and 501c3 are all Internal Revenue Service (I.R.S.) code references. Those designations pertain only to tax status, and are not actually types of corporations. In Arizona, you would simply form either a for-profit corporation or a nonprofit corporation. The corporation’s tax status would later be determined by the I.R.S. and not by the A.C.C. Please note that the I.R.S. may require specific language in the articles of incorporation to obtain tax-exempt status, and that language is NOT included in the Arizona Corporation Commission forms. You should research the I.R.S. requirements at www.irs.gov before submitting any documents to the A.C.C.",
                "The Internal Revenue Service (I.R.S.) determines tax status. Consult the I.R.S. website, www.irs.gov, for information on how to apply for tax-exempt status. Please note that the I.R.S. may require specific language in the articles of incorporation or organization, and that language is NOT included in the A.C.C. forms. You should research the I.R.S. requirements before submitting any documents to the A.C.C.",
                "In Arizona, typically, persons such as doctors, accountants, or lawyers form professional corporations. You should check with the agency or board that licenses your profession to see if it requires you to form a professional corporation or if it prohibits you from forming a professional corporation. The Arizona Corporation Commission staff cannot tell you whether you can or should form a professional corporation, because this issue may involve legal or tax advice, and A.C.C. staff are not licensed attorneys or accountants, and cannot give legal or tax advice to the public.",
                "In Arizona, the corporation is required by law to adopt bylaws. Bylaws are written rules that govern how the corporation operates internally, such as how the Board of Directors will be elected and what votes are required for a particular action. Bylaws can have any provision in them that is not prohibited by law. See A.R.S. § 10-206 and 10-3206 (https://www.azleg.gov/ArizonaRevisedStatutes.asp?Title=10). The A.C.C. does not have a form for bylaws, and A.C.C. staff cannot advise you concerning the content of bylaws. DO NOT FILE bylaws with the Arizona Corporation Commission.",
                "Bylaws are not filled with the A.C.C., bylaws will not be accepted for filing and they will not be mailed back to you. Do not submit bylaws to the A.C.C.",
                "Bylaws are not filed with the A.C.C., so the A.C.C. cannot provide copies of them. We suggest contacting the Board of Directors, an officer, or the statutory agent of the corporation.",
                "The Arizona known place of business address may be changed when the corporation submits its annual report, or it may be changed by submitting a Statement of Change form. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the Corporation Statement of Change form.",
                "In Arizona, officers and directors may be changed when the corporation submits its annual report, or they may be changed by submitting an Officer/Director/Shareholder Change form. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the Officer/Director/Shareholder Change Form.",
                "In Arizona, the corporation must submit Articles of Amendment to the A.C.C. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the Articles of Amendment form. The form provided by the A.C.C. covers the statutory requirements for amendments, but the corporation will have to attach to it the actual amendment written out. Read the Instructions to the Articles of Amendment for detailed information about the sections of the Articles of Amendment form. A.C.C. staff cannot tell you what to write for the amendment, but we suggest that you reference each section or article of the Articles of Incorporation that is being amended and then state clearly and simply the amendment or change being made to that section or article.",
                "In Arizona, \"Voting group\" means all shares of one or more classes or series of stock that are entitled to vote and be counted together collectively at a shareholder meeting. For example, if the corporation has different series of common stock, each series is a voting group. If the corporation has only common stock and not different series of it, then there is only one voting group. See A.R.S. § 10-140(50) (https://www.azleg.gov/arstitle/) for the full definition. Statutes are available on the Arizona Legislature’s website, www.azleg.gov, by following the link for Arizona Revised Statutes.",
                "An Arizona corporation can become a corporation of another state by submitting a Statement of Domestication to the A.C.C. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form. Read the accompanying Instructions to the Statement of Domestication for more information. You should consult with an attorney so that you can receive appropriate legal advice for your particular needs. The A.C.C. cannot advise you about domestication or any other legal issue.",
                "In Arizona, Corporations that file bankruptcy must complete and submit to the A.C.C. a Statement of Bankruptcy. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form. Individuals who file bankruptcy, such as officers or directors, do not need to report that individual bankruptcy to the A.C.C.",
                "In Arizona, Corporation documents submitted to the A.C.C. may be signed by either a duly-authorized officer or the Chairman of the Board of Directors. \"Duly-authorized\" means that the corporation has granted that officer authority to sign on behalf of the corporation. The person signing should always list his or her title underneath the signature, such as \"President,\" or \"Chairman of the Board.\" If a document is signed by someone designated only as \"Director,\" the document will be rejected for an improper signature.",
                "In Arizona, a Certificate of Good Standing may be obtained online using the SERVICE (v/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D22) feature, for a fee of $45 ($10 fee plus $35 expedite fee). In the alternative, you may submit a paper Records Request form by mail or in person at 1300 W. Washington St., Phoenix, AZ 85007. Use the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FMODAccount%2FAddModAccount%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature to access the Records Request form.",
                "In Arizona, see  the Statement of Conversion and the accompanying instructions. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form. You should consult with an attorney so that you can receive appropriate legal advice for your particular needs. The A.C.C. cannot advise you about conversion or any other legal issue.",
                "In Arizona, a benefit corporation is a for-profit corporation formed under A.R.S. §§ 10-2401 through 10-2442. The A.C.C. does not offer a form specifically for benefit corporations. You should review the statutes to make sure that the Articles of Incorporation you prepare for your benefit corporation contain all necessary requirements.",
                "In Arizona, an LLC is formed or created by submitting Articles of Organization to the Arizona Corporation Commission (\"A.C.C.\"). The A.C.C. staff will examine the articles for statutory compliance and will either approve the articles for filing or reject the articles with instructions on how to resubmit the document. Once the articles are approved for filing, the LLC is organized (formed or created). Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to find the A.C.C. form for Articles of Organization.",
                "In Arizona, you cannot form a nonprofit LLC, but you can form an LLC and then apply to the I.R.S. for tax-exempt status. There are only LLCs in Arizona, not specifically nonprofit LLCs. If you want a tax-exempt LLC, you would form an LLC and then apply to the Internal Revenue Service for tax-exempt status, www.irs.gov. The I.R.S. may require particular language in the Articles of Organization in order to obtain tax-exempt status, and that language is NOT included in the A.C.C. forms. You should research the I.R.S. requirements before submitting any documents to the A.C.C.",
                "In Arizona, the LLC must have at least one member. A limited liability company is owned by its members.",
                "In Arizona, you can have a single member LLC",
                "In Arizona, the same person can be both the only member and the only manager.",
                "The records of the Arizona Corporation Commission will reflect only members or managers – no \"managing member\" can be listed. If the LLC is set up with a Manager Structure (it is manager-managed), then it will have one or more managers, and those managers may also be members, but the A.C.C. does not recognize a title of \"managing member.” If the LLC has a Member Structure (it is member-managed), then the A.C.C. will recognize only members, but not a \"managing member\".",
                "Members of an LLC are its owners, much like shareholders of a corporation own the corporation. Managers of LLCs are like the board of directors or the officers of a corporation. If a manager is also a member, then the manager may have an ownership interest in the LLC. If the manager is just a manager and is not also a member, then the manager has no ownership interest in the LLC. If the LLC is member-managed, then the members as a group run the day-to-day operations of the LLC, subject to any operating agreement. Member-managed LLCs where each member has a vote function very similarly to partnerships. If the LLC is manager-managed, the manager or managers run the day-to-day operations of the LLC instead of the members, subject to any operating agreement. Manager-managed LLCs function more like corporations, where the board of directors and the officers make decisions and the shareholders don’t really participate in day-to-day operations.",
                "When you create an Arizona LLC, you must choose how the LLC will conduct its daily affairs by choosing whether it will be manager-managed or member-managed. This is called its \"management structure.\" If the LLC will be run by one or more managers and not by its members, then you must check the \"vested in managers\" box, and you must list the name and address of the manager, and you must list the name and address of all members who own 20% or more of the LLC, and then check the appropriate box under the manager and member names. If one or more members will make business decisions for the LLC and there are no managers, then you must check the \"reserved to members\" box and you must list the names and addresses of all members of the LLC, no matter what percentage they own. Please note that A.C.C. staff cannot tell you what type of management structure to choose because the answer involves legal or tax advice, and A.C.C. staff are not licensed attorneys or accountants and cannot give legal or tax advice to the public. We recommend you consult with appropriate professionals, such as a lawyer and an accountant, for advice on your particular needs.",
                "A manager-managed LLC in Arizona refers to how the LLC is organized, or its management structure (see the immediately preceding question and answer). If the LLC is manager-managed, only managers may sign documents submitted to the A.C.C. Please note that A.C.C. staff cannot tell you whether or not you should form a manager-managed LLC because the answer involves legal or tax advice, and A.C.C. staff are not licensed attorneys or accountants and cannot give legal or tax advice to the public. We recommend you consult with appropriate professionals, such as a lawyer and an accountant, for advice on your particular needs.",
                "A member-managed LLC in Arizona refers to how the LLC is organized, or its management structure (see the \"management structure\" question above). If the LLC is member-managed, only members may sign documents submitted to the A.C.C. Please note that A.C.C. staff cannot tell you whether or not you should form a member-managed LLC, because the answer involves legal or tax advice, and A.C.C. staff are not licensed attorneys or accountants and cannot give legal or tax advice to the public. We recommend you consult with appropriate professionals, such as a lawyer and an accountant, for advice on your particular needs.",
                "An operating agreement is an agreement that governs relations among the members and the managers and between the members and managers and the limited liability company. The operating agreement may be written, which is recommended, or it may be oral (verbal). It may contain any provision that is not contrary to law and that relates to the business of the limited liability company, the conduct of its affairs, its rights, duties or powers and the rights, duties or powers of its members, managers, officers, employees or agents. For a full description, click to read the statute, A.R.S. §29-682 (https://www.azleg.gov/arstitle/).",
                "In Arizona,  Operating agreements are not required by law to be filed, and will not be accepted for filing. Do not send your operating agreement to the A.C.C., because it will not be returned to you.", 
                "In Arizona, the simplest way to change the address of the LLC is with an LLC Statement of Change of Known Place of Business Address or Statutory Agent form. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the appropriate form. If other changes to the articles of organization are being made that would require articles of amendment, the address may also be changed in the Articles of Amendment. The form for Articles of Amendment can be accessed using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature.",
                "In Arizona, if you are removing and/or adding members or managers, or if you are changing the name of any existing member or manager, you must do this by way of an amendment to the articles of organization. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the Articles of Amendment form. If you are only changing the address of existing members or managers, then you may use a Statement of Change of Manager or Member Addresses form, which you can access using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature.",
                "Amendments are made by submitting Articles of Amendment to the Arizona Corporation Commission. We offer a long-form Articles of Amendment that covers most amendments, and we offer a short-form Articles of Amendment, which is designed for the few types of amendments that always require publication. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the A.C.C. forms. If A.C.C. forms do not cover the amendment you need, you may submit your own amendment.",
                "An Arizona LLC can become an LLC of some other state by submitting a Statement of Domestication to the A.C.C. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form. Read the accompanying Instructions to the Statement of Domestication for more information. You should consult with an attorney so that you can receive appropriate legal advice for your particular needs. The A.C.C. cannot advise you about domestication or any other legal issue.",
                "LLCs are not required to report any bankruptcy to the Arizona Corporation Commission.",
                "If the LLC is manager-managed, then only a manager may sign documents submitted to the A.C.C. If the LLC is member-managed, then only a member may sign documents submitted to the A.C.C. Please note that the A.C.C. will reject the document if the title underneath the signature does not match the management structure of the LLC. If you don’t remember what management structure you chose, check your entity’s record on our website here (https://ecorp.azcc.gov/EntitySearch/Index).",
                "To convert your LLC to a corporation in Arizona, see the Statement of Conversion and the accompanying instructions. Use the FILE () feature to access the form. You should consult with an attorney so that you can receive appropriate legal advice for your particular needs. The A.C.C. cannot advise you about conversion or any other legal issue.",
                "In Arizona, a foreign entity is a corporation or LLC that was formed or created in a state or country other than Arizona. Entities created under federal or Indian tribal law are also considered foreign entities. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form and instructions.",
                "In Arizona, if a foreign entity wants to transact business or conduct affairs in Arizona, it must register with the Arizona Corporation Commission. The entity must determine for itself if its activities constitute the transaction of business – the A.C.C. does not make this determination because it involves a legal analysis of the entity’s business compared to the applicable statute, and the A.C.C. does not and cannot provide legal advice to the public.",
                "In Arizona, foreign corporations must submit to the A.C.C. an Application for Authority to Transact Business or Conduct Affairs. Additional documents must accompany the Application – read the Instructions to the Application for Authority to ensure that you attach all necessary documents. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form and instructions.",
                "In Arizona, foreign LLCs must submit to the A.C.C. a Foreign Registration Statement. Additional documents must accompany the Application – read the Instructions to the Application for Registration to ensure that you attach all necessary documents. Use the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature to access the form and instructions.",
                "In Arizona, if a foreign entity restates or amends its articles in the state or country of its incorporation or formation, then it must file with the A.C.C. a copy of the document evidencing that restatement or amendment within 60 days of the effective date of the restatement or amendment. For example, if a Texas corporation or LLC amends its articles in Texas, it must file a certified copy of that amendment with the A.C.C. within 60 days of the filing in Texas. As another example, if a Texas corporation or LLC is the surviving entity in a merger, and that merger amended the articles of the Texas corporation or LLC, then a certified copy of the merger must be filed with the A.C.C. within 60 days of the filing in Texas. See also the guide for foreign conversions. Foreign corporations – please note that if any such amendment or merger is submitted more than 60 days after the date of filing in the foreign jurisdiction, a $100 penalty will be owed when the document is submitted to the A.C.C. This penalty does not apply to foreign LLCs.",
                "In Arizona, a foreign corporation must apply for new authority to transact business in Arizona if it changes any of the following: Its actual corporate name or the name under which it has obtained authority in Arizona; The period of its duration; or The state or country of its incorporation. Access the A.C.C. form for Application for New Authority by using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature. Read the instructions to the Application for New Authority to make sure you attach any necessary documents. See also the guide for foreign conversions (https://azcc.gov/docs/default-source/corps-files/foreign-entity-document-filing-guide.pdf).",
                "In Arizona, a foreign corporation does not amend its original application for authority.  Instead, there are circumstances where a foreign corporation might have to seek new authority. See the immediately preceding question and answer. Access the A.C.C. form and instructions using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature. See also the guide for foreign conversions (https://azcc.gov/docs/default-source/corps-files/foreign-entity-document-filing-guide.pdf).",
                "In Arizona, a foreign LLC can amend its Foreign Registration Statement by submitting to the A.C.C. Foreign Registration Amendment. Read the Instructions to the Articles of Amendment to make sure you attach any necessary documents. Access the A.C.C. form and instructions using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature. See also the guide for foreign conversions (https://azcc.gov/docs/default-source/corps-files/foreign-entity-document-filing-guide.pdf).",
                "In Arizona, a foreign LLC is required to amend its Foreign Registration Statement if either of the following is true: Any statement in the Foreign Registration Statement was false when made; or Any arrangements or other facts described have changed, making the application inaccurate in any respect. The amendment can be made by submitting Foreign Registration Amendment. Read the Instructions to the Articles of Amendment to make sure you attach any necessary documents. Access the A.C.C. form and instructions using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature. See also the guide for foreign conversions (https://azcc.gov/docs/default-source/corps-files/foreign-entity-document-filing-guide.pdf).",
                "In Arizona, LLCs do not have to file annual reports.",
                "In Arizona, corporations have to file annual reports",
                "In Arizona, the due date for a corporation's annual report is different for every corporation. To find your corporation’s due date, check your entity’s record on our eCorp Search page here (https://ecorp.azcc.gov/EntitySearch/Index) by entering the entity name in the search box then clicking on \"search\"."
                "In Arizona, you can get an extension of time to file an annual report.  Submit an Annual Report Extension Request along with the fee for the annual report. Read the Instructions to the Annual Report Extension Request for more information. Access the A.C.C. form and instructions using the FILE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FOnlineNavigation%2FService%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D1) feature.",
                "In Arizona, to file your corporation annual report, note the following: submit the annual report electronically by logging into ecorp.azcc.gov If you do not have any account, you will need to register for one. Once logged in, click on the Online Services tab, click on the Submit Corporation Annual Filing link, enter the Entity Name or Entity ID then click Search, once you locate your entity, click on the circle next to your entity’s name and click Next, click on File Annual Report or Annual Report Extension button.",
                "The corporation is responsible for submitting the annual report on or before the due date. You may “sign up” to have reminders sent to you. To “sign up” for annual report reminders you must register at ecorp.azcc.gov. Once logged in, click on Entity Search, type in your entity name and hit “Search.” Click on the blue arrows in the “Follow” column. You are now following your entity. You will receive a reminder email to the email address associated with the entity (if there is one) and you will receive notification under “My Alerts” on your dashboard. The reminders will be sent at 90, 60, 30 and 1 day prior to the annual report due date.",
                "For a for-profit corporation, penalties in the amount of $9.00 per month begin to accrue when the deadline is missed. The amount and timing of the penalties are set by statute. Nonprofit corporations are not assessed penalties. The corporation will be mailed a Notice of Pending Administration Dissolution approximately 90 days after the due date for the annual report. Approximately 60 days after that notice is generated, if no annual report has been submitted, the corporation will be administratively dissolved. The annual report plus payment of the filing fee and any accrued penalties can be submitted at any time before the date on which the corporation is administratively dissolved. After the corporation is administratively dissolved, reinstatement (in addition to the annual report, fee and penalties) will be required (see the next paragraph). A corporation that has been administratively dissolved may not conduct any business except that which is necessary to wind up its affairs. An administratively dissolved corporation may, however, apply for reinstatement for a period of six years from the date of administrative dissolution, at a cost of $100.",
                "In Arizona, Benefit corporations must file an Annual Benefit Report once each year, in addition to the Annual Report required by A.R.S. § 10-1622. The Annual Benefit Report is required for benefit corporations pursuant to A.R.S. §§ 10-2441 and 10-2442. The A.C.C. does not offer a form for the Annual Benefit Report. You should review the statutes to determine the requirements for the content of the Annual Benefit Report. The fee to file an Annual Benefit Report with the A.C.C. is $10.",
                "In Arizona, to get copies of corporation or LLC documents, complete a Records Request Form and deliver it to the Corporations Division Records Section by mail or in person, at 1300 W. Washington St., Phoenix, AZ 85007. Use the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FMODAccount%2FAddModAccount%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature to access the form.",
                "In Arizona, copies of records are charged at fifty cents per page. Many times staff cannot determine the number of pages until the work order is completed. We require payment up front, and if staff cannot determine the number of pages before the work order is completed, then they may request payment by a check with an amount “not to exceed” a certain dollar amount. This type of check is commonly used by this agency, and has never presented a problem for our customers or their banks.",
                "In Arizona, you must pay up front for your document copies.",
                "In Arizona, you must complete a Records Request form and deliver it to the Corporations Division Records Section by mail or in person at 1300 W. Washington St., Phoenix, AZ 85007. Be sure and attach a copy of the stock certificate. Please note that staff can only tell you whether we have documents on file for that entity – staff cannot tell you whether or not the stock certificate has any value.",
                "In Arizona, to get a Certificate of Good Standing, you must use the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FMODAccount%2FAddModAccount%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature to obtain a Certificate of Good Standing online. You can also use the SEARCH feature to obtain a Certificate by finding the entity’s page on our website. Once you access the entity’s record, click on “Check Corporate Status.” If the entity is in good standing, you can click on the “Print Certificate” button to pay for and obtain the Certificate. If you do not want to obtain a Certificate online, you can submit a paper request through the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FMODAccount%2FAddModAccount%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature.",
                "For the Arizona Corporation Commission to accept service of process for an entity, you must deliver to the Corporations Division Records Section, by mail or in person, the following: 2 copies of the document or documents being served; A check for $25.00 (MOD account holders may charge to the account); and A written statement, affidavit, or declaration, certifying under the penalty of perjury that, upon the signer's information, knowledge, and belief, the entity has either failed to appoint a statutory agent or failed to maintain a statutory agent at the statutory agent address shown on the records of the A.C.C. A form is available here, or you can use your own form. Read the Notice to Process Servers for more information. The Records Section is located at 1300 W. Washington St., Phoenix, AZ, 85007. Pursuant to its statutory obligation, the A.C.C. will mail a copy of the documents being served to the entity via regular U.S. Mail, and a Certificate of Mailing will be prepared by staff. The A.C.C. Certificate of Mailing, along with the other copy of the documents being served, is sent for microfilming into the entity's record. An uncertified (plain) or certified copy of the A.C.C. Certificate may be obtained by paying the applicable copying/certification fees as listed on the Records Request Form. IMPORTANT: By receiving service, the A.C.C does not represent or guarantee that the service is legally valid. The legal validity of service of process in connection with a lawsuit or for legal purposes is determined by the court, not by the A.C.C.",
                "The Arizona Corporation Commission accepts deposits of monies to be used for paying filing fees of documents submitted to the A.C.C. The monies are deposited into money-on-deposit (“MOD”) accounts in the name of the holder of the account. Fees are deducted when documents are filed and the cover sheet instructs that the MOD account be charged. Each account has a monthly statement issued showing the monthly transactions. Anyone can establish a MOD account, although typically it is only done by persons who frequently file documents with this agency. There is no minimum balance. If the account does not have an adequate balance when documents are filed, those documents will be rejected for nonpayment of filing fees. It is up to the MOD account holder to determine whether adequate funds exist in the account – the A.C.C. does not monitor accounts for that purpose and no notices will be sent. To establish a MOD account, complete a MOD Account Application using the SERVICE (https://ecorp.azcc.gov/AzAccount?redirectUrl=%2FMODAccount%2FAddModAccount%3FcategoryID%3D%26parentID%3D%26filingTypeId%3D) feature."
            ]
        }
    ]
}