{
    "state": "California",
    "pages": [
        {
            "source": "https://www.sos.ca.gov/business-programs/business-entities/faqs/",
            "paragraphs": [
                "\"Electronic signature\" typically is defined as meaning an electronic sound, symbol, or process attached to or logically associated with an electronic record and executed or adopted by a person with the intent to sign the electronic record. An electronic signature may be as simple as typing in a name electronically, checking a box indicating an intent to sign or some similar process. However, electronic signatures only are permissible in electronic transactions between consenting parties. The use of an electronic signature requires the agreement of both parties to allow the use of the electronic signature and must be on a document that requires a signature and that is electronic.\nElectronic signatures on filings submitted through the Secretary of State's online process are the only electronic signatures that are acceptable for filings with the Secretary of State. Computer generated signatures or fonts made to look like a signature printed on paper filings are not acceptable.",
                "A digital signature is a type of electronic signature that requires specific security criteria to be met during the electronic transaction to ensure the signature is from the party it is supposed to be from. Digital signatures use a form of encryption as part of the signature process to ensure the signature cannot be duplicated or impersonated and require the receiving party to have the encryption key to decipher the signature.\nDigital signatures are not acceptable for business entity filings made with the California Secretary of State.",
                "A request to check for the availability of a corporation, limited liability company or limited partnership name can be submitted by mail to the Secretary of State's Sacramento office. Corporation, limited liability company and limited partnership names can be checked by phone upon establishing a prepaid account with the Secretary of State.\nA request to reserve a corporation, limited liability company or limited partnership name can be submitted by mail or dropped off at the counter at the Secretary of State's Sacramento office. A request to reserve a corporation name can also be submitted in person to the Secretary of State's Los Angeles office. Corporation and limited liability company names can be reserved by phone upon establishing a prepaid account with the Secretary of State.\nOnline requests to check or reserve a corporation, limited liability company or limited partnership name are not available at this time.",
                "A business entity can be formed in California by filing the applicable document or form (as described below) with the Secretary of State. The document samples and forms described below are available on our Forms, Samples and Fees webpage. Please refer to the applicable document sample or form for complete filing instructions, fees, any additional requirements and relevant statutory filing provisions:\n• Corporation: File Articles of Incorporation. The following Articles of Incorporation forms for the most common types of corporations are provided. The forms have been drafted to meet the minimum statutory requirements. You can either use the form or compose your own statutorily compliant document:\n\t• Articles of Incorporation of a General Stock Corporation (Form ARTS–GS)\n\t• Articles of Incorporation of a Close Corporation (Form ARTS–CL)\n\t• Articles of Incorporation of a Professional Corporation (Form ARTS–PC)\n\t• Articles of Incorporation of a Nonprofit Mutual Benefit Corporation (Form ARTS–MU)\n\t• Articles of Incorporation of a Nonprofit Public Benefit Corporation (Form ARTS–PB–501(c)(3))\n\t• Articles of Incorporation of a Nonprofit Religious Corporation (Form ARTS–RE)\n\t• Articles of Incorporation of a Common Interest Development Association (Form ARTS–CID)\n• Limited Liability Company: File Articles of Organization (Form LLC–1).\n• Limited Partnership: File a Certificate of Limited Partnership (Form LP–1).\n• General Partnership: File a Statement of Partnership Authority (Form GP–1). Filing Form GP–1 is permissive. Note: A general partnership may record its partnership agreement at the county recorder's office in the county where the general partnership is located.\n• Limited Liability Partnership: File an Application to Register a Limited Liability Partnership (Form LLP–1).\nTo ensure that all issues are considered and addressed appropriately, you should consult with private legal counsel prior to submitting formation documents to the Secretary of State.\nNote: Many corporation, limited liability company and limited partnership documents are returned for correction without being filed because of name issues, errors, omissions or misstatements contained in the proposed filings submitted to this office. Filing tips have been drafted to assist with meeting the minimum filing requirements of the California Corporations Code.",
                "Once the business entity is formed or registered with the California Secretary of State it must obtain the necessary licenses and/or permits.\nThe Secretary of State does not issue licenses or permits for business entities. Please refer to the CalGold (California Government: On–Line to Desktops) website for information about business license/permit requirements. CalGold's online database provides links and contact information to agencies that administer and issue business licenses, permits and registration requirements from all levels of government.",
                "Fictitious business names are filed with the county in which the principal place of business is located. Please check with the county for specific requirements.",
                "Bylaws and operating agreements (and any amendments thereto) are maintained by the business entity and are not filed with the Secretary of State. Requests for copies or information about these documents should be directed to the business entity itself.",
                "Corporate seals may be obtained directly from an office supply or stationary company. The Secretary of State does not issue corporate seals.",
                "Before transacting intrastate business in California the business must first qualify/register with the California Secretary of State. (California Corporations Code section 2105, 15909.02, 16959 or 17708.02.) California Corporations Code sections 191, 15901.02(ai) and 17708.03 define \"transacting intrastate\" as entering into repeated and successive transactions of its business in this state, other than interstate or foreign commerce.\nThe Secretary of State's office cannot advise you as to whether or not the business must qualify/register to do business in California. If you require assistance in making that determination and to ensure that all issues are considered and addressed appropriately, you should consult with private legal counsel.",
                "A foreign business entity can qualify/register to transact business in California by filing the applicable form (as described below) with the California Secretary of State. The forms described below are available on our Forms, Samples and Fees webpage. Please refer to the form for complete filing instructions, fees, any additional requirements and relevant statutory filing provisions\n• Corporation: File a Statement and Designation by Foreign Corporation (Form S&DC–S/N [for foreign general stock or nonprofit corporations], Form S&DC-PC [for foreign professional law or accountancy corporations] or Form S&DC–INS [for foreign insurer corporations) and attach to the completed form a valid certificate of good standing by an authorized public official of the foreign jurisdiction under which the foreign corporation is incorporated\n• Limited Liability Company: File an Application to Register (Form LLC–5) and attach to the completed form a valid certificate of good standing by an authorized public official of the foreign jurisdiction under which the foreign limited liability company is organized\n• Limited Partnership: File an Application for Registration (Form LP–5) and attach to the completed form a valid certificate of good standing (or other record of similar import) by an authorized public official of the foreign jurisdiction under which the foreign limited partnership is organized.\n• Limited Liability Partnership: File an Application to Register a Limited Liability Partnership (Form LLP–1) and attach to the completed form a valid certificate of good standing (or other record of similar import) by an authorized public official of the foreign jurisdiction under which the foreign limited liability partnership is organized.\nTo ensure that all issues are considered and addressed appropriately, you should consult with private legal counsel prior to submitting qualification or registration documents to the California Secretary of State. Note: Many corporation, limited liability company and limited partnership documents are returned for correction without being filed because of name issues, errors, omissions or misstatements contained in the proposed filings submitted to this office. Filing tips have been drafted to assist with meeting the minimum filing requirements of the California Corporations Code.",
                "A domestic (California) or foreign (out–of–state or out–of–country) business entity can dissolve, surrender or cancel by filing the applicable form (as described below) with the California Secretary of State. The forms described below are available on our Forms, Samples and Fees webpage. Please refer to the applicable form(s) for complete filing instructions, fees, any additional requirements and relevant statutory filing provisions:\n• California (stock) Corporation: File a Certificate of Election to Wind Up and Dissolve (Form ELEC STK) and a Certificate of Dissolution (Form DISS STK), unless the election to dissolve is made by the vote of all the outstanding shares, in which case only the Certificate of Dissolution (Form DISS STK) is required; OR, in limited circumstances, a Short Form Dissolution Certificate (Form DSF STK) may be filed.        \n• California (nonprofit) Corporation: File a Nonprofit Certificate of Election to Wind Up and Dissolve (Form ELEC NP) and a Nonprofit Certificate of Dissolution (Form DISS NP), unless the election to dissolve is made by a vote of all the members, or if the nonprofit corporation has no members by the vote of all the directors, in which case only the Nonprofit Certificate of Dissolution is required; OR, in limited circumstances, a Nonprofit Short Form Dissolution Certificate (Form DSF NP) may be filed. Note: If the dissolving corporation is a nonprofit public benefit or religious corporation, the Nonprofit Certificate of Dissolution (Form DISS NP) must be accompanied by a letter from the Attorney General that either waives objections to the distribution of the corporation's assets or confirms that the corporation has no assets.\n• Foreign Corporation: File a Certificate of Surrender (Form SURC).\n• California Limited Liability Company: File a Certificate of Dissolution (Form LLC–3) and Certificate of Cancellation (Form LLC–4/7), unless all the members vote to dissolve, in which case only Form LLC–4/7 is required; OR, in limited circumstances, a Short Form Cancellation Certificate (Form LLC–4/8) may be filed.\n• Foreign Limited Liability Company: File a Certificate of Cancellation (Form LLC–4/7).\n• California or Foreign Limited Partnership: File a Certificate of Cancellation (Form LP–4/7).\n• General Partnership: File a Certificate of Dissolution (Form GP–4).\n• Limited Liability Partnership: File a Notice of Change of Status (Form LLP–4). To ensure that all issues are considered and addressed appropriately, you should consult with private legal counsel prior to submitting termination documents to the California Secretary of State.\nNote: Many corporation, limited liability company and limited partnership documents are returned for correction without being filed because of name issues, errors, omissions or misstatements contained in the proposed filings submitted to this office. Filing tips have been drafted to assist with meeting the minimum filing requirements of the California Corporations Code.",
                "The Secretary of State's office has been advised that letters are being sent to California corporations directing them to submit $495 and a completed form to a private company named Business Filings Division in order to dissolve their business entity. (See Example (PDF).) A similar letter is being sent to California limited liability companies.\nThe letter/form does not meet the requirements of the California Corporations Code, and a corporation cannot delegate the obligation to have the Certificate of Election to Wind Up and Dissolve and the Certificate of Dissolution signed and verified by the shareholders, members, officers or directors of the corporation. Additionally, the Certificate of Election to Wind Up and Dissolve and the Certificate of Dissolution must be submitted to the California Secretary of State's office for filing. Please note there is no filing fee associated with either document.\nIf you do intend to terminate your business entity, please refer to our Forms, Samples and Fees webpage for forms that meet the minimum content requirements of the California Corporations Code and instructions for these filings. The completed forms can be mailed to Secretary of State, Document Filing Support Unit, 1500 11th Street, Third Floor, Sacramento, California, 95814, or can be delivered in person to the Sacramento office at that same address. There is no fee for submitting these documents to our office by mail, however, there is a $15 service fee for submitting these forms in person for\nCalifornia businesses that receive one of these fraudulent solicitation letters can mail a written complaint along with the entire solicitation (including the solicitation letter, the outer and return envelopes, and all related documents) to the California Attorney General's office, Public Inquiry Unit, P.O. Box 944255, Sacramento, California 94244–2250. A complaint form, which can be completed online and printed to mail, is available on the California Attorney General's website at www.oag.ca.gov/consumers.\nThese solicitations are not being made by the California Secretary of State's office and are not being made by or on behalf of any governmental entity. Although a business entity can use an intermediary to submit filings and fees to our office, no business is required to go through another company in order to file its documents with the Secretary of State's office.",
                "Statement of Information filing requirements vary depending on the type of entity (corporation or limited liability company), jurisdiction of formation, and for corporations, if the entity is a stock or nonprofit corporation. Statement forms are available on the Statements of Information webpage. Please refer to the applicable form for complete filing instructions, fees and relevant statutory filing provisions.",
                "There are several agencies that administer a variety of taxes. Please refer to our Tax Information webpage for a list of agencies that can assist you in determining your tax obligations and provide you with information about tax reporting and taxpayer rights. Please refer to the CalGOLD (California Government: On–Line to Desktops) website for information about business license/permit requirements in California.",
                "Some private companies have been soliciting business through mass mailings to business entities to prepare annual minutes and/or to file the Statement of Information with our office. These private companies are in no way affiliated with the Secretary of State or any other government agency, although the solicitations are made to appear similar to our Statement of Information form. Please refer to our Customer Alert webpage for additional information about these types of misleading solicitations.\nCalifornia businesses in receipt of a solicitation letter that seems misleading or confusing can mail a written complaint along with the entire solicitation (including the solicitation letter, the outer and return envelopes, and all related documents) to the California Attorney General's office, Public Inquiry Unit, P.O. Box 944255, Sacramento, California 94244–2550. A complaint form, which can be completed online and printed to mail, is available on the California Attorney General's website at www.ag.ca.gov/consumers/general.php.",
                "An agent for service of process is an individual who resides in California, or a corporation, designated to accept service of process (court papers) if the business entity is sued. If a corporation is designated as agent for service of process, that corporation must have previously filed a certificate pursuant to California Corporations Code section 1505.",
                "A business entity cannot act as its own agent for service of process and no corporation may file a certificate pursuant to California Corporations Code section 1505 unless the corporation is currently authorized to engage in business in California and is in good standing on the records of the Secretary of State.",
                "For a list of all corporations currently authorized to act as agents for service of process (Registered Corporate Agents), see the Secretary of State’s List of Registered Corporate Agents. Note: Advanced approval must be obtained from a Registered Corporate Agent prior to designating that corporation as your agent for service of process. The address of a Registered Corporate Agent is available on the Secretary of State’s Business Search, and if provided by the corporation, additional contact information may be available on the Secretary of State’s Private Service Companies webpage. You also may wish to search online to determine if the corporation has a website with information about contacting that corporation.",
                "Please refer to our Service of Process webpage for information about substituted service of process through the Secretary of State's office.",
                "Penalties are assessed by the Franchise Tax Board when a business entity has not filed the required Statement of Information with the Secretary of State’s office. If the statement has not been filed timely, the entity is provided a notice of delinquency, and after 60 days from that notice, if no statement has been filed, the Secretary of State’s office notifies the Franchise Tax Board, who assesses and collects the penalty.",
                "Every corporation and every limited liability company is required to file a statutory Statement of Information either every year or every two years as applicable. The Secretary of State mails a reminder postcard to the business entity's address of record approximately three months prior to the date its filing is due. If the business entity then fails to file the required statement, it is provided a notice of delinquency and an additional 60 days in which to file. Note: It is a business entity's responsibility to submit a statement even if it did not receive the reminder or the notice of delinquency, however, that is why it is important to keep the entity's address information up to date with the Secretary of State to ensure notices are received.\nFor more information on when Statements of Information are due, please visit our Statement of Information Help page.",
                "A request to waive the penalty for failure to file the Statement of Information can be submitted in writing to the Secretary of State, Statement of Information Unit – Attention: Penalties, P.O. Box 944230, Sacramento, CA 94244–2300 or you may submit a request online at Email Penalty Waivers.\nThe waiver request must include an explanation of the reasonable cause or unusual circumstance supporting the business entity's failure to file the required statement timely. Per statute, failing to receive a reminder notice to file does not excuse an entity from filing the required statement. Note: If a current statement has not been filed, the waiver request must be accompanied by a completed statement and the applicable filing fee. Online services for submitting the required Statement of Information for all LLCs and for most corporations are available at http://bizfile.sos.ca.gov using a credit card (Visa or MasterCard only). When submitting online, a free PDF copy of the filed Statement of Information will be returned electronically to the submitter following confirmation of payment if an email address is provided at the time of submission.\nNote: At this time, Statements of Information for common interest developments must be submitted on paper and directed to the Secretary of State’s office in Sacramento, either by mail or delivered in person. All filing forms are available on our Statements of Information webpage and are based on the type of entity. Please refer to the applicable form for complete filing instructions, fees and relevant statutory filing provisions.",
                "A domestic (California) or foreign (not California) business entity can change its address of record by filing the applicable form (as described below) with the California Secretary of State. The forms described below are available on our Forms, Samples and Fees webpage. Please refer to the applicable form for complete filing instructions, fees, any additional requirements and relevant statutory filing provisions:\n• California (stock) Corporation: File a Statement of Information – Domestic Stock and Agricultural Cooperative Corporations (Form SI–550). Complete the form in its entirety.\n• California (nonprofit) Corporation: File a Statement of Information – Domestic Nonprofit, Credit Union and General Cooperative Corporations (Form SI–100). Complete the form in its entirety.\n• Foreign Corporation: File a Statement of Information – Foreign Corporation (Form SI–550). Complete the form in its entirety.\n• California Limited Liability Company: File a Statement of Information – Domestic or Foreign Limited Liability Company (Form LLC–12). Complete the form in its entirety.\n• Foreign Limited Liability Company: File a Statement of Information – Domestic or Foreign Limited Liability Company (Form LLC–12). Complete the form in its entirety.\n• California Limited Partnership: File an Amendment to Certificate of Limited Partnership (Form LP–2).\n• Foreign Limited Partnership: File an Amendment to Application for Registration (Form LP–6).\n• General Partnership: File a Statement of Amendment/Cancellation (Form GP–7).\n• Limited Liability Partnership: File an Amendment to Registration (Form LLP–2).\n• Unincorporated Association: File a Statement by Unincorporated Association (Form UA–100).\n• Foreign Partnership (other than a foreign limited partnership): File a Statement by Foreign Partnership (Form LL–27).",
                "A business entity's powers, rights and privileges, which include the right to use the entity's name in California, can be suspended or forfeited in California by (1) the Secretary of State for failure to file a Statement of Information and/or in the case of a domestic or foreign corporation, for failure to reimburse the Victims of Corporate Fraud Compensation Fund (VCFCF) for a paid claim; and/or (2) the Franchise Tax Board for failure to meet tax requirements (e.g., file a return, pay taxes, penalties, interest). Subject to the availability of the business entity name, an entity suspended/forfeited by the:• Secretary of State can be revived by:\t• Filing a current Statement of Information with this office. Note: A common interest development corporation also must submit a Statement by Common Interest Development Association (Form SI–CID) together with the Statement of Information. Statement forms are available on the Statements of Information webpage. Please refer to the applicable form for complete filing instructions, fees and relevant statutory filing provisions; and/or\t• Reimbursing the VCFCF for a paid claim. Questions about reinstatement from VCFCF suspension/forfeiture should be directed to the Secretary of State, Victims of Corporate Fraud Compensation Fund, Attention: Ombudsperson, P.O. Box 15659, Sacramento, CA 95852. For further information and relevant statutory provisions, see Victims of Corporate Fraud Compensation Fund.\t Note: In the case of a domestic or foreign corporation, the most common reason for suspension/forfeiture by the Secretary of State is failure to file the required Statement(s) of Information as stated above. Further information about the type of Secretary of State suspension/forfeiture is available at Business Search.• Franchise Tax Board: Contact the Franchise Tax Board for revivor requirements.• Secretary of State and Franchise Tax Board: First file a current Statement of Information with the Secretary of State, and/or reimburse the VCFCF, and obtain a letter of proposed relief from suspension or forfeiture. Upon receipt of the proposed relief letter from the Secretary of State, the business entity should complete an Application for Certificate of Revivor (Form FTB 3557) and submit the application along with a copy of the proposed relief letter to the Franchise Tax Board. Note: The business entity will remain suspended by the Secretary of State until both the Secretary of State and Franchise Tax Board revivor requirements have been met.",
                "The suspended/forfeited business entity must change its name, obtain a release of name reservation from the party who has reserved the name, in certain circumstances, obtain written consent to use the name or convince the other entity to change its name.",
                "A business entity name can be changed in California by filing the applicable document or form (as described below) with the California Secretary of State. The document samples and forms described below are available on our Forms, Samples and Fees webpage. Please refer to the applicable document sample or form for complete filing instructions, fees, any additional requirements and relevant statutory filing provisions:\n• California Corporation: File a Certificate of Amendment. Samples are provided. The samples have been drafted to meet the minimum statutory requirements and can be used as a guideline in preparing the applicable document to be filed with the Secretary of State.\n• Foreign Corporation: File an Amended Statement by Foreign Corporation.\n• California Limited Liability Company: File a Certificate of Amendment (Form LLC–2).\n• Foreign Limited Liability Company: File an Application for Registration Certificate of Amendment (Form LLC–6).\nNote: Many corporation, limited liability company and limited partnership documents are returned for correction without being filed because of name issues, errors, omissions or misstatements contained in the proposed filings submitted to this office. Filing tips have been drafted to assist with meeting the minimum filing requirements of the California Corporations Code.\nTo ensure that all issues are considered and addressed appropriately, you should consult with private legal counsel prior to submitting amendment documents to the Secretary of State.",
                "For assistance in determining where to file a complaint against a business entity and how to proceed, please refer to the Department of Consumer Affairs, Consumer Resource & Referral Guide. The Secretary of State Business Programs Division does not regulate business operations or business practices. If you believe that a business is operating illegally, you may contact the Office of the California Attorney General, the Better Business Bureau, or seek private legal counsel.",
                "Copies of filed documents containing such information can be obtained by submitting a request to the California Secretary of State's Sacramento office either in person (drop off) or by mail. Please refer to the Information Requests webpage for detailed information about copy requests. The agent for service of process for corporations, limited liability companies and limited partnerships can also be obtained online through the Business Search, and the names of the directors, chief executive officer and five most highly compensated executive officers for publicly traded corporations can be obtained online through the Publicly Traded Disclosure Search.",
                "For more information about business identity theft, please visit the Secretary of State Business Identity Theft Resources.",
                "Copies and certificates can be obtained by submitting a request to the California Secretary of State's Sacramento office either in person (drop off) or by mail. Please refer to the Information Requests webpage for detailed information about copy and certificate requests.\nPhone or online requests for copies and certificates are not available at this time.",
                "Certificates of Status can be obtained by submitting a request to the California Secretary of State's Sacramento office either in person (drop off) or by mail. Please refer to the Information Requests webpage for detailed information about certificate requests.\nPhone or online requests for a Certificates of Status are not available at this time.",
                "To start a corporation in California, you must file Articles of Incorporation with the California Secretary of State. You can file the document by mail or in person. Once filed with the state, this document formally creates your California corporation. However, to actually ready the corporation to do business, you must complete additional steps.",
                "The cost to incorporate in California involves $100 filling fee for the Articles of Incorporation plus a $15 handling fee. You must also file an initial report giving detailed information about your company, which includes a fee of $25 and a $75 service fee.",
                "In general, turnaround time for incorporating a business in California is 15-20 business days.  If you pay expedited service it can be approved in 1-2 business days.",
                "To conduct business in California you need to follow the next steps: \n1. Choose your California corporation filing option\n2. Submit the California Articles of Incorporation\n3. Create California corporate bylaws\n4. Get a Federal EIN from the IRS\n5. Open a corporate bank account\n6. Obtain any required business licenses\n7. File the California Statement of Information\n8. Pay taxes on the corporation’s income\"",
                "The Articles of Incorporation is a document that once filled with the Department of State Division of Corporations, it validates your incorporation.",
                "You file articles of incorporation with your state's business filing agency. You must pay a filing fee when you submit your paperwork. Once the corporation has been approved, you will receive a certificate of formation from the state.",
                "California’s requirements for your Articles of Incorporation include: Corporate name, corporate purpose,the name and physical address (not a post office box) of your registered agent, corporate address, number of authorized shares of stock.",
                "Also known as a “Federal ID Number” or “Tax ID Number,” your EIN is a nine-digit number mainly used for tax filing and reporting purposes. You’ll also need it for other business documents, and banks will require it before they’ll allow you to open a business bank account. You can apply for an EIN online through the IRS website",
                "Business licenses are permits issued by government agencies that allow individuals or companies to conduct business within the government's geographical jurisdiction.",
                "Any business owner in California must obtain a general business license in the city in which your business is located. Aside from general business licenses, your company may be required to comply with additional licensing, environmental, and other regulatory mandates.",
                "A business structure is a category of organization that is legally recognized in a given jurisdiction and characterized by the legal definition of that particular category.",
                "There are four main types of business structures in the U.S: sole proprietorship, partnership, limited liability and corporation. Each structure has different tax, income and liability implications for businesses owners and their companies.",
                "Sole proprietorship is the simplest organizational structure available for businesses. According to the Internal Revenue Service (IRS), it is the most common form of business in the U.S. Businesses structured as a sole proprietorship allows the owner(s) to have total control over company operations. Owners of sole proprietor businesses are responsible for their own record keeping and paying the IRS in the form of self-employment taxes. However, this type of business provides no protection for business owners, as they can be held personally responsible for their company's debt and financial obligations.",
                "A partnership is formed when two or more people join, or partner, together to run a business. Each partner has equal share in the net profits and losses of their business. Like a sole proprietor, each partner reports their income on their personal tax return and pays self-employment taxes to the IRS. They are also personally liable for financial debt and obligations of their company and also the actions of other partners. Although partnerships can be formed through oral agreements and handshakes, written agreements can be the best option in the event of disputes or lawsuits between partners.",
                "The limited liability structure is considered a hybrid as limited liability companies can be formed as corporations or partnerships. LLCs can provide owners, who are commonly referred to members under this structure, the protection from liability and other obligations similar to a corporation. Limited liability companies can also be set up and managed like partnerships. The taxation of LLCs also depends on its structure. Due to its limited protection, some companies such as banks and insurance companies are restricted from being LLCs.",
                "The most complex organizational structure for businesses is the corporation. This type of business structure separates the liabilities and obligations incurred by company operations from being the responsibility of the owners. Corporations are regulated by the laws of the state they are set up in. Unlike sole proprietor and partnership businesses, corporations are taxed as separate entities at corporate tax rates. The IRS taxes corporation owners at individual tax rates. There are two common types of corporation structures: Subchapter C and S.",
                "After you know what you’d like to call your company, you’ll need to make sure the name is available and meets California’s rules and regulations. Do a California corporation search on the name to make sure another business isn’t already using it. The state won’t approve a name if another California corporation goes by that name, or if the name is so similar to another business’s name that it might confuse or mislead the public. You must use “Corporation,” “Company,” “Incorporated,” or “Limited,” or an abbreviation of them behind your business name if you’ve filed as a professional corporation or close corporation.",
                "A free preliminary check of the availability of a name can be requested by mailing a completed Name Availability Inquiry Letter (PDF) to the California Secretary of State’s office in Sacramento. Email or online inquiries cannot be accepted at this time.",
                "A trademark is a brand name. A trademark or service mark includes any word, name, symbol, device, or any combination, used or intended to be used to identify and distinguish the goods/services of one seller or provider from those of others, and to indicate the source of the goods/services.",
                "Although federal registration of a mark is not mandatory, it has several advantages, including notice to the public of the registrant's claim of ownership of the mark, legal presumption of ownership nationwide, and exclusive right to use the mark on or in connection with the goods/services listed in the registration.",
                "If you are domiciled in the United States, you are not required to have a U.S.-licensed attorney represent you, but we strongly encourage you to hire one who specializes in trademark law to guide you through the application process. Although USPTO staff can provide information about the federal application process, USPTO employees cannot give you legal advice or help you fill out forms.",
                "You should search the USPTO database before filing your application, to determine whether anyone already claims trademark rights in a particular mark through a federal registration. Failure to conduct a proper search may result in your not making a proper assessment as to whether an application should even be filed.",
                "You must must file your trademark application online using the Trademark Electronic Application System (TEAS), with limited exceptions. Visit USPTO for detailed tutorials on how to file a trademark",
                "What the proper filing fee is for your application will be based specifically on three distinct factors: number of marks, number of classes and application filling option.  Initially it is $225 per class of goods/services and $275 per class of goods/services.",
                "A patent is a limited duration property right relating to an invention, granted by the United States Patent and Trademark Office in exchange for public disclosure of the invention. Patentable materials include machines, manufactured articles, industrial processes, and chemical compositions. The duration of patent protection depends on the type of patent granted: \nDesign Patents - 15 years from issuance for applications filed on or after May 13, 2015 (14 years from issuance if filed before May 13, 2015)\nUtility patents and plant patents - 20 years from the date on which the application for the patent was filed in the United States or, in special cases, from the date an earlier related application was filed.\"",
                "A copyright protects original works of authorship including literary, dramatic, musical, and artistic works, such as poetry, novels, movies, songs, computer software, and architecture. The duration of copyright protection depends on several factors.  For works created by an individual, protection lasts for the life of the author, plus 70 years. For works created anonymously, pseudonymously, and for hire, protection lasts 95 years from the date of publication or 120 years from the date of creation, whichever is shorter.",
                "The income from corporations is taxed at both the individual level and the corporate level. This means that corporations must pay taxes on the income of the individual’s dividends as well as on the total income of the corporation itself. This procedure of taxation on corporations is known as “double taxation.”",
                "The registered agent primarily provides an address that is registered in order to act as a local contact for the Secretary of States and other government agencies, as well as in receiving the service of legal papers and documents. The registered agent is the person in charge of receiving all tax notices, notices of law suits on your company, etc. and will forward them on to the corporation.",
                "A corporation is allowed to incorporate in any state it chooses, even if that state is not the state of the business’s particular office location. However, it is best for businesses to incorporate in its home state. Several considerations are involved in choosing the location of incorporations, such as tax laws, the cost of incorporation and general laws of that state that govern the liabilities and actions of a corporation.",
                "Most states simply require a corporation to have one director, while other states require a corporation to obtain several officers (usually a President, Vice-President, Treasurer, and Secretary). Based on the state, the number of shareholders a corporation has will dictate the its number of directors. Many states have a minimum requirement of three directors."
            ]
        }
    ]
}
