{
    "state": "Connecticut",
    "pages": [
        {
            "source": "https://www.sos.arkansas.gov/business-commercial-services-bcs/frequently-asked-questions-faqs/",
            "paragraphs": [
                "In Connecticut, the following business entities are filed with SOTS: Limited Liability Company (Domestic & Foreign), Corporation Stock (Domestic & Foreign), Benefit Corporation (Domestic Only), Corporation Non Stock (Domestic & Foreign), Limited Liability Partnership (Domestic & Foreign), Limited Partnership (Domestic & Foreign), General Partnership (Domestic & Foreign), Religious Corporation or Society, Statutory Trust (Domestic & Foreign)",
                "A business entity formed under the laws of connecticut is considered a Domestic Entity in Connecticut.",
                "An entity formed under the laws of another state or foreign country is considered a Foreign Entity in Connecticut.",
                "In Connecticut, to decide what business entity might be right for you, an attorney and/or an accountant should be consulted for professional advice when starting a business. The following establishments may offer useful information about developing a business plan: U.S. Small Business Administration (SBA), Connecticut Economic Resource Center (CERC), Small Business Development Centers (SBDC), Connecticut Center for Advanced Technology, Inc. (CCAT), SCORE Business Mentors, and Entrepreneurial Center & Women’s Business Center. Please also consult our business startup tool (https://www.concord-sots.ct.gov/CONCORD/NewBusinessFormation/BusinessRegistrationTool.jsp?pInquiry=false) to see the typical steps required to start a business in Connecticut.", 
                "In Connecticut, the act of filing with our office legally forms the business entity. (See C.G.S. § 34-247(d) (“A limited liability company is formed on the date and at the time of its filing by the Secretary of the State…”).",
                "In Connecticut, the ID number issued by the Secretary of the State is called the Business ID.",
                "To look up your Business ID, go to the CONCORD business search (https://www.concord-sots.ct.gov/CONCORD/online?sn=PublicInquiry&eid=9740) and search by the business name.",
                "The IRS issues Employer Identification Numbers. Please visit the IRS website at www.irs.gov.  Our office does not collect EIN and cannot search businesses by EIN.",
                "Annual reports collect vital information about businesses to ensure the information on file is accurate.  Connecticut law requires annual report filings for all corporations, nonstock corporations, limited liability companies, limited liability partnerships and limited partnerships. For more information, go to ct.gov/annualreport.",
                "In Connecticut, annual report fees are set by statute and vary depending on the entity type.",
                "In Connecticut, approximately 1 month prior to your annual report due date, the Connecticut Office of the Secretary of State will send an email to the email address on file with our office. If the entity does not have an email address on file, we will send a postcard to the business address on file with our office. To see if the annual report is due, select “Search for a Business”. Search by the Business Name (be sure to enter the exact spelling of the name) OR enter the Business ID. The “Business Inquiry” screen will appear and show when the last report was filed, and when the next annual report is due.",
                "In Connecticut, to file an annual report online, go to ct.gov/annualreport.",
                "A business that does not file an annual report may be administratively dissolved as a penalty. (C.G.S. §§ 33-890 & 34-267g). In addition, entities that are not up to date with their annual report filings cannot get a Certificate of Legal Existence (https://portal.ct.gov/SOTS/Commercial-Recording/Legal-Existence), which may impact the entity’s ability to transact business.",
                "In Connecticut, if you receive an administrative dissolution or forfeiture letter for your business (once you have received notice that your business entity will be administratively dissolved), you must file all past due annual reports in order to avoid forfeiture.  If your business has received a notice that the business entity has been forfeited/dissolved following the 90-day waiting period, you must call our office to request a reinstatement package at (860) 509-6003.  Once a business has been forfeited/dissolved, the business name becomes available to be used by another business entity.",
                "In Connecticut, LLC’s and corporations can change (add/delete) principals on their annual report filing. If the business has filed its most current annual report, it would need to file an interim notice to make any changes to the principals. Please select this link to be directed to our forms page.",
                "State law requires that any person doing business in Connecticut under any name other than their own, must register a trade name in the town where their business is conducted. (C.G.S. § 35-1).  See our Trade Name (https://portal.ct.gov/SOTS/Commercial-Recording/Tradename) page for more information.",
                "If you have multiple locations for the same Connecticut business, under Connecticut law, you should record one business address and one mailing address with the Office of the Secretary of State.",
                "In Connecticut, you can use a P.O. Box for a mailing address.",
                "The dissolution of a Connecticut (domestic) Corporation/LLC/LLP, OR the cancellation/withdrawal of a foreign Corporation/LLC/LLP registration can all be filed online – all other entities must submit a form. Please see our dissolution page (https://portal.ct.gov/SOTS/Commercial-Recording/Dissolution) for more information on how to file.",
                "A limited liability company may be reinstated unless dissolved by decree of court (C.G.S. § 34-267b). Corporations can reinstate only if they were administratively dissolved (C.G.S. § 33-892).  If the name of the Limited Liability Company or Corporation to be reinstated is no longer available, it shall, simultaneously with reinstatement, be changed to an available name by amendment of the certificate of organization or incorporation.",
                "In Connecticut, a registered agent is a responsible third-party who is registered in the same state in which a business entity was established and who is designated to receive service of process notices and correspondence on behalf of the corporation or LLC.  SCORE, a resource partner of the United States Small Business Administration, provides a detailed explanation as to the state requirement for the appointment for an agent for service of process.",
                "You can serve as your own agent if you are a resident of Connecticut. Any Connecticut resident age 18 or older. Another business entity registered with our office that has a Connecticut address. Secretary of the State (Foreign entities only)",
                "In Connecticut, your registered agent is required to sign your formation document and change of agent as proof of consent. If the agent does not sign, your formation document will not be accepted. If an agent is a business, the person signing on behalf of the entity must print their name and title next to their signature. For customers that file their formation documents online, the agent must respond to an email accepting appointment.",
                "An agent change can be filed online by completing a Change of Agent (https://www.concord-sots.ct.gov/CONCORD/customer?eid=9799) form. The online version will require the new agent to accept the appointment (by email) and the filing must be reviewed and accepted before it becomes effective.  Effective January 1, 2020, an agent change may also be reported on an annual report.",
                "In Connecticut, you can obtain a copy of your filing by obtaining a copy of a filing: https://portal.ct.gov/SOTS/Commercial-Recording/Copies",
                "Go to the Commonly Used Form's (https://portal.ct.gov/SOTS/Commercial-Recording/Commercial-Recording/Commercial-Recording-Divisions-Forms-Index-Content#commonlyusedforms) page and complete the Refund Claim form.",
                "Connecticut does not collect the Business Entity Tax (BET). Effective January 1, 2020 the business entity tax will no longer be assessed."
            ]
        }
    ]
}
