{
    "state": "Delaware",
    "pages": [
        {
            "source": "https://corp.delaware.gov/faqs/",
            "paragraphs": [
                "The Delaware Division of Corporations has many venues for accessing corporate information. Please note that this is not a good standing certificate, certified by the Secretary of State. You may choose from the following options:Corporate Status – On the Web – We now offer corporate/entity status on the web. You may check status on the web for a fee of $10.00 per entity for status or $20.00 per entity for more detailed information including current franchise tax assessment, current filing history and more. You may charge a Visa, MasterCard, American Express, or Discover card. Corporate status on the web (https://corp.delaware.gov/onlinestatus/). Please note: All transactions submitted on this site are non-refundable.In Person – No Charge – You may visit our public terminals at our office located at 401 Federal Street in Dover, Delaware for no charge.",
                "Businesses choose Delaware not for one single reason, but because we provide a complete package of incorporations services. The Delaware General Corporation Law (https://corp.delaware.gov/delaw/) is the most advanced and flexible business formation statute in the nation. The Delaware Court of Chancery (https://courts.delaware.gov/chancery/) is a unique 215 year old business court that has written most of the modern U.S. corporation case law. Delaware’s State Government is business-friendly and accessible. Our Division of Corporation is a model state-of-the-art efficiency and our staff provides prompt, friendly and professional service to clients, attorneys, registered agents and others. These factors have all contributed to making Delaware a premier legal home to companies around the world.",
                "Delaware law requires every corporation to have and maintain a Registered Agent in the State (https://corp.delaware.gov/agents/) who may be either an individual resident, a domestic corporation, or a foreign corporation authorized to transact business in Delaware whose business office is identical with the corporation’s registered office.",
                "You should contact an attorney concerning legal matters. The Delaware Division of Corporations acts solely in an administrative capacity and does not provide legal advice.",
                "If you are incorporated in another state or jurisdiction, Delaware law requires every corporation that is doing business in this state but is formed in another state or jurisdiction to submit a completed “Foreign Qualification” (https://corpfiles.delaware.gov/forqual09.pdf) form with the Division of Corporations along with a Certificate of Existence issued by that state or jurisdiction.",
                "With regard to how quickly you can incorporate or receive back your request, the Delaware Division of Corporations offers a variety of services including “1-Hour”, “2-Hour”, “Same Day” and “Next Day” Expedited Services (https://corp.delaware.gov/expserv/) which are designed to meet your business needs.",
                "In Delaware, DBA’s or Doing Business As.. names are registered in the Prothonotary’s office in the county in which you are doing business. You may download the required form from the Delaware Courts website at https://courts.delaware.gov/forms/.New Castle County – (302) 255-0800Kent County – (302) 739-3184Sussex County – (302) 855-7055.",
                "The most common way to amend your corporate documents in Delaware is to file a Certificate of Amendment (https://corpfiles.delaware.gov/amend09.pdf). You may call (302) 739-3073 if you have questions on properly completing your filing.",
                "To submit a filing or a request for certificates or copies in Delaware, information on how to submit a filing or request can be found here (https://corp.delaware.gov/regguide/).  You may call (302) 739-3073 if you need further assistance.",
                "To change your Registered Office and/or Registered Agent in Delaware, you may file a Certificate of Change of Registered Agent (https://corp.delaware.gov/coa09/). or if you wish, you may file a Certificate of Amendment (https://corp.delaware.gov/amend09/).",
                "To reserve an entity name in Delaware, Delaware's Division of Corporation now offers name reservations through the internet. You can reserve a Corporate, Limited Liability Company, Limited Partnership, Registered Series, Statutory Trust, General Partnership & Limited Liability Partnership name for a fee of $75.00 per name. Please check name availability (https://icis.corp.delaware.gov/Ecorp/EntitySearch/NameSearch.aspx) and reserve a name. The name you choose must be distinguishable from corporations or other entities reserved or registered under the laws of Delaware. The Delaware Corporation Law Annotated requires that all Corporate, Limited Liability Company, Limited Partnership, Registered Series, Statutory Trust, General Partnership & Limited Liability Partnership names be submitted in application form accompanied with the appropriate fee of $75 per name. You may also file your Corporate, Limited Liability Company, Limited Partnership, Registered Series, Statutory Trust, General Partnership & Limited Liability Partnership name application on the web for the appropriate fee of $75 per name. You may use ACH debit from your checking or savings account or charge a Visa, MasterCard, Discover or American Express card. Reserve your Corporate, Limited Liability Company, Limited Partnership, Registered Series, Statutory Trust, General Partnership & Limited Liability Partnership name on the web (https://icis.corp.delaware.gov/Ecorp/NameReserv/NameReservation.aspx).",
                "The State of Delaware does not provide legal advice. To determine which business structure is best suited for your needs, the State of Delaware recommends that you contact a Certified Public Accountant or an Attorney who specializes in Delaware Law. You may also visit Delaware Division of Revenues website for their Legal Business Structure Table (https://revenue.delaware.gov/services/Business_Tax/business_structures_table.pdf) for a break down of each entity type and how it may effect your business. If you are planning to conduct business in Delaware or hire employees in Delaware, please visit the Registration Process Flow Chart (https://revenue.delaware.gov/services/Business_Tax/Step2.shtml).",
                "With regard to what qualifies a corporation as a large corporate filer, Pursuant to Title 8 Chapter 5 Subsection 503 (c) 1 the entity had a class or series of stock listed on a national securities exchange and 2 reported in its financial statements prepared in accordance with United States GAAP or IFRS and included in its most recent annual report filed with the United States Securities and Exchange Commission or any similar agency outside the United States with responsibility for enforcing securities laws or serving as a public repository for the corporation’s financial disclosures, both of the following:consolidated annual gross revenues equal to or greater than $750,000,000 or consolidated assets equal to or greater than $750,000,000; andconsolidated annual gross revenues not less than $250,000,000 and consolidated assets not less than $250,000,000;",
                "In Delaware, if your company has been identified as a Large Corporate Filer, the Taxes cannot be recalculated it is a flat fee and pro-rations do not apply.",
                "In Delaware, if the company no longer qualifies as a Large Corporate Filer and we have not updated the record, please contact our office for instructions on what is required to update our records.",
                "To obtain a copy of the General Corporation Law of Delaware, a soft cover copy is available from LexisNexis (https://bookstore.lexis.com/bookstore/catalog) bookstore. You may also visit the Delaware Code (https://corp.delaware.gov/delaw/) online.",
                "Delaware Courts:Chancery Court (https://courts.delaware.gov/chancery/) Chancery Court Opinions (https://courts.delaware.gov/opinions/List.aspx?ag=Court%20of%20Chancery) Supreme Court (https://courts.delaware.gov/supreme/) Superior Court (https://courts.delaware.gov/superior/)",
                "Adoption documents for a foreign country often require apostilles or authentications. The Delaware Division of Corporations can apostille or authenticate documents notarized by a Delaware Notary, certified vital records from the State of Delaware, and official State documents (e.g., background checks). When such services are requested for personal use (such as an adoption) the Division discounts its fees to $30.00 for any documents that are presented simultaneously. This fee structure enables prospective international adoptive parents to minimize their costs by having all of their apostille and authentication documents processed at one time. As a further convenience, requests received via mail are typically processed on the same business day and hand delivered requests will be completed within 2 hours. To help expedite your request, mailed requests must include a cover memo clearly stating the purpose of the request (e.g. adoption in China). Documents may be either hand delivered, mailed or express mailed to: Division of Corporations – John G. Townsend Bldg. – 401 Federal Street – Suite 4 – Dover, DE 19901. Documents that are not picked up from our office will be sent regular first class mail unless a Federal Express or UPS or envelope is provided with the request. Please contact our office at (302) 739-3073 with any questions.",
                "With regard to how long it will take to process your Filing/Document request in Delaware, if a document is received by the office of Delaware Division of Corproations in proper form and all required fees are paid when received, the document will be filed with the date and time it was received in this office as soon as we are able to process the regular, non-expedited work for that date. Regular (non-expedited) work takes on average between 10 and 15 business days to process. However, due to the large amounts of work received in March, June and December, your request/document will take longer to process at these times of the year. During these peak periods, the processing time can be 3 – 4 weeks as long as there are no issues with the request which could cause further processing time delays. Any document can receive expedited service at any time of the year. Please see our fee chart located on our web site.",
                "To find an answer to a Franchise Tax question in Delaware, please see Frequently Asked Questions about Franchise Tax (https://corp.delaware.gov/taxfaq/)."
            ]
        }
    ]
}
