{
    "state": "Florida",
    "pages": [
        {
            "source": "",
            "paragraphs": [
               "\"To incorporate in the state of Florida you must follow the following steps:\r\n* Choose an organization name according to Florida's rules\r\n* File your organization's articles of incorporation with the Department of State\r\n* Request a Federal Employer Identification Number (FEIN) from the IRS\r\n* Obtain all necessary licenses from the state, city, and county\r\n* Pay the relevant costs and fees\r\n\"",
               "The base cost for incorporating in Florida is $70. This includes the registered agent designation and filing fees. The actual total cost depends on factors like the location and type of business. The Florida Department of State Division of Corporations accepts payment of additional fees.",
               "The processing times for an LLC vary depending on your filing method. Online filings will be approved within 11 business days, and you'll get an email when it's done. If you file a hard copy by mail, however, it may take more than a week.",
               "\"Business licenses are permits issued by government agencies that allow individuals or companies to conduct business within the government's geographical jurisdiction. Depending on the type of business that you start, you could find that you need a business license in Florida that comes from a state, city, or county agency.\r\n\r\nGenerally, to obtain a business license in Florida, you will need to:\r\n\r\nResearch what business licenses are required in your industry and jurisdiction\r\nDownload an application and gather any necessary documentation\r\nSubmit the application along with any required fees\"",
               "\"The Articles of Incorporation is a document that once filled with the Department of State Division of Corporations, it validates your incorporation. The articles must include the following information:\r\n\r\nCorporation's name\r\nOffice street address\r\nThe Corporation's purpose\r\nThe name, a signature, and address of the registered agent for service of process\r\nThe name and address of the person incorporating the company\"",
               "Incorporating a business means turning your sole proprietorship or general partnership into a company formally recognized by your state of incorporation. When a company incorporates, it becomes its own legal business structure set apart from the individuals who founded the business. Through incorporation, the company's owner or owners create a separate legal entity to transact business. This new business entity corporation or limited liability company (LLC) transforms the way the business is seen through the eyes of the law and often has more credibility with potential customers, vendors and employees.",
               "\"A corporation is an independent legal entity that exists separately from the people who own, control and manage it.\r\nIt does not dissolve when its owners (or shareholders) die because it is considered a separate “person.”\r\nA corporation can enter into contracts, pay taxes, transact business, etc.\r\nThe owners have limited liability.\r\n\"",
               "\"A limited liability company (LLC) is similar to a corporation, but with slight differences.\r\nLike a corporation, it offers limited personal liability. \r\nAn LLC is not required to hold regular stockholder or management meetings, and there are no requirements to comply with other corporate formalities.\"",
               "\"A partnership exists when two or more persons co-own a business and share in the profits and losses of the business.\r\nEach of the co-owners or partners contribute something, usually money or real property, to the business endeavor.  \"",
               "A general partnership is a legal structure where the rights and responsibilities are divided equally among the partners. The partners are referred to as general partners because each partner can act on behalf of all the partners, and each partner is responsible for the partnership’s debts and obligations. information.",
               "\"A limited partnership is a legal structure where both general and limited partners benefit from the business’s profits. It is composed of both general and limited partners.\r\nThis type of partnership allows each partner to determine and\/or limit his or her personal liability.\r\nUnlike general partners, limited partners are not responsible for the partnership’s actions, debts and obligations.\r\nGeneral partners have the right to manage the business. Limited partners do not.\r\n \"",
               "\"A sole proprietorship is the simplest and most common structure chosen to start a business.\r\nIt is an unincorporated business owned and operated by one individual with no distinction between the business and the owner. \r\nSole proprietorships, when not operating under the owner’s legal name, must register a fictitious name with the Division of Corporations.\"" 
            ]
        }
    ]
}
