{
    "state": "Iowa",
    "pages": [
        {
            "source": "https://sos.iowa.gov/business/faqs.html",
            "paragraphs": [
                "In Iowa, almost every business organization recognized in Iowa is categorized as either domestic or foreign. A domestic business organization is organized under and subject to the laws of Iowa. A foreign business organization in Iowa is one which is organized under a law other than Iowa.",
                "In Iowa, when a business organization transacts business beyond the borders of its original state of organization, it may find itself subject to the laws and regulations of the state in which it is transacting business. Before transacting business in Iowa, a foreign business organization must determine if authority from the Secretary of State is required. The following are some of the foreign business organizations which may register in Iowa. Transacting business in Iowa is not defined by the Iowa Code. Instead, each situation is assessed on a case-by-case basis. By clicking on the code sections below you can link to some of the statutory requirements for operating a foreign business organization in Iowa, as well as a list of activities which do NOT constitute transacting business in Iowa. If you are unsure as to whether you should obtain authority from the Secretary of State, you should contact your legal counsel for advice.",
                "In Iowa, a registered agent is an individual (or a corporation depending on the business organization) designated by the entity to accept service of process if a lawsuit is filed against the entity. The registered agent may be an Iowa resident, an Iowa profit or nonprofit corporation, or a foreign profit or nonprofit corporation qualified to do business in Iowa. Most business organizations that transact business in the state of Iowa are required to have a registered agent for service of process. In certain instances as provided by law, the Iowa Secretary of State acts as an agent for service of process. View a list of Iowa Code provisions (https://sos.iowa.gov/business/SOSCodes.html) where the Secretary of State acts as agent for service of process. Most business organizations that transact business in the state of Iowa are also required to maintain a registered office. The registered office address must be a street address, and not merely a post office box. Also, the registered agent's business office address must be the same as the registered office address. A business organization may change its registered office or agent at any time by completing this form (https://sos.iowa.gov/business/pdf/635_0119.pdf).",
                "In Iowa, a mark is a word, name, symbol, or device (or any combination) used to distinguish the goods or services of that person from the goods or services of others. A person includes corporations and other business entities, as well as individuals. A trademark is used on manufactured or produced goods. A service mark, on the other hand, is used to identify the services offered by a person. Marks are protected at common law but registration of a mark with the Secretary of State provides added protections. It may also be advantageous for a business organizations which have marks not used in interstate commerce, and therefore, do not qualify for registration under a federal law. Marks provide consumers and customers with a dependable way to distinguish between the goods or services of different manufacturers or service providers. They are also a protection for manufacturers and service providers to allow them to identify their products or services as uniquely their creation. Marks registered with the Secretary of State are often searched. A registered mark may prevent others from adopting and infringing upon the mark by providing notice to others that the mark is \"in use.\" \"In use\" means that the proposed mark has already been used in commerce. A mark cannot be made merely to reserve a right to use it. On goods sold or transported in commerce in Iowa, a mark is deemed in use when the mark is placed on the goods or containers or associated displays or affixed on tags or labels. On services, a mark is deemed in use when used or displayed in the sale or advertising of the services and the services are rendered in Iowa. Other terms to be aware of regarding marks are: Specimen A specimen must be an example of the mark as actually used and as the customer sees it, i.e. a product wrapper or an advertising flyer for services. Class A trademark or service mark \"class\" reflects the business of the applicant, not necessarily the medium upon which the mark appears. For example, a health club would apply under class 107 - education and entertainment - not under class 39 - clothing. Descriptive mark A merely descriptive trademark provides consumers with an easy way to distinguish between the goods or services. A mark cannot merely describe the goods or services with which they are associated, or consist only of generic words. A mark (trademark or service mark) may be issued to any applicant meeting the requirements of Iowa Code chapter 548. Applications to register a trademark are available from the Secretary of State's Office.",

            ]
        }
    ]
}
