{
    "state": "Indiana",
    "pages": [
        {
            "source": "https://inbiz.in.gov/about/faq/",
            "paragraphs": [
                "In the context of Indiana, INBiz is a website where businesses can log on with one username and password to do business with multiple areas of government in the state of Indiana. Currently, the website offers Secretary of State, Department of Workforce Development and Department of Revenue services.",
                "In the context of Indiana, INBiz is happy to offer general information, we cannot offer legal advice. Consulting an attorney may be important if your business is more complicated than a lemonade stand. However, Click Here (https://inbiz.in.gov/business-filings/registration) for information about the entity type your business might take",
                "In Indiana, INBiz is open to anyone who wants to register a business with the Secretary of State or comply with business registration requirements. Once a new business has registered with the Secretary of State, that business can use INBiz to register with the Department of Revenue. An existing business can use INBiz to add a new tax type or a new location to its Department of Revenue registration.",
                "In Indiana, You can register your business with the Secretary of State's office, make changes to your business registration filing and pay your annual filing fees. Businesses are able to register with the Department of Revenue. In addition, businesses are able to add a tax type to a location and add a new location with the Department of Revenue. Businesses also can register with the Department of Workforce Development. INBiz links directly with the Department of Workforce Development's current system allowing businesses to do anything that is available online today.",
                "In Indiana, the Secretary of State, Department of Revenue and the Department of Workforce Development are all working to identify additional areas of service to make available on the portal at a later date.",
                "In Indiana, additional services for the current offices involved in the project will most likely be available in early 2017. In addition to adding services for the current offices, INBiz plans to expand to offer additional offices as well. We are currently working to identify those offices.",
                "In Indiana, if you are starting a new business in Indiana, you need log on to INBiz or create an account to register your business. The INBiz system will walk you through the process of registering your business step-by-step. Remember once you register your business, you will need to regularly file business entity reports with the office to keep us up to date on your businesses information.",
                "In Indiana, a report that is filed bi-yearly for for-profit companies and yearly for non-profit companies during your anniversary month. The report keeps the state up to date with information on your business information. For-profit have to file every 2 years on the anniversary month.",
                "In Indiana, Non-profits have to file every year on their anniversary month of formation or anniversary month when granted authority to do business in the state of Indiana.",
                "In Indiana, if you are a sole proprietor, you don't have to register with the Secretary of State's office. However you are required to register with the Indiana Department of Revenue. You can complete this business tax registration via the INBiz website. If you will have employees, you also may need to register with the Department of Workforce Development. This also can be completed via INBiz.",
                "In Indiana, certified copies are available at the bottom of the INBiz homepage under popular resources. Click on the certified copies link to generate copies."
            ]
        }
    ]
}
