{
    "state": "Nevada",
    "pages": [
        {
            "source": "https://www.nvsos.gov/sos/businesses/commercial-recordings/faqs",
            "paragraphs": [
                "Benefit corporations, governed by NRS Chapter 78B, are for profit entities that consider the society and environment in addition to fiduciary goals in their decision-making process, differing from traditional corporations in their purpose, accountability, and transparency. The purpose of a benefit corporation is to create general public benefit, which is defined in 78B.040 as “a material positive impact on society and the environment, taken as a whole, as assessed against a third-party standard, from the business and operations of a benefit corporation.",
                "In its articles of incorporation, or through an amendment, a benefit corporation states that it is a benefit corporation and identifies one or more specific public benefits as an additional purpose, such as, though not limited to, the following examples: Providing low-income for underserved individuals or communities with beneficial products or services. Promoting economic opportunity for individuals or communities beyond the creation of jobs in the ordinary course of business. Preserving the environment.Improving human health and promoting the arts, sciences or the advancement of knowledge.",
                "DBA (Doing Business As)'s are filed at the county level, not with the Secretary of State. Please contact the clerk or recorder's office in the county where you wish to file.",
                "The Secretary of State does NOT provide a name availability service. Name availability can be checked by: Requesting a name be reserved by Going to the Secretary of State website's Business Entities Search page. You may also reserve a name on our website by going here https://www.nvsilverflume.gov/home and clicking on \"Name Reservation.\" Or, by:Submitting a completed name reservation form https://www.nvsos.gov/sos/businesses/commercial-recordings/forms-fees/name-reservation, with the $25 filing fee. You may expedite your name reservation by including an additional $25. Be sure to request \"expedited service\" in your cover letter.",
                "Status information can be obtained, free of charge, on the Secretary of State website's Business Entities Search page. You can also call the Secretary of State's Customer Service Division at 775-684-5708.",
                "The Secretary of State's office does not have information regarding old stock certificates. However, you can request a search for information on the company that may have issued the certificate by sending a copy of the corporate stock certificate and the $50 payment via U.S. mail, email, or fax. Click Here https://www.nvsos.gov/sos/businesses/commercial-recordings/forms-fees for Customer Order Instructions and fees for Copies and Certificates.",
                "You can download the forms from the Forms Library https://www.nvsos.gov/sos/businesses/commercial-recordings/forms-fees/all-business-forms, under Resources on the homepage, then submit by fax, email, or by mailing your request to: COMMERCIAL RECORDINGS DIVISION 202 North Carson Street Carson City, NV 89701 Or, dropping by one of our offices https://www.nvsos.gov/sos/sos-information/contact-us/commercial-recordings-contact-information. Many forms can be filed online. https://www.nvsos.gov/sos/online-services",
                "You may view officers of a corporation on the Business Entities Search page.",
                "A customer that has not received their filing documents or copy order must notify the Secretary of State's office within 60 days of original order; otherwise, the customer must order replacement copies and certificates. Please see our fee schedule https://www.nvsos.gov/sos/home/showdocument?id=1043.",
                "If the account hosts a credit of $15.00 or more, a written request for the refund must be made within one year of payment pursuant to NRS 353.115. Amounts not used or refunded within one year are not available for use or refund. Written requests may be submitted via email at sos-trust@sos.nv.gov, by fax at 775-684-5630, or mailed to: Secretary of State Attn: Accounting 204 North Carson Street Carson City, Nevada 89701-4201 Please include any relevant information, such as date of refund, amount of refund, check number and/or name, or job number.",
                "Yes, ceremonial charters and certificates are available, printed on the Secretary of State’s beautifully illustrated charter paper, and are suitable for framing. Ceremonial charters and certificates may be ordered through our Copies Division via email, fax, or mail. The cost for each ceremonial charter or certificate is $100. Ceremonial charters and certificates may also be ordered at the time formation documents are processed. Customers must indicate on their order instructions the number of ceremonial charters or certificates they wish to purchase, accompanied by $100 for each requested. Click Here https://www.nvsos.gov/sos/businesses/commercial-recordings/ceremonial-charters-certificates for more information on Ceremonial Charters and Good Standings Certificates. Click Here https://www.nvsos.gov/sos/home/showdocument?id=1915 for Customer Order Instructions for Copies and Certificates.",
                "All orders must be accompanied by payment and in writing using the Copies Order Form https://www.nvsos.gov/sos/home/showdocument?id=1915, a letter, and submitted to the Secretary of State's Carson City office, via email to copies@sos.nv.gov, or by fax to (775) 684-5646. If pay electronically, please use the ePayment Checklist https://www.nvsos.gov/sos/home/showdocument?id=1007, or provide the credit card type (VISA, Mastercard, Discover or American Express), the expiration date and the v-code located on the back of the card, or payment may be made using your trust account. Trust account and credit card customers may fax expedite orders, only, to (775) 684-5646. Trust account orders must be received on company letterhead. All orders not specified as a pick-up are mailed out via first-class mail, unless a Federal Express number is provided or other major courier pickup arrangement is made. Email and Fax back service is available. This service must be requested at time of order with complete email or fax information provided. Please note that if you request email or fax service, we will not send a hard copy via mail. (NOTE: not all orders may be available for email or fax service, in which case it will be mailed or placed in pick-up bin)Each order will be delivered using only one method of delivery.",
                "There are certain words that require prior authorization by the appropriate regulatory authority for use in the name and/or purpose of any organizational document or amendment filed with the Secretary of State. Prior authorization is required, regardless if the word stands alone or if the word is \"part\" of a word. Failure to receive and provide proof of authorization will result in the rejection of the document. Please click here to be taken to the restricted word list. https://www.nvsos.gov/sos/businesses/commercial-recordings/restricted-word-list",
                "Yes. These lists may be filed online at SilverFlume https://nvsilverflume.gov/home. Click on the \"Manage Your Business\" tab to begin.",
                "Set up an account and use online services by registering first on SilverFlume.",
                "Documents and certificates ordered or processed online are available in your job history folder a few minutes after checkout. Log back into the system and click on the \"Job History\" box. Select the appropriate job number and you will find your documents. If the documents and certificates ordered or processed were completed on SilverFlume, you will need to log into that site and go to the “”Documents” tab to retrieve the items from there.",
                "When submitting your documents directly to the Secretary of State, please make out checks to: Secretary of State. When submitting through a Registered Agent, please check with that Registered Agent.",
                "Filings are rejected for many reasons including, but not limited to the following:, Name not available, Document was not signed, Insufficient fees for filing, Statutory requirements not included, Document is illegible, Document in such poor condition that cannot be scanned, Credit card declined, Entity not in good standing or not on file with this office, Required documents not included.",
                "Yes. Trademarks, trade names and service marks can be searched online. Click here for Business Entity Search page, and search by the mark or entity name. The results will reflect any trademark, trade name or service mark on file, along with the business entities with that name.",
                "No, documents are scanned into our processing system at the time of receipt and the scanned documents become the official record. Original documents are destroyed once the scanned images are archived. If rejected, new documents must be resubmitted.",
                "Yes. For an additional fee you may have your documents processed and orders filled on an expedited basis. We offer 1-, 2-, and 24-hour expedited service for most processes. Click here https://www.nvsos.gov/sos/home/showdocument?id=1041 for the expedite schedules and additional information.",
                "Contact the IRS for federal tax information, or the Nevada Department of Taxation for questions regarding state taxes.",
                "To order online: Click Here https://www.nvsilverflume.gov/account/login?service=https%3A%2F%2Fwww.nvsilverflume.gov%2Fj_spring_cas_security_check and select \"Good Standing Certificate\" To order by mail: Send a letter with the name of the entity for which you are requesting the certificate, along with a check, money order, or credit card authorization for $50.00 made payable to \"Secretary of State\" to: Secretary of State Barbara K. Cegavske 202 North Carson Street Carson City, Nevada 89701-4201 To order via email: Send a detailed request, along with credit card information, to copies@sos.nv.gov. To order via fax (Expedited Order Only): Fax a detailed request, along with credit card information to 775-684-5645. The Secretary of State's office accepts Visa, MasterCard, American Express and Discover Card for all payments. Please note: For security and verification purposes, all credit card payments must include the 3 or 4-digit CVV2 code (VCode) number located on the back of your credit card. Failure to include this code will result in rejection of your filing or service request.",
                "To view sample Certificates of Good Standing, see: https://www.nvsos.gov/sos/businesses/commercial-recordings/sample-certificates",
                "To verify an electronic Certificate of Good Standing: Click Here https://www.nvsos.gov/sos/online-services and select \"Verify Good Standing Certificates\" ",
                "Information on how to reinstate a revoked entity may be obtained by contacting the Secretary of State's Customer Service Division at 775-684-5708, or by obtaining the reinstatement packet for the appropriate entity type and using the Business Entities Search and Calculate Fees tab. Reinstatements are only filed in-house by the Secretary of State. Online filing for reinstatements is not available. Registered agent fees are not included when using the Fees Calculator tab." 
            ]
        }
    ]
}
