{
    "state": "New York",
    "pages": [
        {
            "source": "https://www.dos.ny.gov/corps/llcfaq.asp#busoper",
            "paragraphs": [
                "Types of businesses that operate in New York State are: Business Corporation, Not-for-Profit Corporation, Limited Liability Company, General Partnership, Limited Partnership, Sole Proprietorship", 
                "A New York limited liability company (LLC) is an unincorporated business organization of one or more persons who have limited liability for the contractual obligations and other liabilities of the business. The LLC is a hybrid form that combines corporation-style limited liability with partnership-style flexibility. The owners of an LLC are “members” rather than shareholders or partners. A member may be an individual, a corporation, a partnership, another limited liability company, or any other legal entity. An LLC may organize for any lawful business purpose or purposes. The Department of State cannot offer advice about the choice of business formation and strongly recommends consulting with legal and financial advisors before making the choice.",
                "A New York limited liability company may be formed by filing Articles of Organization pursuant to Section 203 of the Limited Liability Company Law. More information about Articles of Organization, Domestic Limited Liability Companies: http://www.dos.ny.gov/corps/llccorp.html#artorg.",
                "In New York, the Division of Corporations is required by statute to reject for use any corporate, limited partnership, or limited liability company name that is not \"distinguishable\" from existing names on file. The only avenue to determine whether a name is available for a corporation, limited partnership or limited liability company is to make a name availability inquiry. The Corporation and Business Entity Database (http://www.dos.ny.gov/corps/bus_entity_search.html) online search intended for status inquiries of entities already on file with the Department of State. Customers are cautioned to avoid interpreting database search information as an indication that a name is or is not available for use.The records of the Division of Corporations may be searched for availability of name by submitting a written request to the Department of State, Division of Corporations, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. The written inquiry should state that you wish to determine the availability of a name and list the name or names to be searched.Although it is not required, it is recommended that a copy of the name availability response be attached to the document you are submitting for filing.A finding that the name is available is not an approval of the name by the Department of State and is not a determination that the proposed name satisfies any particular requirement of law. No expenditure or other commitment should be made in reliance upon the availability of a name.Pursuant to Section 96 of the New York State Executive Law, the fee for searching the records for availability of name is $5 per name submitted. Please note that the Department's determination regarding the availability of a name applies only to the date and time that the name search was completed. Requests for name availability cannot be handled by telephone.", 
                "In New York, a foreign limited liability company may apply for authority to do business in the State of New York by filing an Application for Authority pursuant to Section 802 of the Limited Liability Company Law. ",
                "The Limited Liability Company Law and Partnership Law include provisions regarding the publication required upon the formation or authorization of domestic and foreign limited liability companies, limited partnerships and limited liability partnerships (hereinafter referred to as \"limited liability entities\"). The applicable statutory provisions should be consulted prior to publishing.A limited liability company that is a theatrical production company is exempt from the publication requirements provided the words \"limited liability company\" appear in its name. Also, a limited partnership that is a theatrical production company is exempt from the publication requirements provided the words \"limited partnership\" appear in its name. See Section 23.03 of the Arts and Cultural Affairs Law.Publication must be done once a week for six successive weeks in two newspapers in the county in which the office of the limited liability entity is located. One newspaper must be \"printed daily\" and the other \"printed weekly.\" The newspapers must be designated by the county clerk.The printer or publisher of each newspaper will provide you with an Affidavit of Publication. A Certificate of Publication, with the Affidavits of Publication annexed thereto, must be filed with the Department of State, Division of Corporations, One Commerce Plaza, 99 Washington Avenue, Suite 600, Albany, NY 12231. The fee for filing the Certificate of Publication is $50. The Certificate of Publication forms are available on the Department of State's website: http://www.dos.ny.gov/corps/index.html.Limited liability entities that are formed or authorized to do business in New York after June 1, 2006, which fail to comply with the publication requirements within 120 days after their formation or qualification will have their authority to carry on, conduct or transact any business suspended.Note that at any time following the suspension of a limited liability entity's authority to carry on, conduct or transact business, the limited liability entity may file the certificate of publication with the affidavits of publication of the news.",
                "The word \"backer\" or the phrase \"cover sheet,\" as used in filings made with the New York  Division of Corporations, describes a page of information that must accompany each certificate submitted for filing. The backer/cover sheet contains the following: (1) the name of the document (e.g., Certificate of Incorporation of ABC Inc.); (2) the statute under which the certificate is submitted for filing; and (3) the name and address of the filer of the certificate. The filer's name and address are used as the mailing address for the filing receipt (the only routine documentation issued upon a certificate filing) or rejection letter (describing changes and/or additions required to meet guidelines for filing). For filers using preprinted forms, the backer is provided on the last page.",
                "In New York, corporate kits may be purchased from a legal stationery store. A corporate kit usually contains a corporate seal, blank stock certificates and forms for the adoption of by-laws and recording the minutes of meetings. Rather than composing their own forms, some may find it easier to use the preprinted forms provided in a corporate kit. Please note that New York State law does not require a corporation to have a seal. Your telephone book's yellow pages or a yellow pages information operator (your area code + 555-1212) may be helpful in locating a legal stationery store.",
                "In New York, copies of any documents (Certificates of Incorporation, Articles of Organization, Certificates of Amendment, etc.) filed with the Division of Corporations may be obtained by submitting a written request to the New York State Department of State, Division of Corporations, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. The written request should include the following information:The exact name of the corporation or other business entity.The DOS ID number or the exact date of formation or authorization.The document(s) requested.*A statement as to whether the request is for plain copies or certified copies.The mailing address where the copies are to be mailed.The fee for a plain copy of a document is $5, and the fee for a certified copy of a document is $10.",
                "In New York, the Department of State does not provide copies of filing receipts.The Division of Corporations will accept written requests for copies of documents by fax. Fees for written requests received by fax must be paid using your credit card/debit card. To pay for a fee using your credit card/debit card, simply complete and sign the Credit Card/Debit Card Authorization Form (https://www.dos.ny.gov/forms/corporations/1515-f.pdf) (43.9 KB PDF Form, 1 page) and submit it to the Division of Corporations with your written request. Written requests for copies of documents may be faxed to (518) 473-1654.The large volume of submissions and requests received each day by the Division makes it impracticable for Division staff to verify receipt of individual customer submissions. Please do not call the Division for verification of receipt after submitting a certificate or request by fax. If you do not receive correspondence from our office after a reasonable period of time has elapsed, you may contact the Division at (518) 473-2492 for further instructions.Please note that copies will be returned by first-class mail. We do not provide these copies by fax. You may request that your copies be returned to you by overnight delivery service by enclosing a prepaid shipping label with your request. The Department of State will not accept prepaid shipping labels with the Department of State listed as the sender. The prepaid shipping label must list yourself as the sender and the receiver.*To determine the certificate(s)/document(s) that have been filed with the Division of Corporations by the corporation or business entity, please contact the Call Center at (518) 473-2492.",
                "In New York, a Certificate of Status (Also referred to as a Certificate of Good Standing or Certificate of Existence) may be obtained by submitting a written request to the New York State Department of State, Division of Corporations, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231.The written request must include the following information:A specific statement requesting a Certificate of Status.The exact name of the corporation or other business entity.The DOS ID number or the exact date of formation or authorization, if known.A statement as to whether the request is for routine processing or expedited processing.The mailing address where the Certificate of Status is to be mailed.The fee for a Certificate of Status is $25.",
                "The New York Division of Corporations will accept written requests for Certificates of Status by fax. Fees for written requests by fax must be paid using your credit card/debit card. To pay for a fee using your credit card/debit card, simply complete and sign the Credit Card/Debit Card Authorization Form (https://www.dos.ny.gov/forms/corporations/1515-f.pdf) 43.9 KB PDF Form, 1 page) and submit it to the Division of Corporations with your written request. Written requests for Certificates of Status may be faxed to (518) 473-1654.The large volume of submissions and requests received each day by the Division makes it impracticable for Division staff to verify receipt of individual customer submissions. Please do not call the Division for verification of receipt after submitting a certificate or request by fax. If you do not receive correspondence from our office after a reasonable period of time has elapsed, you may contact the Division at (518) 473-2492 for further instructions.Please note that a Certificate of Status will be returned by first-class mail. We do not provide these documents by fax. You may request that your certificate be returned to you by overnight delivery service by including a prepaid shipping label with your request. The Department of State will not accept prepaid shipping labels with the Department of State listed as the sender. The prepaid shipping label must list yourself as the sender and the receiver.",
                "In New York, Corporations, limited partnerships, and limited liability companies are required by statute to conduct activities under their true legal name. If a corporation, limited partnership, or limited liability company desires to conduct activities under a name other than its true legal name, a certificate complying with Section 130 of the General Business Law must be filed with the New York State Department. More: http://www.dos.ny.gov/corps/assdnmins.html",
                "In New York, Framing Certificates are available from the NYS Department of State, Division of Corporations for those entities on file with the Department. Each certificate is printed on 11\" x 14\" parchment paper and is suitable for framing. The fee is $25.00 per certificate (check or money order payable to \"NYS Department of State\").Send your request to:NYS Department of State Division of CorporationsOne Commerce Plaza, 99 Washington Ave.Albany, New York 12231-0001For additional information: (518) 473-2492",
                "In New York, the Department of State's Division of Corporations accepts MasterCard, Visa and American Express for the payment of fees and services. Requests for copies of documents, certificates under seal, name availability, service of process and all documents submitted for filing may be paid by credit card or debit card.With the exception of service of process, which must be made in person, all documents submitted for filing and written requests for other services may be faxed or otherwise delivered to the Division of Corporations. To pay for a fee by using your credit or debit card when not appearing in person, simply complete and sign the Credit Card/Debit Card Authorization Form (https://www.dos.ny.gov/forms/corporations/1515-f.pdf) (43.9KB PDF Form) (1 page) and submit it to the Division of Corporations with your request. You may fax a document submitted for filing to the Division of Corporations at (518) 474-1418. Written requests for copies of documents, certificates under seal and name availability may be faxed to (518) 473-1654. Biennial Statements may be faxed to (518) 486-4680.Please note that filing receipts, copies, certificates under seal and responses to name availability requests will be returned by first-class mail. We do not provide these documents by fax. You may request that your filing receipt or other document be returned to you by overnight delivery service by including a prepaid shipping label with your request. The Department of State will not accept prepaid shipping labels with the Department of State listed as the sender. The prepaid shipping label must list yourself as the sender and the receiver.",
                "The New York Division of Corporations will accept requests for filings of documents, copies, certificates under seal and name availability by fax. Fees for requests by fax must be paid by charges to your credit card/debit card. To pay for a fee by using your credit card/debit card when not appearing in person, simply complete and sign the Credit Card/Debit Card Authorization Form (https://www.dos.ny.gov/forms/corporations/1515-f.pdf) (43.9KB PDF Form) (1 page)] and submit it to the Division of Corporations with your request. You may fax a document submitted for filing to the Division of Corporations at (518) 474-1418. Written requests for copies of documents, certificates under seal and name availability may be faxed to (518) 473-1654. Biennial and LLP Statements may be faxed to (518) 486-4680.Please Note: With faxes, we recommend that you submit your certificate or request only once. Sending multiple submissions of the same certificate or request may result in duplicate filings or multiple performance of the same service with an applicable and non-refundable fee charged. The Division of Corporations, State Records, and Uniform Commercial Code receives a large amount of submissions throughout the day which makes it unlikely that a duplicate submission will be recognized as such prior to its processing. Therefore, there exists the possibility of duplicate filings or services occurring on the same day with associated fees being charged. The large volume of submissions and requests received each day by the Division makes it impracticable for Division staff to verify receipt of individual customer submissions. Please do not call the Division for verification of receipt after submitting a certificate or request by fax. If you do not receive correspondence from our office after a reasonable period of time has elapsed, you may contact the Division at (518) 473-2492 for further instructions. Please note that filing receipts, copies, certificates under seal and responses to name availability requests will be returned by first-class mail by the United States Postal Service. We do not provide these documents by fax. You may request that your filing receipt or other document be returned to you by overnight delivery service by including a prepaid shipping label with your request. The Department of State will not accept prepaid shipping labels with the Department of State listed as the sender. The prepaid shipping label must list yourself as the sender and the receiver. Overnight delivery service providers pick up outgoing packages from the Division of Corporations prior to the end of our business day.  In this case, your overnight package may not leave the Department of State until the following business day.",
                "The records of the New York Division of Corporations may be searched on this site. You may search the records of the Division of Corporations to obtain information on corporations, limited liability companies, limited partnerships, and limited liability partnerships. Information available includes the following: (1) current entity name; (2) date of organization; (3) jurisdiction, if other than New York State; (4) county location; (5) service of process address; (6) registered agent, if any; and (7) the current status of the entity. Information on business corporations may also include the name and address of the chief executive officer and the principal business location. The information available through this site is updated daily.The Division of Corporations' computerized inquiry system contains the complete filing history* of all active corporations, limited partnerships, limited liability companies, and limited liability partnerships and a complete or partial filing history of corporations in existence on or after December 5, 1977, but that went out of existence before December 31, 1984. The records of corporations that went out of existence prior to December 5, 1977, are contained in manual inactive files at the Department of State. Although still maintained, a written request must be made for these records.Customers are cautioned to avoid interpreting database search information as an indication that a name is or is not available for use. The Department of State is required by statute to reject for use any corporate, limited partnership, or limited liability company name that is not \"distinguishable\" from existing names on file. The only avenue to determine whether a name is available for a corporation, limited partnership or limited liability company is to make a name availability inquiry. By Telephone: Callers to (518) 473-2492 may request a database search of up to five entity names during a single call. Information available includes the following: (1) current entity name; (2) date of organization; (3) jurisdiction, if other than New York State; (4) county location; (5) service of process address; (6) registered agent, if any; and (7) filing history. Information on business corporations may also include the name and address of the chief executive officer and the principal business location.By Mail, Fax, or E-mail: Written requests containing up to five entity names may be submitted by mail directed to the Department of State, Division of Corporations, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231; by fax to (518) 473-1654; or by e-mail (corporations@dos.ny.gov). The information for up to five record searches is provided free of charge. Requests for more than five record searches must be accompanied by a fee of $5 for each entity search exceeding the first five. Requests for more than five record searches must be submitted (with the required fee) by mail or in person at our Albany office.By Service Company/Drawdown Account: A service company/drawdown (prepay) account may be established with the Division of Corporations to directly access the Division's computerized index of corporations and other business records.A service company/drawdown account must be used to pay transaction fees if you wish to directly access the Division's computerized index of corporations and business entity records. The database may be searched by a corporation or business entity name. The Division of Corporations charges a fee of 75 cents per transaction. A transaction allows access to the filing history of business entities returned by the search.The following are the requirements for accessing the Division of Corporations' database:Financial: There are no start-up fees payable to the Department of State. There is a charge of 75 cents per transaction.Technology: The database may be accessed by anyone with Internet access. If this service is certificates of status in your office. This service requires that you have an e-mail package that handles attachments, Adobe Acrobat Reader, and a printer that handles graphics.Although there is no requirement to maintain a minimum balance in a drawdown account once established, a minimum deposit of $100 is required to establish an account. The Department of State does not extend credit. If an account does not have sufficient funds to pay for the requested service of access to records, the request will be denied.If you would like additional information, please contact the Division of Corporations, State Records and Uniform Commercial Code by e-mail (corporations@dos.ny.gov), in writing, or by calling (518) 473-2492.*To determine the certificate(s)/document(s) that have been filed with the Division of Corporations by the corporation or business entity, please contact the Call Center at (518) 473-2492.",
                "The New York Department of State does not require or maintain information regarding the names and addresses of officers or directors of corporations, the members or managers of a limited liability company, the limited partners of a limited partnership or the partners in a limited liability partnership. These records are maintained by the corporation, limited liability company, limited partnership or limited liability partnership. You may wish to contact the entity directly to obtain this information.The Department of State is able to provide the address to which the Secretary of State is required to forward copies of process accepted on behalf of a corporation, limited liability company, limited partnership and limited liability partnership, as well as the name and address of the registered agent, if one has been designated.The Department's records may include the name and address of the chief executive officer and the principal business location of a business corporation, provided that the business corporation has filed its Biennial Statement as required by Section 408 of the Business Corporation Law.You may search the New York Department of State's Corporation and Business Entity Database (http://www.dos.ny.gov/corps/bus_entity_search.html) to obtain information on corporations, limited liability companies, limited partnerships, and limited liability partnerships.",
                "Service of process on the New York Secretary of State as agent of a corporation or other business entity may be accomplished by serving an authorized person at the New York Department of State’s office at One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. Process should be brought to the Customer Service Counter located on the 6th Floor.In addition to the other methods prescribed by law, the New York Secretary of State acts as the statutory agent for service of process for domestic and foreign business corporations; not-for-profit corporations that have been formed or amended their Certificate of Incorporation after September 14, 1981; limited liability companies; limited partnerships; and limited liability partnerships.Only \"process\" may be served on the New York Secretary of State as agent. \"Process\" is defined as judicial process and all orders, demands, notices, or other papers required or permitted to be personally served on a domestic or foreign entity, for the purpose of acquiring jurisdiction of such entity in any action or proceeding, civil or criminal, whether judicial, administrative, arbitrative, or otherwise, in this state or in the federal courts sitting in, or for, this state. (See §102(a)(11) of the Business Corporation Law, §102(a)(12) of the Not-for-Profit Corporation Law, §102(x) of the Limited Liability Company Law, §121-101(o) of the Partnership Law.)Service of process is accepted pursuant to the following sections of New York State Law: Sections 306, 306-A, and 307 of the Business Corporation Law; Sections 306 and 307 of the Not-for-Profit Corporation Law; Sections 301-A, 303, and 304 of the Limited Liability Company Law; Sections 121-104-A, 121-109, 121-1505, and 121-1506 of the Partnership Law. Please note that nothing in these sections of New York State law affects the right to serve process in any other manner permitted by law.Service of process upon a domestic or authorized foreign corporation, limited liability company, limited partnership, or limited liability partnership requires that two copies of the process be personally served on the New York Secretary of State or any person authorized by him at the Office of the New York Department of State, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. Service by mail is not permitted. The statutory fee for serving process is $40.Service of process upon an unauthorized foreign or suspended corporation, limited liability company, limited partnership, or limited liability partnership requires that one copy of the process be personally served on the New York Secretary of State or any person authorized by him at the Office of the New York Department of State, One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. Service by mail is not permitted. The statutory fee for serving process is $40. Please refer to the appropriate section of law for additional mailing/service requirements.The New York Department of State has prepared \"Instructions for Service of Process on the Secretary of State as Agent for Domestic or Authorized Foreign Entities. (http://www.dos.ny.gov/corps/servinstr.html)\" The instructions are intended to provide guidance to Process Servers who wish to serve process on the New York Secretary of State. Please note that the New York Department of State cannot provide legal advice. Process Servers are encouraged to consult with their own attorneys for advice on any matter discussed in these instructions or regarding any other aspect of service of process.To serve process on the New York Secretary of State as statutory agent of any person, corporation or other business entity, the Process Server will be required to:determine the identity of the entity intended to be served;obtain the \"DOS Search Page(s)\" for the entity the Process Server intends to serve;complete a \"Service of Process/Notice of Claim Cover Sheet;\"hand-deliver the process being served (with the Service of Process Cover Sheet and DOS Search Page(s) stapled thereto), and the applicable fee, to an authorized person at the New York Department of State’s office at One Commerce Plaza, 99 Washington Avenue, Albany, NY 12231. Process should be brought to the Customer Service located on the 6th Floor.Download \"Service of Process/Notice of Claim Cover Sheet\" (pdf file: https://www.dos.ny.gov/forms/corporations/0277-f.pdf) >>Read \"Instructions for Service of Process on the Secretary of State as Agent for Domestic or Authorized Foreign Entities\"Read \"How to Serve Notice of Claim"" (http://www.dos.ny.gov/corps/how_to_serve_notice_of_claim.html)",
                "Federal tax regulations allow an LLC to elect its tax status for income tax purposes. Consult a tax adviser about these \"check-the-box\" regulations and any changes. For income tax purposes, state law follows federal law. Additionally, state law imposes a tax based on the number of members of the LLC. Also, depending on the nature of the business it undertakes, the LLC may have to pay or collect sales taxes, withholding taxes and other taxes.The LLC will need a taxpayer identification number, obtainable from the federal Internal Revenue Service (http://www.irs.gov/). The IRS can answer questions about paying or withholding federal income tax, social security taxes and other federal taxes.Questions concerning New York State taxes should be directed to the New York State Department of Taxation and Finance (http://www.tax.state.ny.us/), Taxpayer Assistance Bureau, W.A. Harriman Campus, Albany, NY 12227. You may contact the Business Tax Information Center at (518) 457-5342.",           
                "Resource list of the most common areas of inquiry not handled by the New York Department of State: http://www.dos.ny.gov/corps/othersites.html"
            ]
        }
    ]
}
