{
    "state": "Federal",
    "pages": [
        {
            "source": "https://www.sba.gov/course/legal-requirements-small-business/#course-transcript",
            "paragraphs": [
                "To run your business legally, there are certain federal and state licenses and permits you will need to obtain. There may also be county, city, or other local licenses and permits as well. With so many variables affecting your business choice, the best way is to start by using  your favorite search engine to help gather the information you need.",
                "How you register your business will vary based on the business structure you have chosen. However, in general you will need to check on federal, state and local regulations that may impact your business. Select each item for some examples of federal, state, and local regulations.",
                "You may need to obtain a federal license or permit if your business concerns activities supervised and regulated by a federal agency. For example, you need a federal permit to sell alcohol or firearms. Special permits and licenses are covered later. Federal Employer Identification Numbers (EIN) are discussed later in this course.",
                "You will likely have to register your business with your state's business office. If you are doing business in more than one state, you will have to follow the registration procedures unique to each state in which you plan to operate. And, as with the federal government, many states permits or licenses for certain products or services.",
                "Most localities have business requirements and restrictions. Food and liquor licenses are usually required from the city or county where the business is located, and you will have to register with the city or county treasurer for tax purposes.",
                "DBA is a popular acronym that means 'Doing Business As.' It is also sometimes called \"assumed name\" or \"fictitious name\". It is the legal term used to describe when the trade name or fictitious business name used by a business is not the legal name of the of the actual owner (the individual responsible for it). It is also used when a business is to be operated separately under a parent company or corporation.",
                "You would need to use a DBA if you do not want to incorporate or do business under your own name. You may also need to use a DBA name if your legal name is already in use by someone else and is unavailable. It is important to remember that a business with a fictitious name does not identify the person or entity legally responsible for its operation. Many states require that you register DBA or fictitious business names in order to protect consumers who do business with you.",
                "The process to register your DBA name varies depending on the state or region you will be operating in. Typically, you will register your DBA with the local county or city clerk's office, or with the business department of your state government.",
                "There are workplace laws and standards for businesses with employees. You will need to understand federal, state, and local requirements for hiring, paying, and firing employees.",
                "The first thing you need to do is determine what federal employment laws will apply to your business. The U.S. Department of Labor (DOL) provides a web site called 'elaws - FirstStep Employment Law Advisor'(https://webapps.dol.gov/elaws/FirstStep.htm).",
                "This site offers a short primer on employment laws, explanations of recordkeeping, notice, and reporting requirements, and links to printable resources such as posters and regulation summaries.",
                "The Americans with Disabilities Act (ADA) prohibits discrimination against people with disabilities in employment, transportation, public accommodation, communications, and governmental activities. The ADA also establishes requirements for telecommunications relay services.",
                "The Family and Medical Leave Act (FMLA) entitles eligible employees of covered employers to take unpaid, job-protected leave for specified family and medical reasons with continuation of group health insurance coverage under the same terms and conditions as if the employee had not taken leave.",
                "The Uniformed Services Employment and Reemployment Rights Act (USERRA) protects service members' reemployment rights when returning from a period of service in the uniformed services, including those called up from the reserves or National Guard, and prohibits employer discrimination based on military service or obligation. The U.S. Department of Labor's (DOL) Veterans' Employment and Training Service (VETS) administers Uniformed Services Employment and Reemployment Rights Act (USERRA).",
                "You must get an employment identification number (EIN) from the U.S. Internal Revenue Service before you hire your first employee. This is the number you will use to report taxes and other documents to the IRS and to state agencies. While not required by the federal government, some banks may require even sole proprietors to obtain an EIN for their business bank account and some state and local authorities may require it for business licenses. You can apply for this number online, by phone, via fax, or mail. There is no payment to acquire an EIN. To apply for an EIN online, visit the IRS' Online EIN application site. URL: https://www.irs.gov/businesses/small-businesses-self-employed/how-to-apply-for-an-ein",
                "Labor laws vary by state. You need to determine which local laws apply to your business. The U.S. Department of Labor provides a complete directory of individual state labor offices with contact and web site information. URL: https://www.dol.gov/whd/local/",
                "Although local employee laws are usually modeled after federal and state laws, they sometimes extend certain rights and protections beyond what the federal and state laws require. Unlike some federal and state labor laws, local labor laws often apply to smaller employers as well.",
                "Make sure that you check with your city or county business office to find out what local legal requirements you need to be aware of.",
                "Your responsibilities for federal taxes depend on the structure and size of your business.",
                "Income Tax: Unless you have a business partnership, you will have to file an annual income tax return with the Internal Revenue Service. The type of return you file depends on the business structure you have selected.",
                "Estimated Tax: This is the tax you expect to owe the federal government based on projected earnings of your business, and is usually in the form of regular payments through the year.",
                "Self-Employment Tax: If you are a sole proprietor of your business, you will need to pay self-employment tax, which covers your required contributions to social security and Medicare.",
                "Employment Tax: If you will have employees working for you, you will be responsible for specific taxes and forms. These include withholding income tax, social security and Medicare taxes, and Federal unemployment tax.",
                "Excise Tax: Certain manufacturing businesses and service providers must pay excise taxes. Some examples include the operation of large vehicles or accepting wagers.",
                "More Information: You can get more detailed information on federal tax requirements for businesses at the IRS' Business Tax website. URL: https://www.irs.gov/businesses/small-businesses-self-employed/business-taxes",
                "Sales taxes are typically required by both state and local governments for both products and services (labor).",
                "What? Sales tax is a point-of-purchase state and/or local tax paid by the purchaser for retail goods and services.",
                "Why? You are required to determine applicable sales tax for any products or services you provide, collect the tax from consumers, and pass tax revenue on to the responsible state and local authorities. Note that regulations and requirements for sales tax vary by state, which can become complicated if you sell to consumers in multiple states.",
                "How? Your state or local government may require you to obtain a sales tax permit in order to collect tax revenue from consumers. This revenue is typically paid monthly or quarterly, and requires that you complete returns and reports to the responsible government entities.",
                "Business income taxes are collected by most states, and depend on the legal structure of your business.",
                "In some cases, a Limited Liability Company (LLC) is taxed separately from the owner, who will also file an individual income tax return. However, this is not always the case. LLC rules vary by state, so check with your accountant or legal advisor to discuss your options.",
                "If you are the sole proprietor for your business, you will use the same form to report your personal and business income taxes.",
                "You can find out specific business income tax information for your state by reading SBA's article, Determine Your State Tax Obligations, on their web site. URL: https://www.sba.gov/business-guide/manage-your-business/pay-taxes",
                "You need to check the location you plan to use for your business to make sure that the property is zoned correctly. You can find this out by contacting your local planning agency. The types of restrictions you are likely to encounter depend on if you are planning a home-based or separate (brick and mortar) business. Select each type for more information.",
                "Residential areas tend to be much more restrictive than business areas. Be sure to check for any local zoning restrictions for your property. Some of the typical restrictions include: Changes to the physical appearance of your home, such as outside displays or parking commercial vehicles, Impact on local traffic limiting the number of customers or employees, and Noise or nuisance, such as storage of hazardous chemicals or unusual odors.",
                "Brick and Mortar is a traditional physical building specifically used for your business or operation. A brick and mortar business will normally be located in a commercial zone, which typically has fewer restrictions than a residential area. However, there are different types of commercial zones. Make sure your business fits into the property limitations. Brick and mortar businesses fall under two general zoning classifications: commercial and industrial.",
                "Commercial Zoning - Commercial business zones are typically used for retail sales and service operations. Restrictions common to commercial areas often relate to the availability of parking or the proximity of certain types of businesses to others. As an example, many communities prohibit or restrict the locations of bars or dance clubs.",
                "Industrial Zoning - If your business involves manufacturing or bulk storage, you are likely to fall under industrial zoning requirements. Typical restrictions in industrial areas include the amount of lot coverage and setback from property boundaries, as well as environmental factors such as noise and pollution.",
                "Karla Hall wants to start a home-based mobile car repair service where she does minor repairs to vehicles at the owner's home or place of business. Because she depends on advertising and word-of mouth, she plans to have her work van painted up as a rolling billboard. However, her neighborhood is zoned residential R-1 and does not allow commercial vehicles to be parked on the street or front driveway. Also, one neighbor has objected to the possibility that she may be parking inoperable vehicles on her property. Select each folder to see what happened.",
                "Karla went to the city planning commission to request a zoning variance, noting that her van is a converted standard passenger model no bigger than many passenger vehicles used by her neighbors. She does not plan to repair any vehicles at her home.",
                "Karla agrees to erect a privacy fence around her back yard and park her vehicle behind the fence at night. The planning commission approves a conditional variance and both Karla and the neighbors are satisfied.",
                "Any time a small business offers or sells securities, even to just one person, the offer and sale must either be registered with the U.S. Securities and Exchange Commission (SEC) or qualify for the one of the registration exemptions provided under the Securities Act. Registration is usually necessary if you advertise for investors in any way. You can get more information on registering offerings by reading the SEC's A Guide for Small Businesses on Raising Capital and Complying with the Federal Securities Laws guide. URL: https://www.sec.gov/info/smallbus/secg.shtml",
                "Note that public offerings are not recommended for new businesses because the time and cost involved and they lack the prior performance needed to generate sales.",
                "You will need to check for any special permits or licenses your business requires, including possible workplace inspection and approval by the Occupational Safety and Health Administration (OSHA).",
                "Business Permits: Federal, state, and local governments may require special business permits for your business. Examples include a seller's permit for reselling wholesale merchandise or a health permit for food preparation businesses.",
                "Professional Licenses: Certain businesses or services may be required by state or local agencies to have professional/occupational licenses. Examples include real estate sales and operation of child care facilities. You can use BusinessUSA's Start A Business tool to identify occupation or professional license requirements for your business.",
                "OSHA: As an employer, you are required to provide your employees with a safe and healthy workplace. The U.S. Department of Labor's Occupational Safety and Health Administration (OSHA) provides an on-line Small Business Handbook that will help you understand and meet the legal requirements and recommendations so that you can achieve an 'In-Compliance' status before an OSHA inspection. For more information refer to the OSHA Small Business Handbook. URL: https://www.osha.gov/Publications/smallbusiness/small-business.html",
                "If your business operation has any impact on the local environment, you will need to check with the U.S. Environmental Protection Agency (EPA) and state environmental agencies. Many environmental regulations apply to small businesses, and the EPA and other agencies will work with you to explain specific requirements. Commonly required environmental permits involve the Clean Air Act, risks to endangered species, and use of wetlands.",
                "You can get specific information on environmental issues and regulations that may affect your business from the EPA by visiting their Compliance web site (http://www2.epa.gov/enforcement/small-businesses-and-enforcement).",
                "You will face a variety of legal risks with the operation of your small business, both internal and external. While it is not possible to be prepared for all issues that could come up, you should analyze your business operation and take steps to minimize potential risks. Select each item for some examples of legal risks for small businesses.",
                "In the small business world, Law of Agency typically describes a legal situation where an employer authorizes an employee to deal with a customer and the employee causes a legal issue that results in a lawsuit against the employee and employer. As an example, a new employee of a tree removal service accidentally drops a branch on a customer's car and causes severe damage. The customer then sues both the employee and the tree removal company for damages. The best way to mitigate this risk is to ensure that your employees only undertake tasks they are qualified for and to be as explicit as possible when defining the authority and responsibilities with someone who may act as an agent of your business.",
                "Direct customer legal action: There are some simple steps you can take to limit the possibility of a lawsuit against your company: Avoid conflicts of interest. Be careful of what you say and do. Have a good lawyer available to help with decisions before they cause problems. Separate your personal assets from the business. Make sure you have adequate liability insurance. Make sure your critical data is protected and backed up.",
                "Disputes with partners, employees, and suppliers can arise over a wide range of issues such as debts and contractual obligations. These disputes represent a risk of disruption of services or sales to your customers, which may result in legal action. You can mitigate the risk of these disputes by following these guidelines: Document all agreements, Be alert for signs of trouble",
                "We have looked at some of the main legal requirements you may need to understand and deal with as you start your small business, such as: Determining federal, state, and local requirements, Explaining the requirements for hiring, paying, and firing employees, Identifying tax collection and reporting requirements, Understanding the importance of zoning ordinances, securities registration, business permits and occupational/professional licenses. We also briefly described environmental regulations that may impact your business, and Examined ways small business owners can manage legal risks.",
                "Remember that this has just been an overview of requirements - detailed information is available from the sites and sources identified within the lesson. You can also find a wide variety of information and help at the SBA website.",
                "SBA has a broad network of skilled counselors and business development specialists. Below is a short description of our resource partners: Small Business Development Centers: Achieve your dream of business ownership and remain competitive in an ever-changing global economy with assistance from your local SBDC. Access free counseling and free or low-cost training on topics like regulatory compliance, technology development, and international trade. Find an SBDC adviser at sba.gov/sbdc. SCORE: Join the ranks of other business owners who have experienced higher revenues and increased growth thanks to SCORE, the nation’s largest network of volunteer business mentors. Experienced executives share real-world knowledge to fit your busy schedule. SCORE mentors are available for free as often as you need, in person, via email or over video chat. Find a mentor at sba.gov/score. Women’s Business Centers: Women entrepreneurs receive essential business counseling and training from this national network of community-based centers. Each center tailors its services to help you navigate the challenges women often face when starting or growing a business. To learn about SBA resources for women visit sba.gov/women. Veterans Business Outreach Centers: Veteran and military entrepreneurs receive business training, counseling, and referrals to other SBA Resource Partners at a Veterans Business Outreach Center, sba.gov/vboc. Receive procurement guidance to better compete for government contracts. VBOCs also serve active duty service members, National Guard or Reserve members, veterans of any era, and military spouses. The SBA has over 60 District Offices located throughout the country to help you start and grow your business. Find all your local resources in one place using our convenient zip-code tool: www.SBA.gov/local-assistance"
            ]
        }
    ]
}
