{
    "state": "Tennessee",
    "pages": [
        {
            "source": "",
            "paragraphs": [
               "To incorporate in the state of Tennessee you must follow the following steps:\n1. Choose a Corporate Name.\n2. Appoint a Registered Agent. \n3. Set Up a Corporate Records Book. \n4. Prepare Corporate Bylaws. \n5. Appoint Initial Corporate Directors. \n6. Hold Your First Board of Directors Meeting. \n7. Issue Stock. \n8. Comply with Tennessee Annual Report Requirements.\n9.  Comply with Tennessee Annual Report Requirements\n10.  Comply With Other Tax and Regulatory Requirements\n\n2. Appoint a Registered Agent. ...\n3. Set Up a Corporate Records Book. ...\n4. Prepare Corporate Bylaws. ...\n5. Appoint Initial Corporate Directors. ...\n6. Hold Your First Board of Directors Meeting. ...\n7. Issue Stock. ...\n8. Comply with Tennessee Annual Report RequirementS.\n9.  Comply with Tennessee Annual Report Requirements\n10.  Comply With Other Tax and Regulatory Requirements",
               "The filing fee is $50 per member, with a minimum fee of $300 and a maximum fee of $3000.",
               "In general, turnaround time for incorporating a business in Tennessee is 5 business days. Expedited filings, which require an additional fee, typically take 3 business days.",
               "Business licenses are permits issued by government agencies that allow individuals or companies to conduct business within the government's geographical jurisdiction. Most Tennessee businesses are required to have business licenses, which are issued by the local county clerk. If a business is located in a city that has enacted the city business tax, a city business license is required as well, if annual gross receipts are $3,000 or more. Businesses with annual gross receipts under $10,000 can qualify for minimal activity licenses. Businesses with $10,000 or more in annual gross receipts require regular business licenses.",
               "The Articles of Incorporation is a document that once filled with the Department of State Division of Corporations, it validates your incorporation. The articles must include the following information:\n\nCorporation's name\nOffice street address\nThe Corporation's purpose\nThe name, a signature, and address of the registered agent for service of process\nThe name and address of the person incorporating the company",
               "Incorporating a business means turning your sole proprietorship or general partnership into a company formally recognized by your state of incorporation. When a company incorporates, it becomes its own legal business structure set apart from the individuals who founded the business. Through incorporation, the company's owner or owners create a separate legal entity to transact business. This new business entity corporation or limited liability company (LLC) transforms the way the business is seen through the eyes of the law and often has more credibility with potential customers, vendors and employees.",
               "A corporation is an independent legal entity that exists separately from the people who own, control and manage it.\nIt does not dissolve when its owners (or shareholders) die because it is considered a separate “person.”\nA corporation can enter into contracts, pay taxes, transact business, etc.\nThe owners have limited liability.\n",
               "A limited liability company (LLC) is similar to a corporation, but with slight differences.\nLike a corporation, it offers limited personal liability. \nAn LLC is not required to hold regular stockholder or management meetings, and there are no requirements to comply with other corporate formalities.",
               "A partnership exists when two or more persons co-own a business and share in the profits and losses of the business.\nEach of the co-owners or partners contribute something, usually money or real property, to the business endeavor.",
               "A general partnership is a legal structure where the rights and responsibilities are divided equally among the partners. The partners are referred to as general partners because each partner can act on behalf of all the partners, and each partner is responsible for the partnership’s debts and obligations. information.",
               "A limited partnership is a legal structure where both general and limited partners benefit from the business’s profits. It is composed of both general and limited partners.\nThis type of partnership allows each partner to determine and\/or limit his or her personal liability.\nUnlike general partners, limited partners are not responsible for the partnership’s actions, debts and obligations.\nGeneral partners have the right to manage the business. Limited partners do not.\n ",
               "A sole proprietorship is the simplest and most common structure chosen to start a business.\nIt is an unincorporated business owned and operated by one individual with no distinction between the business and the owner. \nSole proprietorships, when not operating under the owner’s legal name, must register a fictitious name with the Division of Corporations."
            ]
        }
    ]
}
