{
    "state": "Texas",
    "pages": [
        {
            "source": "https://www.sos.state.tx.us/corp/formationfaqs.shtml",
            "paragraphs": [
                "In Texas, the Office of the Secretary of State cannot help you determine the best entity type for your particular business needs. We have provided general information about types of Texas business organizations on our Selecting a Business Structure (https://www.sos.state.tx.us/corp/businessstructure.shtml) page. For personalized assistance, you should consult your private attorney.",
                "In Texas, Certificates of formation can be filed online through SOSDirect (https://www.sos.state.tx.us/corp/sosda/index.shtml) 24 hours a day, 7 days a week.",
                "For information on certifying a “historically underutilized business,” please contact the Texas Comptroller of Public Accounts at (888) 863-5881 or (512) 463-5872. The Texas Business Organizations Code does not address the formation of minority-owned businesses.",
                "You do not have to be a U.S citizen or a U.S. resident to incorporate and/or own a corporation in Texas. Texas law does not restrict who can form or have an ownership interest in a business entity, other than requiring the organizer to be a person capable of entering into a contract. An entity may impose residency or citizenship requirements in its certificate of formation or other governing documents, if desired. For information on restrictions that might apply to the entity you are creating, consult your attorney or the IRS.",
                "With regard to whether a person younger than 18 can be a director, officer, or owner of a business entity in Texas, the Texas Business Organizations Code does not impose any age requirements on who can be an owner, officer, or director in a business entity. An entity may impose requirements in its certificate of formation or other governing documents, if desired. Other laws might impose restrictions, and there may be issues related to a minor’s capacity to contract or to be an owner of an entity with a liquor license. For information on restrictions that might apply to the entity you are creating, consult your attorney or the IRS.",
                "A registered agent is an individual Texas resident or a domestic entity, or a foreign entity that has qualified or registered to transact business in Texas who is responsible for receiving and forwarding service of process or official notices addressed to an entity.  Effective on January 1, 2010, a person who is appointed or designated as an entity’s registered agent must have consented in a written or electronic form to serve as the registered agent of the entity. An entity’s registered office must be a physical address in Texas where the registered agent can be personally served with process during business hours. It cannot solely be the address of a mailbox service or telephone answering service. The secretary of state cannot serve as an entity’s registered agent. For more information, please see our Registered Agent FAQs (https://www.sos.state.tx.us/corp/registeredagentfaqs.shtml).",
                "In Texas, there is no need to publish a notice before incorporating a business. The requirement that an existing unincorporated business intending to incorporate without a change in its name publish its intent to incorporate in the local newspaper for four consecutive weeks was repealed in 2003.",
                "In Texas, Corporations, LLCs, and LPs are formed by filing a certificate of formation with the secretary of state. Corporations are owned by shareholders, managed by a board of directors, and administered by officers. LLCs are owned by members and managed by members, managers, or both. An LP is a partnership of one or more limited partners and one or more general partners. For more information, see Selecting a Business Structure (https://www.sos.state.tx.us/corp/businessstructure.shtml). A limited liability partnership (LLP) is either a pre-existing general partnership or a pre-existing limited partnership (LP) that takes the additional and entirely optional step of registering with the secretary of state as an LLP. Tex. Bus. Orgs. Code §§152.801 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.801) et seq. and 153.351 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.153.htm#153.351) et seq. Filing an application for registration of an LLP does not create a partnership or any other entity. Instead, an LLP is merely an optional registration that is made by an underlying, pre-existing partnership. Each of these entity structures shields its owners from personal liability for the debts and obligations of the entity and may offer tax advantages that are not available to sole proprietorships and general partnerships. Each of these entities must also pay Texas franchise taxes. The secretary of state cannot determine which entity would be best for any individual situation. A private attorney can assist with that determination.",
                "In Texas, if you want to organize your entity as a corporation or LLC and you will be performing professional services, then you may be required to form as a professional entity.  Partnerships are not subject to the same restrictions on performing professional services. The secretary of state has created a guide for determining permissible entity types (https://www.sos.state.tx.us/corp/forms/entitychart.pdf) (PDF). Please note however, that the guide is not a substitute for the advice of a private attorney and is subject to change without notice at any time.",
                "In Texas, professional associations can only be formed by (1) doctors of medicine, (2) doctors of osteopathy, (3) podiatrists, (4) mental health professionals (such as psychologists, family therapists, and licensed professional counselors),(5) optometrists, (6) therapeutic optometrists, (7) chiropractors, (8) dentists, or (9) veterinarians. BOC § 301.003 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.301.htm#301.003). Subject to the limitations set forth in BOC § 301.012, as amended by H.B. 2098 (http://www.capitol.state.tx.us/tlodocs/82R/billtext/html/HB02098F.htm), a licensed physician assistant may jointly own a professional association with a licensed physician. Certain restrictions, limitations, and reporting requirements apply to such jointly owned professional associations.  A physician or physician assistant interested in this option is encouraged to consult with a private attorney to ensure that all legal requirements are met.",
                "Filing a certificate of formation with the Texas secretary of state creates a for-profit corporation, professional corporation, close corporation, nonprofit corporation, LLC or limited partnership. Designations such as “S,” “C,” or “501(c)(3)” refer to federal tax provisions. For information on federal tax issues, including how they might affect what you need to include in your certificate of formation, consult a private attorney and/or contact the Internal Revenue Service (http://www.irs.gov/).",
                "In Texas, a close corporation is any domestic for-profit corporation or professional corporation that states in its certificate of formation that \"this corporation is a close corporation.\" The statement can be included in a corporation’s initial certificate of formation, or it can be added later by filing a certificate of amendment. A close corporation may be managed according to a shareholders' agreement instead of by a board of directors or bylaws. Frequently, shareholders in close corporations agree to limit the conditions under which shares may be transferred or sold, apportion profits and losses in a specific manner, or set terms and conditions for share ownership or management positions. For more information, please see BOC §§ 21.701 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.21.htm#21.701) et seq.",
                "In Texas, one person can be the sole shareholder, director, and officer of a corporation. The Texas Business Organizations Code requires that for-profit corporations and professional corporations have at least one director, one president, and one secretary. A single natural person can be the president, secretary, sole director, and sole shareholder. In the case of a nonprofit corporation, the Texas Business Organizations Code requires a nonprofit corporation to have at least three directors, one president, and one secretary; however, in a nonprofit corporation, the same person cannot be both the president and secretary. In both for-profit corporations and nonprofit corporations, officers and directors must be natural persons.",
                "In Texas, a for-profit corporation must issue (sell) shares of stock in order to provide the corporation with its own capital, separate from its owners’ money. Shares of stock sold by the corporation represent proportionate ownership interests held by shareholders in the corporation. \"Par value\" is the minimum amount for which a share may be sold. There is no minimum or maximum par value that must be assigned; however, a share cannot have a par value of “zero” or “.00.” Shares may have \"no par value,\" which means that the board of directors will assign a value to the stock below which the shares cannot be sold. A certificate of formation must authorize at least one share. The corporation cannot sell more shares than it is authorized to issue.",
                "In Texas, a member of an LLC is a person that holds an ownership or membership interest in the LLC. An LLC is always going to have at least one member, but the affairs of the LLC can be managed or governed in one of two ways. First, the LLC may be governed by its members as a whole. In this situation, every member has management authority. An LLC with this type of management structure is often referred to as a member-managed LLC. Second, the LLC may elect to have a separate group of managers to manage the affairs of the LLC. The managers of an LLC may or may not also be members. Your certificate of formation has to specify how the LLC will be managed. The secretary of state cannot assist you in making this determination. If you are unsure of the best management structure for your LLC, you may want to consult with your private attorney.",
                "In Texas , there are restrictions on who can be an owner, governing person, or officer of a Texas professional entity. Depending on the type of professional entity, an owner or governing person may be a professional individual, or in some cases a professional organization. Only a professional individual may be an officer. See BOC §§301.004, 301.007 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.301.htm). The table below shows the BOC restrictions for each type of Texas professional entity. (There may be additional restrictions in the governing documents for a particular entity.) \"Professional individual\" means an individual who is licensed to provide the same professional service as is rendered by that professional entity. BOC §301.003(5) (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.301.htm#301.003). \"Professional organization\" means a person other than an individual that renders the same professional service as the professional entity only through owners, members, managerial officials, employees, or agents, each of whom is a professional individual or professional organization. BOC §301.003(7) (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.301.htm#301.003). Table Showing Requirements for Owners, Governing Persons, and Officers for Texas Professional Entities. See: https://www.sos.state.tx.us/corp/formationfaqs.shtml#BF16",
                "Filing a certificate of formation will not keep others from using your company name. Generally, every business must protect its own intellectual property and good will. Filing a certificate of formation only prevents the secretary of state from filing a subsequent certificate of formation for an entity with a name that the secretary of state determines is not distinguishable in the records.",
                "Texas law does not provide for registration of a business’s trade name, whether that business is incorporated or unincorporated. Individuals and unincorporated entities that do business using an assumed name (often referred to as a \"dba\") must file an assumed name certificate with the county clerk in each county in which business premises are maintained. If a corporation, LLC, or LP does business under a name other than the legal name in its certificate of formation, it must file assumed name certificates with the secretary of state and with the clerk of the appropriate county. (See Assumed Name FAQ #9) (https://www.sos.state.tx.us/corp/namefilingsfaqs.shtml#aname9)",
                "The Texas secretary of state recommends that you consult a private attorney about trademarks, service marks, and other intellectual property matters.",
                "The Texas secretary of state cannot file an entity name that is the same, except for the organizational identifier, as an existing entity name on file unless the existing entity provides written notarized consent.",
                "In Texas, under the provisions of sections 31.005 (http://www.statutes.legis.state.tx.us/Docs/FI/htm/FI.31.htm#31.005) and 181.004(a) (http://www.statutes.legis.state.tx.us/Docs/FI/htm/FI.181.htm#181.004) of the Texas Finance Code, the name of a domestic or foreign entity is prohibited from containing certain words in its title. The Banking Commissioner has the authority to issue a letter of no objection for use of these words or terms. Receipt of the letter from the Commissioner will enable the requestor to submit certain filings to the secretary of state. The following names, or phonetically similar derivatives of such names, taken from the list of prohibited names, have been determined to require a letter of no objection from the Banking Commissioner. Bank Banc Bank and Trust Trust Persons seeking the issuance of a letter of no objection should submit a letter containing the following information to the Banking Department's Corporate Activities Division at the address appearing below: A detailed letter describing in plain language: the exact name they are seeking to use and the primary business activities of the entity in Texas; and why use of the term \"bank,\" \"banc,\" \"trust,\" etc., is important to use in the name and yet is not deceptive to the public; and the license status on the entity either: (1) indicating the status of any license(s) that the corporation must obtain in order to do business in this state, or (2) representing that no license or authorization is necessary to conduct that business in this state. A commitment addressed to the Commissioner from management of the entity, or an agent authorized to bind the entity, that the entity will not advertise or hold out to the public in any manner that it is a state or national bank, trust company or A full explanation of any affiliation with a bank, bank holding company, trust company, or other financial institution; Evidence of any qualification to do business in other states; and, $100 filing fee. If the entity owns or operates a web site, that contains the words \"bank,\" \"banc,\" \"trust\" etc., management of the entity, or an agent authorized to bind the entity, must submit a commitment that the entity will prominently display the following disclaimer on its homepage \"(name of entity) is not a chartered bank or trust company, or depository institution. It is not authorized to accept deposits or trust accounts and is not licensed or regulated by any state or federal banking authority.\" The Banking Commissioner will review the proposed name and use of terms, along with other material submitted as a whole in order to make a decision. Submission of the $100 filing fee is required for consideration, but does not constitute guarantee of approval of the proposed name. Generally, the Commissioner will grant a request if, in context, the term is not misleading and is used (1) to indicate a permissible and authorized affiliation with a bank or trust company; (2) by an actual trust or entity controlled by the trust for the purpose of conducting its own business (other than the business of providing banking or fiduciary services to the public); (3) by a vendor of services or products to financial institutions in a manner and context that fairly describes its business; or (4) as a term of art in a manner and context that clearly invokes an established secondary meaning. If your request falls outside these parameters, the chance of approval is slim. Requests should be addressed to: Corporate Activities Division Texas Department of Banking 2601 North Lamar Blvd. Austin, TX 78705-4294",
                "The Texas Education Code prohibits the use of the terms \"college,\" \"university,\" \"school of medicine,\" \"medical school,\" \"health science center,\" \"school of law,\" \"law school,\" and \"law center.\" If a proposed name includes these terms, or terms of similar meaning, whether in English or another language, the entity must obtain the prior approval of the Texas Higher Education Coordinating Board (“THECB”). Tex. Ed. Code, § 61.313 (http://www.statutes.legis.state.tx.us/Docs/ED/htm/ED.61.htm#61.313). For authorization to use any of these terms in an entity name, a request letter should be submitted to the THECB stating the following: Name of the entity as proposed to be filed with the secretary of state. A brief statement of the business of the entity. One or two sentences should be sufficient; do not cut and paste boilerplate language from the certificate of formation. The following disclaimer, providing it is true: “The entity is not now nor will be a private institution of higher education or an educational or training establishment.” If you wish to have your response faxed to you by THECB, in the body of the letter request a fax and provide your fax number. The request letter must contain the address and telephone number of the entity or person requesting the authorization (business letterhead is acceptable).  The letter may be sent by the entity requesting the authorization or an agent representing the entity (attorney or other entity authorized to represent the entity to facilitate the approval) Please mail or fax this information to: Academic Affairs and Research Division Texas Higher Education Coordinating Board P.O. Box 12788 Austin, TX 78711 512-427-6168 (fax) A copy of the approval letter from THECB should be submitted with your certificate of formation or other filing instrument to the secretary of state.",
                "Only certain types of entities file annual or periodic reports with the Secretary of State. A Texas partnership registered as a Texas limited liability partnership (LLP) is required to file an annual report with the secretary of state no later than June 1 of each year following the calendar year in which the application for registration takes effect. A notice to file the LLP annual report is sent by the secretary of state no later than March 31 of the current report year. Nonprofit corporations (Texas and foreign) are required to file a periodic report with the secretary of state upon receiving notice, but not more than once every four years. The secretary of state will send notice to the nonprofit corporation at the registered agent address on file. Certain limited partnerships (Texas and foreign) that are not subject to state franchise tax are required to file a periodic report with the secretary of state upon receiving notice, but not more than once every four years. The secretary of state will send notice to a limited partnership at the registered agent address on file. For-profit and professional corporations, professional associations, LLCs, and certain limited partnerships (whether Texas or foreign) that are subject to state franchise tax laws file annually with the Comptroller of Public Accounts. As part of the annual franchise tax reports, these taxable entities file a Public Information Report (PIR). The PIR lists the names and addresses of persons who are officers/directors and managers at the time the report is filed.",
                "Texas law does not require a business to have a seal; therefore the secretary of state does not have information or regulations on how to design a seal or where to obtain one. Seals, stock certificates, and minute books can be purchased from book stores, office supply stores, or corporate service companies.",
                "The Texas secretary of state does not issue employer identification numbers. For information on EINs, contact the Internal Revenue Service (http://www.irs.gov/).",
                "The Texas Secretary of State cannot answer the question of how much franchise tax your entity must pay. For information, please visit the Texas Comptroller of Public Accounts franchise tax website (http://www.franchisetax.tx.gov/).",
                "You cannot file your entity's bylaws, company agreement or other internal governing documents with the Texas secretary of State. A business entity keeps its internal governing documents at its principal office. No statute permits the filing of these documents with the secretary of state; therefore, the secretary of state cannot accept them for filing.",
                "In Texas, in order to receive a file-stamped copy of a filing instrument, you must submit a duplicate copy of the filing instrument. The secretary of state does not reject filing instruments that are not accompanied by a duplicate copy if the filing instrument otherwise conforms to the statutory requirements. In addition, the secretary of state is not required to attach a file-stamped copy of an instrument when no duplicate copy has been provided",
                "You do not have to file a document with the secretary of state when selling or issuing shares or ownership interests in your entity. The offer for sale or sale of shares or ownership interests is regulated under state and federal securities laws. For information on whether a filing is required under Texas or federal securities laws, contact the Texas State Securities Board (http://www.ssb.state.tx.us/Contact_Us/Email_Address.php) and the Securities and Exchange Commission (http://www.sec.gov/answers.shtml).",
                "The Texas Business Organizations Code (BOC) does not recognize the term “nonprofit LLC” as describing a specific type of entity, but the BOC does allow for the formation of an LLC with a nonprofit purpose. Although a for-profit corporation is prohibited from “operating a nonprofit institution” (BOC §2.008), the BOC does not impose this prohibition on LLCs. This is one of the few substantive changes introduced by the BOC.",
                "A Texas LLC that states a nonprofit purpose is not automatically exempt from state or federal taxes. For information on whether the IRS will grant a tax-exempt status to such an LLC, contact the IRS or read IRS Publication 557 (http://www.irs.gov/publications/p557/index.html): Tax-Exempt Status for Your Organization. For information on whether the Texas Comptroller will grant tax-exempt status, contact the Comptroller’s Exempt Organizations Section (https://www.comptroller.texas.gov/taxes/exempt/).",
                "The secretary of state does not have a form you can use to form an LLC with a nonprofit purpose. Form 205 (Word (https://www.sos.state.tx.us/corp/forms/205_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/205_boc.pdf)) can be used to create a general purpose LLC, but it is not designed to create an LLC with a nonprofit purpose, and it is not designed to satisfy any requirements that the IRS or Texas Comptroller might impose for tax-exemption. You should consult with your attorney if you want to form a tax-exempt or nonprofit LLC.",
                "A Texas LLC that states a nonprofit purpose remains an LLC, as that term is defined in section 1.002(46). It is subject to the regular LLC fees, and it is governed by the regular LLC provisions (§§101.001 et seq.).",
                "A series LLC, formed under Texas law, is an LLC that provides in its governing documents for the establishment of a series of members, managers, membership interests, or assets that have separate rights, obligations and liabilities and business purposes from the general LLC. Each individual series has the ability to sue and be sued, enter into contracts, hold title to assets, and grant liens or security interests in its assets. A series of the LLC is not a separate domestic entity or organization for purposes of title 1 and chapter 101 of the Texas Business Organizations Code. [See SB 847 (https://webservices.sos.state.tx.us/legbills/files/RS/SB847.pdf), effective 9/01/13]. If you have questions about the legal or tax advantages/disadvantages of forming a series LLC, you should consult with your private attorney and/or tax advisor. The secretary of state’s office cannot provide you with this advice.",
                "You should consult with your private attorney if you are considering forming a series LLC. In order to receive any of the benefits of a series LLC, at minimum, the language required by section 101.602(a)(1)-(2) ()http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.101.htm#101.602 of the Texas Business Organizations Code must be included in your certificate of formation and company agreement, and you must maintain separate records for the assets of each series. See sections 101.601-101.621 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.101.htm#M) of the Texas Business Organizations Code for more information. The secretary of state does not have a specific form to be used to form a series LLC. If you want to use our general certificate of formation for a limited liability company (Form 205 Word (https://www.sos.state.tx.us/corp/forms/205_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/205_boc.pdf)), you may do so and add the additional required information in the Supplemental Text area of the form.",
                "If each or any series of the LLC conducts business under a name other than the name of the LLC, the LLC must file an assumed name certificate for the name of the series in compliance with chapter 71 of the Texas Business & Commerce Code. [See HB 1624 (https://webservices.sos.state.tx.us/legbills/files/RS/HB1624.pdf), effective 9/01/13]. See Form 503 (Word (https://www.sos.state.tx.us/corp/forms/503_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/503_boc.pdf)).",
                "You can register your out-of-state series LLC to transact business in Texas. A series LLC formed under the laws of another jurisdiction will be treated as a single legal entity for qualification purposes. The LLC itself rather than the individual series should register as the legal entity that is transacting business in Texas. The secretary of state has a separate application for registration form for foreign series LLC. See Form 313 (Word (https://www.sos.state.tx.us/corp/forms/313_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/313_boc.pdf)). If each or any series of the LLC transacting business in Texas transacts business under a name other than the name of the LLC, the LLC must file an assumed name certificate in compliance with chapter 71 of the Texas Business & Commerce Code. See Form 503 (Word (https://www.sos.state.tx.us/corp/forms/503_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/503_boc.pdf)).",
                "Not all states recognize a series LLC. You should contact the filing official in the state(s) where you contemplate transacting business to determine if the state recognizes series LLCs and, if so, the filing requirements. You may also want to consult with your private attorney to determine if a series LLC is the best structure to meet your business goals.",
                "In Texas, a limited liability partnership (LLP) is either a pre-existing general partnership or a pre-existing limited partnership (LP) that takes the additional and entirely optional step of registering with the secretary of state as an LLP. Tex. Bus. Orgs. Code §§152.801 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.801) et seq. and 153.351 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.153.htm#153.351) et seq. Filing an application for registration of an LLP does not create a partnership or any other entity. Instead, an LLP is merely an optional registration that is made by an underlying, pre-existing partnership.",
                "A general partnership is defined as “an association of two or more persons to carry on a business for profit as owners.” §152.051 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.051). General partnerships can be created by oral or written agreement. General partnerships are created without filing any formation documents with the secretary of state. A general partnership must have at least two partners, and each partner in a general partnership is a general partner. If a general partnership chooses to take the additional step of registering as an LLP, it must use “limited liability partnership” (or any abbreviation thereof, such as LLP) in its legal name. §5.063 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.5.htm#5.063). The only way to create a Texas limited partnership (LP) is to file a certificate of formation with the secretary of state.§§3.001(a) (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.3.htm#3.001); 1.002(22) (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.1.htm#1.002). See Form 207 (Word (https://www.sos.state.tx.us/corp/forms/207_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/207_boc.pdf)). A limited partnership (LP) consists of one or more general partners plus one or more limited partners. §1.002(50) (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.1.htm#1.002). If a limited partnership (LP) chooses to take the additional step of registering as a limited liability partnership (LLP), it must use either “limited liability partnership” (or any abbreviation thereof, such as LLP) or “limited liability limited partnership (LLLP)” (or any abbreviation thereof, such as LLLP) as an organizational indicator in its legal name.§5.055 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.5.htm#5.055). A limited liability partnership (LLP) is not an entity separate and apart from its underlying partnership. Filing an application for registration of an LLP does not create a partnership. Instead, an LLP is a registration that is made by a pre-existing general partnership or a pre-existing limited partnership (LP).",
                "In Texas, by fulfilling the requirements of sections  (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.801) et seq. or 153.351 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.153.htm#153.351) et seq. and registering as an LLP, a partnership gives its general partners the personal liability protection described in section 152.801 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.801).",
                "In Texas, the most common causes for your application to register an LLP being rejected are: (1) If an application to register a partnership as an LLP indicates that the underlying partnership is a limited partnership (LP), but there is no record that a formation document was filed with this office to create an LP, we will reject the application. A limited partnership (LP) must be created and in existence before it can take the additional step of registering as an LLP. (2) If an application to register a partnership as an LLP states that the underlying partnership only has one general partner, the underlying partnership must be an LP. (General partnerships must have at least two partners, and every partner in a general partnership is a general partner.) If there is no record that a formation document was filed with this office to create an LP, we will reject the LLP application. An LP can only be created by filing formation documents with our office. An LP must be created and in existence before it can take the additional step of registering as an LLP.",
                "There have been significant changes in the Texas Tax Code (http://www.statutes.legis.state.tx.us/?link=TX). Currently, some partnerships are subject to franchise tax. If a partnership is not otherwise subject to franchise tax, registering the partnership as an LLP will subject the partnership to franchise tax. For more information, contact the Texas Comptroller of Public Accounts (https://www.comptroller.texas.gov/purchasing/vendor/hub/) and/or your private attorney.",
                "In Texas, you cannot “form” an LLP; instead, you can form a partnership (either a general partnership or a limited partnership (LP)), and the partnership can choose to take the steps to register as an LLP. An LLP is not an entity separate and apart from the underlying partnership; instead, it is a registration that is made by the underlying partnership, namely, a pre-existing general partnership or a pre-existing limited partnership (LP) to limit the liability of its partners. Registering an LLP does not create a partnership.",
                "In Texas, you cannot convert an entity into an LLP; instead, you can convert your entity into a partnership (either a general partnership or a limited partnership (LP)), and the partnership can choose to take the steps to register as an LLP. If you submit conversion documents listing the converted entity type as an “LLP,” the secretary of state will reject the documents and ask you to specify whether the converted entity type is an LP or a general partnership.", 
                "In Texas, to register a pre-existing general partnership as an LLP, or to register a pre-existing limited partnership (LP) as an LLP, you must file an application for registration with our office. You may use Form 701 (Word (https://www.sos.state.tx.us/corp/forms/701_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/701_boc.pdf)) as your application for registration. The filing fee is $200 per general partner. Effective January 1, 2016, Senate Bill 859 (http://www.capitol.state.tx.us/tlodocs/84R/billtext/pdf/SB00859F.pdf#navpanes=0) amended Chapter 152 of the Business Organizations Code (BOC) to add Section 152.806, which requires a Texas LLP to file an annual report with the secretary of state. The annual report is due no later than June 1 of each year following the calendar year in which the application for registration takes effect. The filing fee for the annual report is $200 per general partner as of the date of filing the report. Failure to file the annual report and pay the report filing fee may result in the termination of the partnership’s registration as an LLP.",
                "Insofar as how long a partership's LLP registration lasts: see Texas LLPs: Effective January 1, 2016, Senate Bill 859 (http://www.capitol.state.tx.us/tlodocs/84R/billtext/pdf/SB00859F.pdf#navpanes=0) amended §152.802 of the Business Organizations Code (BOC) to eliminate the annual renewal requirement for Texas LLPs. The amendments made the registration of a Texas LLP effective until it is voluntarily withdrawn by the partnership or terminated by the secretary of state. Out-of-state LLPs: Senate Bill 859 did not make any changes to section §152.901 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.901) of the BOC, which provides for the registration of out-of-state LLPs. The registration of an out-of-state LLP to transact business in Texas lasts one year, but may be renewed before it expires for an additional one year term. See Form 308 (Word (https://www.sos.state.tx.us/corp/forms/308_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/701_boc.pdf)).",
                "In Texas, if an LLP registration has expired, it cannot be renewed. If the partnership wants to register as an LLP, it must file a new registration. See Form 701 (Word (https://www.sos.state.tx.us/corp/forms/701_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/701_boc.pdf)). New registrations cannot be backdated. Expiration of an LLP registration does not affect the existence of the underlying partnership; however, there may be a gap in liability protection.",
                "An out-of-state LLP has to register with the secretary of state before it transacts business in Texas. §152.901 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.152.htm#152.901) et seq. See Form 307 (Word (https://www.sos.state.tx.us/corp/forms/307_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/307_boc.pdf)). The fee for registration is $200 for each general partner that resides in Texas, but no less than $200 and no more than $750. LLP registrations must be renewed each year. See Form 308 (Word (https://www.sos.state.tx.us/corp/forms/308_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/701_boc.pdf)).  If the underlying partnership is a LP, the LP must also file a separate application for registration.  The fee for this one-time registration is $750.  See Form 306 (Word (https://www.sos.state.tx.us/corp/forms/306_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/306_boc.pdf)).",
                "The Texas Business Organizations Code does not address the question of whether an LLP needs to inform the secretary of state when the underlying partnership has dissolved or otherwise voluntarily terminated its existence. However, on and after January 1, 2016, the registration of a Texas LLP remains effective until it is voluntarily withdrawn by the partnership or involuntarily terminated by the secretary of state. If the underlying partnership has been dissolved, the partnership may voluntarily withdraw its registration. See Form 704 (Word (https://www.sos.state.tx.us/corp/forms/704_boc.doc), PDF (https://www.sos.state.tx.us/corp/forms/704_boc.pdf)). The secretary of state can remove from its active records the registration of an LLP or LLLP whose registration has been withdrawn or terminated.", 
                "Traditionally, Texas corporations have been characterized as either for-profit or nonprofit corporations. Generally, a corporation organized for charitable, benevolent, religious, cultural or other similar purposes must be formed as a nonprofit corporation. [See § 2.008 (http://www.statutes.legis.state.tx.us/Docs/BO/htm/BO.2.htm#2.008) of the Texas Business Organizations Code.] However, § 3.007 of the Code was amended by SB 849 (http://www.capitol.state.tx.us/BillLookup/Text.aspx?LegSess=83R&Bill=SB849), effective September 1, 2013, to authorize a for-profit corporation to include one or more social purposes in its certificate of formation. The specific social purpose or purposes would be in addition to the purpose or purposes required to be stated in the for-profit corporation’s certificate of formation. Social purposes are defined in § 1.002(82-a) of the Code and consist of promoting one or more positive impacts or minimizing negative impacts on society or the environment. For example, social purposes may include providing low-income or underserved individuals or communities with beneficial products or services; promoting economic opportunity for individuals or communities; preserving the environment; improving human health; promoting the arts, sciences, or advancement of knowledge; increasing the flow of capital to entities with a social purposes; and conferring any particular benefit on society or the environment. The certificate of formation may also include a provision that the board of directors and officers of the for-profit corporation may consider any social purpose specified in the certificate of formation in discharging the duties of directors or officers. To determine the extent and circumstances under which an officer or director of a for-profit corporation must consider social purposes, please review chapter 21 of the Code, specifically §§ 21.101 and 21.401, as amended by SB 849. If you have questions about social purposes, you should consult with your attorney. The secretary of state’s office cannot provide you with legal or business advice.",
                "HB 3488 (https://webservices.sos.state.tx.us/legbills/files/RS85/HB3488.pdf) (PDF), effective September 1, 2017, authorizes a for-profit corporation to elect to be a public benefit corporation. A public benefit corporation is a domestic for-profit corporation that is intended to produce a public benefit and to operate in a responsible and sustainable manner.",
                "The Texas Secretary of State does not have a form for creating a public benefit corporation. You may draft your own certificate of formation in accordance with Chapters 3 and 21 of the Texas Business Organization Code. The formation document should include (1) one or more specific public benefits to be promoted by the corporation and (2) a statement that the filing entity is a for-profit corporation electing to be a public benefit corporation. See HB 3488 (PDF (https://webservices.sos.state.tx.us/legbills/files/RS85/HB3488.pdf)). Please note that instead of the organizational identifiers required for a for-profit corporation, a public benefit corporation name may contain the words “public benefit corporation,” the abbreviation “P.B.C.” or the designation “PBC.”  If the entity chooses to not include one of these identifiers, there may be other internal notice requirements.",
                "A public benefit corporation is required to be managed in a way that balances (1) the shareholders’ pecuniary interest, (2) the best interest of those persons materially affected by the corporation’s conduct, and (3) the public benefit or benefits specified in the corporation’s certificate of formation. The board of directors must manage or direct the business and affairs of the corporation in a manner that balances the same interests listed above. Tex. Bus. Orgs. Code § 21.95(a).",
                "A public benefit corporation is a for-profit corporation that has elected to be a public benefit corporation; therefore, a conversion is not necessary. You may file a certificate of amendment to amend your certificate of formation to include the necessary language."               
            ]
        }
    ]
}
