{
    "state": "Wisconsin",
    "pages": [
        {
            "source": "https://www.wdfi.org/corporations/faqs.htm",
            "paragraphs": [
                "To get the forms to file in Wisconsin, note the following: the department publishes forms for almost every type of transaction. They are available on the forms page (https://www.wdfi.org/corporations/forms/). Forms in hard copy format may be requested from Department of Financial Institutions Div. of Corporate & Consumer Services P O Box 7846, Madison WI, 53707-7846 Indicate your mailing address and the type of transaction for which you need the form. Forms are not available via FAX because of poor image quality",
                "In Wisconsin, your situation will dictate whether or not you need an attorney, but it is not mandatory that you engage an attorney. The department has forms and instructions available, but cannot offer legal advice. The persons forming the business have the responsibility to select the appropriate type of entity (corporation, LLC, limited partnership, etc.) to use. A lawyer can offer professional guidance in making this decision and in organizing the entity.",
                "In Wisconsin, generally, charter documents are acted on within five working days after their receipt. During periods of high volume filing (end of calendar and fiscal years), delays in some types of transactions may occur. If you need your transaction completed sooner than that, you may request Expedited Service for an additional $25 fee.",
                "In Wisconsin, most transactions are acted on within five working days following their receipt by the department. You may call the department to confirm that a document has been received (608-261-7577), but its acceptance cannot be determined until it has been examined.",
                "In Wisconsin, you should deliver your charter document or service request with an additional $25.00 Expedited Service fee for each transaction. Mark the request conspicuously \"FOR EXPEDITED SERVICE\". Expedited service requests are acted on by the close of business the following business day.",
                "The following Entities are filed with the Division of Corporate and Consumer Services: Business Corporations, Nonstock (Not-for Profit) Corporations, Cooperatives, Limited Partnerships, Limited Liability Companies, Limited Liability Partnerships, General Partnership (optional registration), Common Law Trusts, Foreign (out-of-state) entities of the same types, licensed to transact business in Wisconsin, Unincorporated Cooperative Associations, Veterans organizations, and certain types of religious corporations",
                "In Wisconsin, Sole Proprietorships can register their business name by filing a registration of Tradename. See our Trademark and Tradename page (https://www.wdfi.org/Apostilles_Notary_Public_and_Trademarks/defaultTrademark.htm) for more information. The application form (https://www.wdfi.org/Apostilles_Notary_Public_and_Trademarks/pdf/dfi-trd-102.pdf) for Registration is also on our website. If you have questions, you may contact the Trademark section at the Department of Financial Institutions at PO Box 7847, Madison WI 53707-7847, or by phone at 608-266-8915.",
                "In Wisconsin, a corporation is a general-purpose entity in which management is exercised by a board of directors elected by shareholders. \"Ownership\" in a corporation is reflected in the shares held by the individual shareholder. A limited liability company has members (similar to a partnership) who may directly manage the company or who may vest management in one or more managers. It combines features of a partnership and a corporation. \"Ownership\" of the LLC is reflected in the individual \"member's interest,\" i.e., the member's share of the profit and losses of the company, rights to receive distribution of assets, and to participate in the management of the company. Please read about Business Entity Types on our website.",
                "In Wisconsin, for questions about Entities on Record, Officer, Director and Member Information, Status, Status Dates & Transactions, Name Availability, General Guidelines, Name Reservation, and Obtaining a Tax IC Number, please see the requisite sections at the following page: https://www.wdfi.org/corporations/faqs.htm#officer_director",
                "In Wisconsin, to get the form for a sub \"S\" or sub \"C\" corporation, note the following: Sub. \"C\" and sub. \"S\" refer to subsections of the Internal Revenue Code signifying the federal tax status of a corporation. Articles of incorporation are filed with this department in the usual manner, but you need to contact IRS to have the corporation specifically recognized as a sub \"C\" or sub \"S\" corporation. Please read frequently asked questions for Small Business/Self-Employed/Other Business (https://www.irs.gov/faqs/small-business-self-employed-other-business) at the IRS. You can reach IRS by phone at 1-800-829-1040 or at the IRS website.",
                "In Wisconsin, Corporations file Articles of Incorporation and an Annual Report with the Department of Financial Institutions, and statements to keep their officer/director and registered agent/registered office information current. Search Corporate Registration Information System - CRIS (https://www.wdfi.org/apps/CorpSearch/Search.aspx) to see what documents are on file. To obtain a copy of articles of incorporation and/or the most recently filed annual report, place an order through our Online Order System (https://www.wdfi.org/apps/oos/?CategoryID=1,3,4,5,7,2) or submit a request on Adobe PDF Document Certificate of Status and Simple/Certified Copywork (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-SP48-50.pdf). NOTE: The department's records do not contain information concerning the officers, directors, members, managers or shareholders of LLC's, limited partnerships, or limited liability partnerships, sole proprietors, general partnerships, or business conducted under assumed names.",
                "In Wisconsin, the Department of Financial Institutions Division of Corporate and Consumer Services Corporate Section will give verbal status over the phone, from our general number at 608-261-7577. You may also determine the status yourself by looking up the corporation using the Corporate Registration Information System - CRIS (https://www.wdfi.org/apps/CorpSearch/Search.aspx). If you need written confirmation of a corporation's status, place an order online at www.wdfi.org/apps/ccs/ or enter a request for a \"Certificate of Status\" using Adobe PDF Document Certificate of Status and Simple/Certified Copywork (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-SP48-50.pdf).",
                "In Wiconsin, a corporation goes delinquent because it failed to file its required annual report with this department. If a corporation is allowed to continue in delinquent status for an extended period, it runs the risk of being administratively dissolved. Delinquent status may be cured by filing a current annual report and paying the back annual report fees. Call (608) 261-7577, provide the name and current address of your corporation and ask to be sent the appropriate forms to correct the delinquent status.",
                "In Wisconsin, organizations are not required to reveal ownership information to this department. Corporations are obliged to file an annual report with the department, indicating the name and address of its officers and directors, but no information is disclosed with respect to the shareholders (\"owners\") of the corporation.",
                "The registered agent is the person, resident in Wisconsin, designated by the corporation to receive official communications on its behalf, such as service of process, annual report forms, tax forms, etc. It may be an officer or employee of the corporation, or someone not directly involved, such as an attorney. It is important to keep the registered agent and registered office information current, as significant consequences could arise for failure to receive and act on important papers sent to the corporation's registered agent. The physical address of the corporation's registered agent's business office is the corporation's \"registered office.\"",
                "In Wisconsin, a corporation may change its registered agent or registered office by appropriately noting the change on its annual report filed with DFI, or by separately filing a Form 13 - Registered Agent and/or Registered Office Change (https://www.wdfi.org/apps/corpSearch/Search.aspx?appURL=/apps/productselect/RegAgent/Index/)",
                "In Wisconsin, the Department of Financial Institutions will for a fee supply a certified copy of any filed document or issue a statement concerning the status of any entity on record. The Corporate Registration Information System (CRIS) has some basic file information on 704,741 active and inactive entities. Elements of the CRIS database are collected into a \"Corporation Master File\" available for purchase on CD. The file contains much of the information available on CRIS, but does not reflect officer/director information. Verbal information on records, basic filing procedures and fees are provided by a Telephone/Reception unit operating during business hours.",
                "If you would like to do some research on your own on what is involved in starting a business in Wisconsin, start with The Wisconsin Small Business Development Center (https://wisconsinsbdc.org/services/consulting/start/), a statewide network supporting entrepreneurs and business owners through no-cost, confidential consulting and targeted educational programs.",
                "In Wisconsin, dissolution of a business or nonstock corporation or limited liability company (LLC) cannot be accomplished on the Annual Report filing. You must file Articles of Dissolution to legally dissolve the entity. If the business or nonstock corporation or LLC is in delinquent status, you are required to pay any and all back fees due the department at the time of dissolution in addition to the filing fee for the Articles of Dissolution. For a business Corporation, you will need DFI Online Application Online Form 10 (https://www.wdfi.org/apps/gofr/Form/Index/6) or Adobe PDF Document Form 10 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-10.pdf) and Form 10 Instructions (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-10-I.pdf). For a nonstock Corporation, you will need Form 110 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-110.pdf). For an LLC, you will need DFI Online Application Online Form 510 (https://www.wdfi.org/apps/gofr/Form/Index/4) or Adobe PDF Document Form 51 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-510.pdf) and Form 510 Instructions (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-510-I.pdf).",
                "A foreign corporation or limited liability company (LLC) no longer conducting business in Wisconsin may file a Form 24 or Form 524, respectively, to withdraw its Certificate of Authority/Registration. For foreign Corporations, you will need Form 24 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-24.pdf). For foreign LLCs, you will need Form 524 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-524.pdf).",
                "In Wisconsin, effective immediately, the \"Received\" date of documents will be set forth on the Endorsement page of the \"Filed\" documents.",
                "In Wisconsin, Domestic and foreign corporations, limited liability companies, and limited liability partnerships may correct a document that was filed by the department if the document contains a statement that was incorrect at the time of filing or if the document was defectively executed, including defects in any attestation, seal, verification or acknowledgement. Articles of Correction may not be used to cancel or undo filed Articles of Dissolution or any other previously filed document. To make a correction, file Articles of Correction Form 53 (https://www.wdfi.org/_resources/indexed/site/corporations/dfi-corp-53.pdf)."
            ]
        }
    ]
}
