{
    "state": "Wyoming",
    "pages": [
        {
            "source": "https://soswy.state.wy.us/faqs.aspx?root=BUS",
            "paragraphs": [
                " Please refer to \"How to Choose a Company Name\" for more information.",
                "To find or become a registered agent, click here: https://soswy.state.wy.us/Business/Docs/HowToFindOrBecomeARegisteredAgent.pdf",
                "Please refer to Please refer to \"How do I create a Wyoming company\" https://soswy.state.wy.us/Business/Docs/HowToCreateAWyomingCompany.pdf for more information."
                "Email your request to SOSRequest@wyo.gov. Certified copies must be paid at the time of the request, either by check, money order, or (PAD) pre-paid account. We are happy to provide you with an estimate of the amount due for copy fees in addition to the $3 certification fee.",
                "Yes, these entities pay a license tax based on all assets located and employed in Wyoming. The tax is $50 or two-tenths of one mill on the dollar ($.0002), whichever is greater.",
                "The tax is $50. An entity with $250,000 or less in assets pays a minimum of $50.",
                "The tax is $242 ($1,210,000 x .0002 = $242).",
                "To remain in good standing each business entity, domestic and foreign (with the exception of Statutory Trusts), are required to file an annual report and pay a fee based on its assets located and employed in Wyoming. Statutory Trusts pay a flat $100 annual report fee due on January 1 of each year. For all other business entities, annual reports are due on the first day of the anniversary month of formation.",
                "Yes, any business entity doing business in Wyoming without authority will be liable for a penalty in the amount of $5,000 along with reasonable audit expenses and reasonable attorney fees. Therefore, contact the Secretary of State’s office before doing business in Wyoming.",
                "Refer to W.S. 17-16-1501 http://legisweb.state.wy.us/statutes/statutes.aspx?file=titles/Title17/T17CH16AR15.htm. Then, if you are still in doubt, you should consult legal counsel to determine if you are transacting business within Wyoming in accordance with Wyoming statutes.",
                "Wyoming has no state requirements for charities and fund raisers, however your corporation may be required to qualify as a foreign corporation in Wyoming. Refer to W.S. 17-19-1501 Wyoming has no state requirements for charities and fund raisers, however your corporation may be required to qualify as a foreign corporation in Wyoming. Refer to W.S. 17-19-1501. Then, if you are still in doubt, you should consult legal counsel to determine if you are transacting business within Wyoming in accordance with Wyoming statutes. Then, if you are still in doubt, you should consult legal counsel to determine if you are transacting business within Wyoming in accordance with Wyoming statutes.",
                "There are several different requirements for Continuation and Domestication filings. We have a page summarizing those differences https://soswy.state.wy.us/Business/Continuance_v_Domestication.aspx on this site.",
                "An entity dissolved/revoked for failure to file annual reports within the past two (2) years, and which has no other delinquencies, may file a reinstatement online, or generate reinstatement filing forms for traditional mail-in processing. Entities having multiple delinquencies will be provided the appropriate filing forms for traditional mail-in processing.Click here to begin the process. https://wyobiz.wy.gov/Business/Reinstatement.aspx",
                "Please contact the Department of Revenue: Department of Revenue Herschler Building, 2nd Floor West 122 West 25th Street Cheyenne, WY 82002-0110 Ph. 307.777.5200 Email: dor@wyo.gov Website: revenue.state.wy.us",
                "There are no state requirements for general contracting, except for electrical contractors. Contact: State Fire Marshall Department of Fire Prevention & Electrical Safety Herschler Building Cheyenne, WY 82002 Ph. 307.777.7993",
                "Contact the city clerk in the town in which you will be doing business for information on private detective/investigator licenses. You will also need to contact the local Sheriff's office.",
                "Contact the Wyoming Business Council for assistance with licenses and permits. Wyoming Business Council 214 West 15th Street Cheyenne, WY 82002 Ph. 307.777.2843 Website: http://www.wyomingbusiness.org",
                "File an Application for Certificate of Authority pursuant to W.S. 17-16-1503 File an Application for Certificate of Authority pursuant to W.S. 17-16-1503 of the 1989 Wyoming Business Corporation Act. Information may be obtained by contacting this office.  of the 1989 Wyoming Business Corporation Act. Information may be obtained by contacting this office. https://soswy.state.wy.us/ContactUs.aspx",
                "A general or prime contractor is required to withhold 4% payment from a nonresident subcontractor's total contract amount until release of funds has been received pursuant to W.S. 39-15-306(b)(i) http://legisweb.state.wy.us/statutes/statutes.aspx?file=titles/Title39/T39CH12AR3.htm. The nonresident general or prime contractor is required to post a surety bond with the Department of Revenue. Information may be obtained by contacting: Department of Revenue Herschler Building 122 West 25th Street Cheyenne, WY 82002 Ph. 307.777.5242/5212 Fax 307.777.3632 Email: dor@state.wy.us Website: http://revenue.state.wy.us \"What are the differences between Continuation and Domestication filings?\"There are several different requirements for Continuation and Domestication filings. We have a page summarizing those differences on this site. https://soswy.state.wy.us/Business/Continuance_v_Domestication.aspx \"How do I reinstate my company?\" An entity dissolved/revoked for failure to file annual reports within the past two (2) years, and which has no other delinquencies, may file a reinstatement online, or generate reinstatement filing forms for traditional mail-in processing. Entities having multiple delinquencies will be provided the appropriate filing forms for traditional mail-in processing. Click here to begin the process. https://wyobiz.wy.gov/Business/Reinstatement.aspx",
                "Impact employers may be required to make a cash prepayment to the Unemployment Insurance Fund. For an employee, you must pay unemployment insurance. Information may be obtained by contacting: Department of Employment Employment Resources Division P.O. Box 2760 Casper, WY 82602-2760 Ph. 307.235.3217 Fax 307.235.3278 Website: http://wydoe.state.wy.us",
                "Nonresident employers may be required to post a bond. A nonresident employer is one who has not been domiciled in Wyoming for 12 months immediately prior to commencing operations in the state. If you employ workers in extra-hazardous occupations, you must cover them under this program. Information may be obtained by contacting: Department of Employment Workers' Safety & Compensation Division Herschler Building 122 West 25th Street Cheyenne, WY 82002-0700 Ph. 307.777.6763 Fax 307.777.5298 Website: http://wydoe.state.wy.us",
                "Depending on volume, it may take from 3 to 5 days to form a business entity. Wyoming does not offer expedited services.",
                "No, you do not need an attorney, but you should consult with a legal advisor concerning legal issues. The Business Division does not provide legal advice.",
                "In Wyoming it is not mandatory to register a DBA name. However, you may register a DBA by filing a Trade Name application.\"Click here\" https://soswy.state.wy.us/Forms/Business/TN/TN-RegistrationApplication.pdf for the form.",
                "Click here for the “Choice is Yours” https://soswy.state.wy.us/Forms/Publications/ChoiceIsYours.pdf pamphlet. This publication provides the advantages and disadvantages of each business entity. After you have decided which type of entity to form, consult with a legal advisor. Forms which meet the minimum filing requirements https://soswy.state.wy.us/Forms/FormsFiling.aspx?startwith=Business are available from this site. ",
                "Yes, Wyoming law requires entities doing business in this state to qualify by completing and filing a Certificate of Authority Application form with the Business Division. Click here to access the forms https://soswy.state.wy.us/Forms/FormsFiling.aspx?startwith=Business. Click here for access to W.S. 17-16-1501 – Doing Business in Wyoming http://legisweb.state.wy.us/statutes/statutes.aspx?file=titles/Title17/T17CH16AR15.htm",
                "The initial filing fee for each of these entities is $100.",
                "The filing fee is $25.",
                "The filing fees range from $3 to $10. For example, articles of amendment are $3 and articles of dissolution are $10.",
                "SBA: Small Business Administration Home Page https://www.sba.gov/ SEC: Small Business Information http://www.sec.gov/smbus1.htm USBA: U.S. Business Advisor https://www.usa.gov/business",
                "Refer to the \"How To Trace Old Stock\" https://soswy.state.wy.us/Business/docs/HowToTraceOldStock.pdf letter. ", 
                "Click here for the \"Form SS-4, Application for Employer Identification Number (EIN)\" https://www.irs.gov/uac/Form-SS-4,-Application-for-Employer-Identification-Number-(EIN) and for important IRS links and information.",
                "Wyoming offers: No personal income tax, No corporate income tax, No gross receipts tax, No inventory tax, 4% retail sales tax, Low property taxes, Favorable inheritance tax, Favorable unemployment tax,"
                "Information may be obtained by contacting the Wyoming Small Business Development Center ; or the Wyoming Business Council 214 West 15th Street Cheyenne, WY 82002 Ph. 307.777.2800 Email: info@wyomingbusiness.org Website: http://www.wyomingbusiness.org",
                "All securities, including limited partnership interests, must be cleared for sale or be exempt from registration under Wyoming's Uniform Securities Act (W.S. 17-4-107) http://legisweb.state.wy.us/statutes/statutes.aspx?file=titles/Title17/T17CH4.htm before being sold to residents in this state. Information may be obtained by contacting the Compliance Division of this office. https://soswy.state.wy.us/ContactUs.aspx",
                "The statutes can be obtained from the Legislative Service Office. http://legisweb.state.wy.us/",
                "Fax your request to 307.777.5339 or email SOSRequest@state.wy.us. The Division will mail and invoice you for the amount due. ",
                "Yes, click here to generate a good standing certificate at no charge. https://wyobiz.wy.gov/Business/ViewCertificate.aspx",
                " Yes, click here to access the Business Division database https://wyobiz.wy.gov/Business/DefaultBD.aspx for business entity information including, but not limited to, the name and address of the registered agent, officers and directors, status, standing, and mailing address. ",
                "The quickest way to obtain your copies is to visit our Business Online Services and conduct a search https://wyobiz.wy.gov/Business/FilingSearch.aspx for the business entity. Once on the business record, click on the \"History\" option. If a PDF icon appears to the right of the filing or amendment, an image of the filing/amendment is available through that icon. If you still aren't able to obtain all of the documents you need, please email your request to SOSRequest@wyo.gov.",
                "An entity dissolved/revoked for failure to file annual reports within the past two (2) years, and which has no other delinquencies, may file a reinstatement online, or generate reinstatement filing forms for traditional mail-in processing. Entities having multiple delinquencies will be provided the appropriate filing forms for traditional mail-in processing. Click here to begin the process. https://wyobiz.wy.gov/Business/Reinstatement.aspx"
 
            ]
        }
    ]
}
